{"PAD": 0, "DUMMY_START_RELATION": 1, "UNK": 2, "27_6": 3, "36_41": 4, "2_41": 5, "2_36": 6, "33_41": 7, "33_36": 8, "33_28": 9, "27_41": 10, "27_36": 11, "24_6": 12, "33_6": 13, "36_36": 14, "20_6": 15, "9_6": 16, "24_41": 17, "9_41": 18, "28_41": 19, "28_28": 20, "30_41": 21, "29_41": 22, "2_6": 23, "49_41": 24, "4_41": 25, "3_6": 26, "49_6": 27, "42_36": 28, "36_6": 29, "28_6": 30, "26_41": 31, "13_41": 32, "18_41": 33, "24_36": 34, "3_41": 35, "45_36": 36, "44_41": 37, "27_3": 38, "20_41": 39, "14_6": 40, "4_36": 41, "26_6": 42, "22_41": 43, "28_36": 44, "3_38": 45, "30_6": 46, "49_36": 47, "4_6": 48, "13_36": 49, "42_6": 50, "27_28": 51, "26_28": 52, "41_41": 53, "31_41": 54, "19_36": 55, "9_28": 56, "22_6": 57, "31_36": 58, "24_28": 59, "22_36": 60, "49_38": 61, "38_49": 62, "40_32": 63, "32_40": 64, "27_25": 65, "25_27": 66, "8_8": 67, "26_18": 68, "18_26": 69, "34_34": 70, "20_22": 71, "22_20": 72, "20_18": 73, "18_20": 74, "38_40": 75, "40_38": 76, "38_12": 77, "12_38": 78, "9_19": 79, "19_9": 80, "28_43": 81, "43_28": 82, "26_22": 83, "22_26": 84, "16_29": 85, "29_16": 86, "16_32": 87, "32_16": 88, "32_11": 89, "11_32": 90, "34_35": 91, "35_34": 92, "49_3": 93, "3_49": 94, "49_33": 95, "33_49": 96, "49_27": 97, "27_49": 98, "26_49": 99, "49_26": 100, "28_24": 101, "38_8": 102, "8_38": 103, "38_38": 104, "29_38": 105, "38_29": 106, "32_38": 107, "38_32": 108, "32_32": 109, "29_29": 110, "34_8": 111, "8_34": 112, "34_28": 113, "28_34": 114, "42_34": 115, "34_42": 116, "42_35": 117, "35_42": 118, "25_25": 119, "33_16": 120, "16_33": 121, "32_28": 122, "28_32": 123, "42_30": 124, "30_42": 125, "42_42": 126, "3_40": 127, "40_3": 128, "14_49": 129, "49_14": 130, "14_44": 131, "44_14": 132, "10_10": 133, "4_38": 134, "38_4": 135, "8_32": 136, "32_8": 137, "8_48": 138, "48_8": 139, "41_29": 140, "27_27": 141, "9_49": 142, "49_9": 143, "27_33": 144, "33_27": 145, "42_49": 146, "49_42": 147, "36_49": 148, "41_4": 149, "4_34": 150, "34_4": 151, "4_35": 152, "35_4": 153, "4_47": 154, "47_4": 155, "34_32": 156, "32_34": 157, "3_12": 158, "12_3": 159, "11_3": 160, "3_11": 161, "27_16": 162, "16_27": 163, "9_24": 164, "24_9": 165, "9_22": 166, "22_9": 167, "26_42": 168, "42_26": 169, "30_49": 170, "49_30": 171, "32_48": 172, "48_32": 173, "31_27": 174, "27_31": 175, "31_8": 176, "8_31": 177, "31_9": 178, "9_31": 179, "31_44": 180, "44_31": 181, "31_16": 182, "16_31": 183, "16_8": 184, "8_16": 185, "11_33": 186, "33_11": 187, "49_35": 188, "35_49": 189, "49_44": 190, "44_49": 191, "34_49": 192, "49_34": 193, "27_23": 194, "23_27": 195, "15_15": 196, "32_24": 197, "24_32": 198, "48_48": 199, "49_32": 200, "32_49": 201, "24_50": 202, "50_24": 203, "24_15": 204, "15_24": 205, "41_36": 206, "20_27": 207, "27_20": 208, "35_38": 209, "38_35": 210, "49_4": 211, "4_49": 212, "34_3": 213, "3_34": 214, "40_40": 215, "49_28": 216, "28_49": 217, "28_18": 218, "18_28": 219, "35_28": 220, "28_35": 221, "35_30": 222, "30_35": 223, "35_6": 224, "6_35": 225, "44_44": 226, "44_35": 227, "35_44": 228, "35_35": 229, "36_29": 230, "29_36": 231, "26_27": 232, "27_26": 233, "20_33": 234, "33_20": 235, "27_4": 236, "4_27": 237, "9_36": 238, "36_9": 239, "48_38": 240, "38_48": 241, "20_2": 242, "2_20": 243, "39_6": 244, "6_39": 245, "39_39": 246, "39_32": 247, "32_39": 248, "11_38": 249, "38_11": 250, "12_32": 251, "32_12": 252, "35_36": 253, "36_35": 254, "35_8": 255, "8_35": 256, "35_43": 257, "43_35": 258, "35_27": 259, "27_35": 260, "35_41": 261, "41_35": 262, "35_7": 263, "7_35": 264, "34_41": 265, "41_34": 266, "28_23": 267, "23_28": 268, "6_28": 269, "26_38": 270, "38_26": 271, "28_5": 272, "5_28": 273, "33_12": 274, "12_33": 275, "29_49": 276, "49_29": 277, "29_35": 278, "35_29": 279, "29_7": 280, "7_29": 281, "41_49": 282, "22_34": 283, "34_22": 284, "8_28": 285, "28_8": 286, "8_24": 287, "24_8": 288, "28_33": 289, "27_30": 290, "30_27": 291, "49_49": 292, "38_34": 293, "34_38": 294, "42_22": 295, "22_42": 296, "35_9": 297, "9_35": 298, "28_9": 299, "24_19": 300, "19_24": 301, "27_5": 302, "5_27": 303, "36_27": 304, "6_27": 305, "40_48": 306, "48_40": 307, "20_9": 308, "9_20": 309, "9_18": 310, "18_9": 311, "6_49": 312, "28_30": 313, "30_28": 314, "13_13": 315, "3_18": 316, "18_3": 317, "16_10": 318, "10_16": 319, "16_16": 320, "23_33": 321, "33_23": 322, "28_25": 323, "25_28": 324, "4_8": 325, "8_4": 326, "29_30": 327, "30_29": 328, "29_32": 329, "32_29": 330, "15_12": 331, "12_15": 332, "15_36": 333, "36_15": 334, "15_6": 335, "6_15": 336, "15_34": 337, "34_15": 338, "15_32": 339, "32_15": 340, "15_19": 341, "19_15": 342, "31_49": 343, "49_31": 344, "34_30": 345, "30_34": 346, "34_48": 347, "48_34": 348, "34_16": 349, "16_34": 350, "34_40": 351, "40_34": 352, "34_6": 353, "6_34": 354, "34_39": 355, "39_34": 356, "36_30": 357, "30_36": 358, "35_12": 359, "12_35": 360, "35_47": 361, "47_35": 362, "44_23": 363, "23_44": 364, "6_6": 365, "16_30": 366, "30_16": 367, "33_33": 368, "44_8": 369, "8_44": 370, "6_38": 371, "38_6": 372, "6_32": 373, "32_6": 374, "6_8": 375, "8_6": 376, "36_33": 377, "27_22": 378, "22_27": 379, "45_27": 380, "27_45": 381, "28_16": 382, "16_28": 383, "35_39": 384, "39_35": 385, "13_28": 386, "28_13": 387, "8_47": 388, "47_8": 389, "8_29": 390, "29_8": 391, "8_49": 392, "49_8": 393, "14_40": 394, "40_14": 395, "44_38": 396, "38_44": 397, "49_7": 398, "7_49": 399, "44_27": 400, "27_44": 401, "44_18": 402, "18_44": 403, "36_40": 404, "40_36": 405, "41_32": 406, "32_41": 407, "41_38": 408, "38_41": 409, "9_4": 410, "4_9": 411, "4_4": 412, "25_12": 413, "12_25": 414, "6_4": 415, "36_38": 416, "38_36": 417, "44_9": 418, "9_44": 419, "42_3": 420, "3_42": 421, "42_25": 422, "25_42": 423, "28_27": 424, "32_31": 425, "31_32": 426, "6_40": 427, "40_6": 428, "47_47": 429, "7_7": 430, "20_36": 431, "36_20": 432, "20_35": 433, "35_20": 434, "8_21": 435, "21_8": 436, "23_36": 437, "36_23": 438, "44_42": 439, "42_44": 440, "44_47": 441, "47_44": 442, "30_3": 443, "3_30": 444, "7_38": 445, "38_7": 446, "6_36": 447, "6_42": 448, "33_9": 449, "9_33": 450, "4_31": 451, "31_4": 452, "34_27": 453, "27_34": 454, "41_7": 455, "7_41": 456, "40_10": 457, "10_40": 458, "33_24": 459, "24_33": 460, "4_33": 461, "33_4": 462, "36_13": 463, "11_47": 464, "47_11": 465, "23_8": 466, "8_23": 467, "27_9": 468, "9_27": 469, "32_47": 470, "47_32": 471, "9_30": 472, "30_9": 473, "40_47": 474, "47_40": 475, "26_13": 476, "13_26": 477, "27_2": 478, "2_27": 479, "36_42": 480, "42_9": 481, "9_42": 482, "27_48": 483, "48_27": 484, "33_18": 485, "18_33": 486, "36_24": 487, "24_38": 488, "38_24": 489, "24_24": 490, "31_38": 491, "38_31": 492, "36_28": 493, "36_31": 494, "3_31": 495, "31_3": 496, "37_12": 497, "12_37": 498, "34_5": 499, "5_34": 500, "34_29": 501, "29_34": 502, "20_23": 503, "23_20": 504, "8_41": 505, "41_8": 506, "33_50": 507, "50_33": 508, "33_15": 509, "15_33": 510, "19_34": 511, "34_19": 512, "29_22": 513, "22_29": 514, "40_8": 515, "8_40": 516, "4_32": 517, "32_4": 518, "34_36": 519, "36_34": 520, "24_42": 521, "42_24": 522, "25_8": 523, "8_25": 524, "46_12": 525, "12_46": 526, "46_24": 527, "24_46": 528, "42_33": 529, "33_42": 530, "34_12": 531, "12_34": 532, "33_22": 533, "22_33": 534, "23_9": 535, "9_23": 536, "16_38": 537, "38_16": 538, "48_25": 539, "25_48": 540, "44_24": 541, "24_44": 542, "27_29": 543, "29_27": 544, "8_12": 545, "12_8": 546, "30_38": 547, "38_30": 548, "14_8": 549, "8_14": 550, "30_45": 551, "45_30": 552, "33_31": 553, "31_33": 554, "41_2": 555, "27_47": 556, "47_27": 557, "34_24": 558, "24_34": 559, "16_41": 560, "41_16": 561, "33_35": 562, "35_33": 563, "16_48": 564, "48_16": 565, "32_35": 566, "35_32": 567, "21_21": 568, "48_12": 569, "12_48": 570, "33_30": 571, "30_33": 572, "29_47": 573, "47_29": 574, "28_29": 575, "29_28": 576, "27_8": 577, "8_27": 578, "16_35": 579, "35_16": 580, "44_29": 581, "29_44": 582, "4_40": 583, "40_4": 584, "28_26": 585, "16_40": 586, "40_16": 587, "8_9": 588, "9_8": 589, "29_40": 590, "40_29": 591, "20_49": 592, "49_20": 593, "45_11": 594, "11_45": 595, "33_8": 596, "8_33": 597, "49_23": 598, "23_49": 599, "31_34": 600, "34_31": 601, "30_32": 602, "32_30": 603, "5_22": 604, "22_5": 605, "27_32": 606, "32_27": 607, "18_38": 608, "38_18": 609, "34_33": 610, "33_34": 611, "34_50": 612, "50_34": 613, "9_9": 614, "16_49": 615, "49_16": 616, "37_34": 617, "34_37": 618, "28_12": 619, "12_28": 620, "42_27": 621, "27_42": 622, "28_19": 623, "19_28": 624, "3_22": 625, "22_3": 626, "12_40": 627, "40_12": 628, "12_41": 629, "41_12": 630, "11_11": 631, "39_38": 632, "38_39": 633, "39_8": 634, "8_39": 635, "15_17": 636, "17_15": 637, "14_35": 638, "35_14": 639, "10_29": 640, "29_10": 641, "44_2": 642, "2_44": 643, "9_43": 644, "43_9": 645, "26_44": 646, "44_26": 647, "2_2": 648, "18_12": 649, "12_18": 650, "45_5": 651, "5_45": 652, "9_50": 653, "50_9": 654, "3_3": 655, "45_33": 656, "33_45": 657, "4_42": 658, "42_4": 659, "41_3": 660, "5_12": 661, "12_5": 662, "45_22": 663, "22_45": 664, "15_23": 665, "23_15": 666, "24_13": 667, "13_24": 668, "34_10": 669, "10_34": 670, "32_25": 671, "25_32": 672, "40_41": 673, "41_40": 674, "42_20": 675, "20_42": 676, "4_39": 677, "39_4": 678, "20_4": 679, "4_20": 680, "26_30": 681, "30_26": 682, "16_12": 683, "12_16": 684, "4_7": 685, "7_4": 686, "4_28": 687, "28_4": 688, "49_24": 689, "24_49": 690, "26_23": 691, "23_26": 692, "36_5": 693, "5_36": 694, "24_12": 695, "12_24": 696, "28_3": 697, "3_28": 698, "24_40": 699, "40_24": 700, "36_18": 701, "18_36": 702, "4_19": 703, "19_4": 704, "12_12": 705, "4_3": 706, "3_4": 707, "33_17": 708, "17_33": 709, "44_43": 710, "43_44": 711, "8_30": 712, "30_8": 713, "21_9": 714, "9_21": 715, "21_32": 716, "32_21": 717, "24_23": 718, "23_24": 719, "3_36": 720, "36_3": 721, "8_22": 722, "22_8": 723, "36_7": 724, "7_36": 725, "7_6": 726, "6_7": 727, "44_13": 728, "13_44": 729, "13_23": 730, "23_13": 731, "26_20": 732, "20_26": 733, "34_23": 734, "23_34": 735, "35_11": 736, "11_35": 737, "35_40": 738, "40_35": 739, "35_10": 740, "10_35": 741, "35_31": 742, "31_35": 743, "9_38": 744, "38_9": 745, "13_27": 746, "27_13": 747, "41_18": 748, "36_2": 749, "42_19": 750, "19_42": 751, "12_49": 752, "49_12": 753, "12_4": 754, "4_12": 755, "38_3": 756, "49_19": 757, "19_49": 758, "33_3": 759, "3_33": 760, "9_3": 761, "3_9": 762, "19_19": 763, "39_47": 764, "47_39": 765, "10_38": 766, "38_10": 767, "10_32": 768, "32_10": 769, "31_14": 770, "14_31": 771, "45_29": 772, "29_45": 773, "3_43": 774, "43_3": 775, "32_7": 776, "7_32": 777, "44_36": 778, "36_44": 779, "42_28": 780, "28_42": 781, "28_38": 782, "38_28": 783, "35_26": 784, "26_35": 785, "41_33": 786, "41_47": 787, "47_41": 788, "21_16": 789, "16_21": 790, "29_11": 791, "11_29": 792, "42_16": 793, "16_42": 794, "27_43": 795, "43_27": 796, "24_3": 797, "3_24": 798, "20_28": 799, "28_20": 800, "15_50": 801, "50_15": 802, "27_12": 803, "12_27": 804, "11_31": 805, "31_11": 806, "14_9": 807, "9_14": 808, "45_6": 809, "6_45": 810, "27_18": 811, "18_27": 812, "41_24": 813, "26_36": 814, "36_26": 815, "29_3": 816, "3_29": 817, "48_37": 818, "37_48": 819, "8_10": 820, "10_8": 821, "11_10": 822, "10_11": 823, "3_8": 824, "8_3": 825, "4_26": 826, "26_4": 827, "26_24": 828, "24_26": 829, "31_31": 830, "44_32": 831, "32_44": 832, "49_50": 833, "50_49": 834, "2_38": 835, "38_2": 836, "2_3": 837, "3_2": 838, "2_30": 839, "30_2": 840, "11_41": 841, "41_11": 842, "11_8": 843, "8_11": 844, "11_49": 845, "49_11": 846, "3_27": 847, "36_43": 848, "43_36": 849, "48_28": 850, "28_48": 851, "35_19": 852, "19_35": 853, "40_33": 854, "33_40": 855, "21_38": 856, "38_21": 857, "30_30": 858, "41_15": 859, "15_41": 860, "4_30": 861, "30_4": 862, "12_19": 863, "19_12": 864, "31_6": 865, "6_31": 866, "42_18": 867, "18_42": 868, "42_40": 869, "40_42": 870, "9_26": 871, "26_9": 872, "34_9": 873, "9_34": 874, "45_38": 875, "38_45": 876, "23_23": 877, "20_24": 878, "24_20": 879, "10_33": 880, "33_10": 881, "42_29": 882, "29_42": 883, "23_38": 884, "38_23": 885, "3_32": 886, "32_3": 887, "28_15": 888, "15_28": 889, "49_40": 890, "40_49": 891, "15_40": 892, "40_15": 893, "25_18": 894, "18_25": 895, "35_3": 896, "3_35": 897, "41_10": 898, "10_41": 899, "2_33": 900, "33_2": 901, "44_12": 902, "12_44": 903, "41_9": 904, "8_26": 905, "26_8": 906, "49_48": 907, "48_49": 908, "42_38": 909, "38_42": 910, "3_50": 911, "50_3": 912, "2_18": 913, "18_2": 914, "39_29": 915, "29_39": 916, "27_39": 917, "39_27": 918, "36_47": 919, "47_36": 920, "31_29": 921, "29_31": 922, "3_19": 923, "19_3": 924, "41_27": 925, "36_22": 926, "9_45": 927, "45_9": 928, "41_23": 929, "23_41": 930, "27_38": 931, "38_27": 932, "9_16": 933, "16_9": 934, "20_29": 935, "29_20": 936, "19_18": 937, "18_19": 938, "33_7": 939, "7_33": 940, "44_33": 941, "33_44": 942, "43_43": 943, "36_19": 944, "34_44": 945, "44_34": 946, "11_40": 947, "40_11": 948, "6_9": 949, "14_14": 950, "16_19": 951, "19_16": 952, "29_18": 953, "18_29": 954, "48_3": 955, "3_48": 956, "48_2": 957, "2_48": 958, "48_24": 959, "24_48": 960, "24_30": 961, "30_24": 962, "28_40": 963, "40_28": 964, "16_25": 965, "25_16": 966, "4_29": 967, "29_4": 968, "48_22": 969, "22_48": 970, "49_2": 971, "2_49": 972, "29_33": 973, "33_29": 974, "18_18": 975, "41_31": 976, "16_11": 977, "11_16": 978, "38_47": 979, "47_38": 980, "20_43": 981, "43_20": 982, "28_22": 983, "22_28": 984, "46_16": 985, "16_46": 986, "6_33": 987, "13_9": 988, "9_13": 989, "20_38": 990, "38_20": 991, "42_8": 992, "8_42": 993, "36_50": 994, "50_36": 995, "16_6": 996, "6_16": 997, "7_31": 998, "31_7": 999, "32_42": 1000, "42_32": 1001, "33_38": 1002, "38_33": 1003, "44_30": 1004, "30_44": 1005, "7_30": 1006, "30_7": 1007, "49_13": 1008, "13_49": 1009, "24_43": 1010, "43_24": 1011, "6_22": 1012, "10_12": 1013, "12_10": 1014, "36_8": 1015, "8_36": 1016, "16_18": 1017, "18_16": 1018, "42_12": 1019, "12_42": 1020, "29_12": 1021, "12_29": 1022, "38_5": 1023, "5_38": 1024, "13_15": 1025, "15_13": 1026, "29_6": 1027, "6_29": 1028, "9_15": 1029, "15_9": 1030, "49_22": 1031, "22_49": 1032, "45_49": 1033, "49_45": 1034, "15_27": 1035, "27_15": 1036, "34_13": 1037, "13_34": 1038, "9_2": 1039, "2_9": 1040, "39_45": 1041, "45_39": 1042, "39_48": 1043, "48_39": 1044, "30_18": 1045, "18_30": 1046, "42_31": 1047, "31_42": 1048, "44_4": 1049, "4_44": 1050, "13_22": 1051, "22_13": 1052, "42_47": 1053, "47_42": 1054, "24_27": 1055, "27_24": 1056, "4_24": 1057, "24_4": 1058, "49_39": 1059, "39_49": 1060, "24_16": 1061, "16_24": 1062, "34_26": 1063, "26_34": 1064, "44_3": 1065, "3_44": 1066, "9_40": 1067, "40_9": 1068, "6_26": 1069, "7_3": 1070, "3_7": 1071, "13_12": 1072, "12_13": 1073, "26_3": 1074, "3_26": 1075, "41_44": 1076, "49_18": 1077, "18_49": 1078, "14_23": 1079, "23_14": 1080, "20_31": 1081, "31_20": 1082, "20_16": 1083, "16_20": 1084, "41_28": 1085, "28_31": 1086, "31_28": 1087, "44_28": 1088, "28_44": 1089, "44_11": 1090, "11_44": 1091, "22_38": 1092, "38_22": 1093, "26_33": 1094, "33_26": 1095, "14_38": 1096, "38_14": 1097, "4_14": 1098, "14_4": 1099, "39_42": 1100, "42_39": 1101, "40_30": 1102, "30_40": 1103, "33_19": 1104, "19_33": 1105, "13_40": 1106, "40_13": 1107, "34_45": 1108, "45_34": 1109, "41_6": 1110, "6_41": 1111, "6_24": 1112, "34_18": 1113, "18_34": 1114, "34_11": 1115, "11_34": 1116, "9_32": 1117, "32_9": 1118, "27_19": 1119, "19_27": 1120, "41_30": 1121, "8_7": 1122, "7_8": 1123, "7_20": 1124, "20_7": 1125, "7_40": 1126, "40_7": 1127, "7_47": 1128, "47_7": 1129, "20_30": 1130, "30_20": 1131, "6_14": 1132, "30_31": 1133, "31_30": 1134, "2_28": 1135, "28_2": 1136, "20_11": 1137, "11_20": 1138, "36_14": 1139, "14_36": 1140, "30_5": 1141, "5_30": 1142, "50_50": 1143, "22_32": 1144, "32_22": 1145, "2_32": 1146, "32_2": 1147, "19_30": 1148, "30_19": 1149, "45_45": 1150, "43_38": 1151, "38_43": 1152, "43_34": 1153, "34_43": 1154, "22_18": 1155, "18_22": 1156, "42_41": 1157, "41_42": 1158, "34_47": 1159, "47_34": 1160, "27_7": 1161, "7_27": 1162, "42_23": 1163, "23_42": 1164, "9_47": 1165, "47_9": 1166, "4_45": 1167, "45_4": 1168, "46_49": 1169, "49_46": 1170, "7_2": 1171, "2_7": 1172, "6_13": 1173, "13_6": 1174, "35_18": 1175, "18_35": 1176, "4_23": 1177, "23_4": 1178, "45_18": 1179, "18_45": 1180, "48_18": 1181, "18_48": 1182, "8_5": 1183, "5_8": 1184, "8_18": 1185, "18_8": 1186, "31_13": 1187, "13_31": 1188, "37_32": 1189, "32_37": 1190, "13_4": 1191, "4_13": 1192, "36_4": 1193, "13_43": 1194, "43_13": 1195, "13_35": 1196, "35_13": 1197, "9_29": 1198, "29_9": 1199, "36_16": 1200, "16_36": 1201, "45_12": 1202, "12_45": 1203, "4_48": 1204, "48_4": 1205, "13_30": 1206, "30_13": 1207, "5_32": 1208, "32_5": 1209, "3_25": 1210, "25_3": 1211, "29_48": 1212, "48_29": 1213, "6_3": 1214, "44_25": 1215, "25_44": 1216, "23_31": 1217, "31_23": 1218, "24_22": 1219, "22_24": 1220, "29_23": 1221, "23_29": 1222, "44_10": 1223, "10_44": 1224, "31_12": 1225, "12_31": 1226, "39_44": 1227, "44_39": 1228, "43_16": 1229, "16_43": 1230, "39_50": 1231, "50_39": 1232, "41_22": 1233, "9_12": 1234, "12_9": 1235, "3_39": 1236, "39_3": 1237, "14_3": 1238, "3_14": 1239, "24_31": 1240, "31_24": 1241, "48_5": 1242, "5_48": 1243, "11_4": 1244, "4_11": 1245, "13_3": 1246, "3_13": 1247, "4_18": 1248, "18_4": 1249, "12_6": 1250, "6_12": 1251, "20_20": 1252, "24_35": 1253, "35_24": 1254, "42_2": 1255, "2_42": 1256, "7_28": 1257, "28_7": 1258, "7_14": 1259, "14_7": 1260, "40_25": 1261, "25_40": 1262, "3_47": 1263, "47_3": 1264, "16_22": 1265, "22_16": 1266, "16_4": 1267, "4_16": 1268, "29_5": 1269, "5_29": 1270, "45_35": 1271, "35_45": 1272, "24_18": 1273, "18_24": 1274, "4_25": 1275, "25_4": 1276, "51_51": 1277, "16_7": 1278, "7_16": 1279, "6_30": 1280, "15_46": 1281, "46_15": 1282, "15_30": 1283, "30_15": 1284, "4_10": 1285, "10_4": 1286, "40_31": 1287, "31_40": 1288, "44_5": 1289, "5_44": 1290, "8_45": 1291, "45_8": 1292, "2_4": 1293, "4_2": 1294, "20_32": 1295, "32_20": 1296, "2_25": 1297, "25_2": 1298, "5_49": 1299, "49_5": 1300, "32_36": 1301, "36_32": 1302, "18_43": 1303, "43_18": 1304, "44_22": 1305, "22_44": 1306, "37_37": 1307, "39_13": 1308, "13_39": 1309, "32_18": 1310, "18_32": 1311, "23_6": 1312, "6_23": 1313, "13_33": 1314, "33_13": 1315, "48_11": 1316, "11_48": 1317, "30_12": 1318, "12_30": 1319, "23_30": 1320, "30_23": 1321, "8_19": 1322, "19_8": 1323, "25_5": 1324, "5_25": 1325, "42_46": 1326, "46_42": 1327, "18_31": 1328, "31_18": 1329, "17_12": 1330, "12_17": 1331, "17_49": 1332, "49_17": 1333, "12_22": 1334, "22_12": 1335, "26_43": 1336, "43_26": 1337, "20_40": 1338, "40_20": 1339, "33_5": 1340, "5_33": 1341, "6_44": 1342, "44_6": 1343, "28_11": 1344, "11_28": 1345, "26_32": 1346, "32_26": 1347, "6_43": 1348, "43_6": 1349, "3_5": 1350, "5_3": 1351, "6_20": 1352, "2_22": 1353, "22_2": 1354, "49_47": 1355, "47_49": 1356, "4_22": 1357, "22_4": 1358, "26_26": 1359, "6_11": 1360, "11_6": 1361, "10_49": 1362, "49_10": 1363, "2_34": 1364, "34_2": 1365, "30_22": 1366, "22_30": 1367, "42_48": 1368, "48_42": 1369, "20_3": 1370, "3_20": 1371, "23_3": 1372, "3_23": 1373, "31_45": 1374, "45_31": 1375, "36_45": 1376, "19_31": 1377, "31_19": 1378, "48_23": 1379, "23_48": 1380, "48_9": 1381, "9_48": 1382, "26_15": 1383, "15_26": 1384, "5_5": 1385, "5_40": 1386, "40_5": 1387, "5_16": 1388, "16_5": 1389, "48_35": 1390, "35_48": 1391, "42_13": 1392, "13_42": 1393, "45_25": 1394, "25_45": 1395, "44_19": 1396, "19_44": 1397, "19_38": 1398, "38_19": 1399, "13_16": 1400, "16_13": 1401, "16_14": 1402, "14_16": 1403, "22_22": 1404, "15_38": 1405, "38_15": 1406, "33_14": 1407, "14_33": 1408, "45_40": 1409, "40_45": 1410, "42_45": 1411, "45_42": 1412, "36_12": 1413, "12_36": 1414, "4_50": 1415, "50_4": 1416, "14_34": 1417, "34_14": 1418, "44_16": 1419, "16_44": 1420, "2_19": 1421, "19_2": 1422, "9_11": 1423, "11_9": 1424, "35_23": 1425, "23_35": 1426, "28_14": 1427, "14_28": 1428, "42_10": 1429, "10_42": 1430, "31_47": 1431, "47_31": 1432, "20_44": 1433, "44_20": 1434, "39_28": 1435, "28_39": 1436, "2_43": 1437, "43_2": 1438, "34_21": 1439, "21_34": 1440, "26_29": 1441, "29_26": 1442, "13_50": 1443, "50_13": 1444, "35_2": 1445, "2_35": 1446, "33_47": 1447, "47_33": 1448, "22_35": 1449, "35_22": 1450, "24_29": 1451, "29_24": 1452, "44_40": 1453, "40_44": 1454, "24_45": 1455, "45_24": 1456, "45_13": 1457, "13_45": 1458, "45_20": 1459, "20_45": 1460, "45_28": 1461, "28_45": 1462, "32_45": 1463, "45_32": 1464, "45_16": 1465, "16_45": 1466, "28_47": 1467, "47_28": 1468, "46_41": 1469, "41_46": 1470, "34_7": 1471, "7_34": 1472, "19_6": 1473, "6_19": 1474, "6_47": 1475, "47_6": 1476, "6_10": 1477, "10_6": 1478, "6_18": 1479, "18_6": 1480, "47_10": 1481, "10_47": 1482, "27_40": 1483, "40_27": 1484, "13_8": 1485, "8_13": 1486, "26_31": 1487, "31_26": 1488, "26_2": 1489, "2_26": 1490, "23_22": 1491, "22_23": 1492, "40_39": 1493, "39_40": 1494, "2_31": 1495, "31_2": 1496, "26_11": 1497, "11_26": 1498, "24_47": 1499, "47_24": 1500, "3_10": 1501, "10_3": 1502, "26_40": 1503, "40_26": 1504, "36_11": 1505, "11_36": 1506, "23_32": 1507, "32_23": 1508, "36_10": 1509, "10_36": 1510, "30_47": 1511, "47_30": 1512, "7_18": 1513, "18_7": 1514, "47_45": 1515, "45_47": 1516, "10_45": 1517, "45_10": 1518, "22_40": 1519, "40_22": 1520, "26_45": 1521, "45_26": 1522, "31_46": 1523, "46_31": 1524, "46_28": 1525, "28_46": 1526, "19_45": 1527, "45_19": 1528, "11_12": 1529, "12_11": 1530, "8_2": 1531, "2_8": 1532, "2_40": 1533, "40_2": 1534, "31_22": 1535, "22_31": 1536, "44_45": 1537, "45_44": 1538, "18_40": 1539, "40_18": 1540, "3_45": 1541, "45_3": 1542, "47_20": 1543, "20_47": 1544, "31_10": 1545, "10_31": 1546, "47_23": 1547, "23_47": 1548, "11_22": 1549, "22_11": 1550, "13_38": 1551, "38_13": 1552, "6_2": 1553, "27_10": 1554, "10_27": 1555, "23_18": 1556, "18_23": 1557, "13_47": 1558, "47_13": 1559, "44_7": 1560, "7_44": 1561, "9_7": 1562, "7_9": 1563, "41_13": 1564, "41_26": 1565, "7_11": 1566, "11_7": 1567, "41_39": 1568, "39_41": 1569, "23_7": 1570, "7_23": 1571, "19_7": 1572, "7_19": 1573, "46_7": 1574, "7_46": 1575, "41_19": 1576, "19_41": 1577, "5_6": 1578, "6_5": 1579, "41_20": 1580, "26_7": 1581, "7_26": 1582, "27_11": 1583, "11_27": 1584, "2_11": 1585, "11_2": 1586, "26_47": 1587, "47_26": 1588, "13_18": 1589, "18_13": 1590, "46_46": 1591, "36_46": 1592, "46_36": 1593, "13_2": 1594, "2_13": 1595, "33_46": 1596, "46_33": 1597, "3_46": 1598, "46_3": 1599, "6_48": 1600, "48_6": 1601, "2_24": 1602, "24_2": 1603, "41_48": 1604, "48_41": 1605, "30_14": 1606, "14_30": 1607, "8_43": 1608, "43_8": 1609, "43_31": 1610, "31_43": 1611, "43_29": 1612, "29_43": 1613, "43_49": 1614, "49_43": 1615, "43_14": 1616, "14_43": 1617, "43_48": 1618, "48_43": 1619, "43_32": 1620, "32_43": 1621, "43_33": 1622, "33_43": 1623, "43_7": 1624, "7_43": 1625, "43_5": 1626, "5_43": 1627, "43_19": 1628, "19_43": 1629, "43_39": 1630, "39_43": 1631, "12_7": 1632, "7_12": 1633, "12_23": 1634, "23_12": 1635, "12_20": 1636, "20_12": 1637, "12_39": 1638, "39_12": 1639, "13_19": 1640, "19_13": 1641, "36_48": 1642, "48_36": 1643, "26_16": 1644, "16_26": 1645, "26_19": 1646, "19_26": 1647, "23_19": 1648, "19_23": 1649, "22_19": 1650, "19_22": 1651, "17_17": 1652, "24_17": 1653, "17_24": 1654, "17_9": 1655, "9_17": 1656, "17_27": 1657, "27_17": 1658, "17_32": 1659, "32_17": 1660, "17_28": 1661, "28_17": 1662, "17_36": 1663, "36_17": 1664, "33_32": 1665, "32_33": 1666, "3_17": 1667, "17_3": 1668, "17_2": 1669, "2_17": 1670, "17_23": 1671, "23_17": 1672, "44_17": 1673, "17_44": 1674, "17_30": 1675, "30_17": 1676, "17_19": 1677, "19_17": 1678, "14_17": 1679, "17_14": 1680, "17_22": 1681, "22_17": 1682, "17_8": 1683, "8_17": 1684, "15_18": 1685, "18_15": 1686, "23_50": 1687, "50_23": 1688, "39_15": 1689, "15_39": 1690, "2_50": 1691, "50_2": 1692, "15_2": 1693, "2_15": 1694, "15_3": 1695, "3_15": 1696, "49_15": 1697, "15_49": 1698, "15_8": 1699, "8_15": 1700, "15_44": 1701, "44_15": 1702, "50_27": 1703, "27_50": 1704, "50_46": 1705, "46_50": 1706, "50_44": 1707, "44_50": 1708, "39_33": 1709, "33_39": 1710, "28_50": 1711, "50_28": 1712, "50_37": 1713, "37_50": 1714, "15_20": 1715, "20_15": 1716, "37_24": 1717, "24_37": 1718, "37_36": 1719, "36_37": 1720, "37_27": 1721, "27_37": 1722, "37_23": 1723, "23_37": 1724, "16_23": 1725, "23_16": 1726, "37_19": 1727, "19_37": 1728, "23_45": 1729, "45_23": 1730, "23_2": 1731, "2_23": 1732, "37_8": 1733, "8_37": 1734, "19_21": 1735, "21_19": 1736, "28_21": 1737, "21_28": 1738, "36_21": 1739, "21_36": 1740, "49_21": 1741, "21_49": 1742, "33_21": 1743, "21_33": 1744, "27_21": 1745, "21_27": 1746, "21_24": 1747, "24_21": 1748, "21_3": 1749, "3_21": 1750, "21_18": 1751, "18_21": 1752, "30_21": 1753, "21_30": 1754, "21_48": 1755, "48_21": 1756, "21_29": 1757, "29_21": 1758, "21_44": 1759, "44_21": 1760, "21_13": 1761, "13_21": 1762, "51_17": 1763, "17_51": 1764, "3_16": 1765, "16_3": 1766, "26_50": 1767, "50_26": 1768, "50_8": 1769, "8_50": 1770, "51_40": 1771, "40_51": 1772, "51_5": 1773, "5_51": 1774, "25_9": 1775, "9_25": 1776, "50_6": 1777, "6_50": 1778, "50_38": 1779, "38_50": 1780, "50_40": 1781, "40_50": 1782, "50_16": 1783, "16_50": 1784, "50_31": 1785, "31_50": 1786, "50_12": 1787, "12_50": 1788, "10_22": 1789, "22_10": 1790, "50_48": 1791, "48_50": 1792, "24_7": 1793, "7_24": 1794, "51_12": 1795, "12_51": 1796, "50_19": 1797, "19_50": 1798, "50_45": 1799, "45_50": 1800, "50_30": 1801, "30_50": 1802, "50_18": 1803, "18_50": 1804, "50_32": 1805, "32_50": 1806, "50_42": 1807, "42_50": 1808, "50_47": 1809, "47_50": 1810, "46_34": 1811, "34_46": 1812, "46_27": 1813, "27_46": 1814, "46_38": 1815, "38_46": 1816, "46_19": 1817, "19_46": 1818, "50_22": 1819, "22_50": 1820, "50_10": 1821, "10_50": 1822, "51_16": 1823, "16_51": 1824, "40_46": 1825, "46_40": 1826, "40_19": 1827, "19_40": 1828, "51_36": 1829, "36_51": 1830, "23_5": 1831, "5_23": 1832, "22_14": 1833, "14_22": 1834, "23_43": 1835, "43_23": 1836, "13_5": 1837, "5_13": 1838, "20_5": 1839, "5_20": 1840, "14_5": 1841, "5_14": 1842, "2_5": 1843, "5_2": 1844, "42_5": 1845, "5_42": 1846, "24_5": 1847, "5_24": 1848, "39_25": 1849, "25_39": 1850, "23_25": 1851, "25_23": 1852, "51_18": 1853, "18_51": 1854, "18_17": 1855, "17_18": 1856, "51_22": 1857, "22_51": 1858, "50_11": 1859, "11_50": 1860, "14_27": 1861, "27_14": 1862, "39_36": 1863, "36_39": 1864, "39_10": 1865, "10_39": 1866, "29_2": 1867, "2_29": 1868, "22_39": 1869, "39_22": 1870, "13_46": 1871, "46_13": 1872, "39_9": 1873, "9_39": 1874, "2_14": 1875, "14_2": 1876, "43_42": 1877, "42_43": 1878, "14_29": 1879, "29_14": 1880, "39_30": 1881, "30_39": 1882, "34_25": 1883, "25_34": 1884, "49_25": 1885, "25_49": 1886, "2_12": 1887, "12_2": 1888, "39_24": 1889, "24_39": 1890, "23_39": 1891, "39_23": 1892, "39_31": 1893, "31_39": 1894, "39_16": 1895, "16_39": 1896, "39_26": 1897, "26_39": 1898, "39_21": 1899, "21_39": 1900, "9_10": 1901, "10_9": 1902, "47_16": 1903, "16_47": 1904, "14_32": 1905, "32_14": 1906, "14_26": 1907, "26_14": 1908, "14_12": 1909, "12_14": 1910, "18_39": 1911, "39_18": 1912, "2_10": 1913, "10_2": 1914, "13_32": 1915, "32_13": 1916, "35_17": 1917, "17_35": 1918, "26_10": 1919, "10_26": 1920, "19_47": 1921, "47_19": 1922, "30_43": 1923, "43_30": 1924, "22_43": 1925, "43_22": 1926, "23_40": 1927, "40_23": 1928, "24_10": 1929, "10_24": 1930, "4_21": 1931, "21_4": 1932, "47_18": 1933, "18_47": 1934, "14_41": 1935, "41_14": 1936, "37_25": 1937, "25_37": 1938, "20_50": 1939, "50_20": 1940, "0_0": 1941, "1_1": 1942}