{"PAD": 0, "DUMMY_START_RELATION": 1, "UNK": 2, "42_30": 3, "5_27": 4, "6_27": 5, "22_26": 6, "51_51": 7, "49_35": 8, "38_40": 9, "8_6": 10, "6_6": 11, "33_35": 12, "7_7": 13, "44_8": 14, "38_34": 15, "8_33": 16, "35_35": 17, "33_33": 18, "4_35": 19, "6_34": 20, "15_15": 21, "49_41": 22, "50_19": 23, "8_8": 24, "9_9": 25, "38_11": 26, "34_4": 27, "8_16": 28, "39_39": 29, "32_32": 30, "23_23": 31, "38_32": 32, "3_38": 33, "27_12": 34, "34_23": 35, "3_5": 36, "37_37": 37, "2_36": 38, "25_25": 39, "20_22": 40, "2_41": 41, "31_6": 42, "27_24": 43, "21_21": 44, "11_9": 45, "26_18": 46, "38_35": 47, "5_28": 48, "29_38": 49, "29_7": 50, "19_15": 51, "28_28": 52, "24_24": 53, "34_41": 54, "24_23": 55, "38_41": 56, "41_2": 57, "42_4": 58, "30_42": 59, "33_13": 60, "39_38": 61, "35_44": 62, "19_33": 63, "34_35": 64, "50_50": 65, "5_5": 66, "32_8": 67, "2_2": 68, "8_38": 69, "33_42": 70, "29_28": 71, "44_35": 72, "34_34": 73, "20_18": 74, "23_35": 75, "18_26": 76, "38_38": 77, "8_32": 78, "35_23": 79, "45_8": 80, "39_28": 81, "32_38": 82, "49_5": 83, "36_27": 84, "33_50": 85, "6_12": 86, "40_8": 87, "24_15": 88, "51_17": 89, "41_36": 90, "41_41": 91, "4_47": 92, "44_6": 93, "35_11": 94, "35_28": 95, "49_49": 96, "38_39": 97, "38_10": 98, "38_29": 99, "6_38": 100, "34_38": 101, "43_42": 102, "32_39": 103, "49_24": 104, "35_34": 105, "6_35": 106, "27_49": 107, "38_2": 108, "3_41": 109, "7_28": 110, "43_35": 111, "47_47": 112, "9_24": 113, "50_24": 114, "14_38": 115, "35_49": 116, "24_31": 117, "41_8": 118, "44_49": 119, "30_36": 120, "36_41": 121, "35_38": 122, "27_27": 123, "32_48": 124, "14_35": 125, "22_20": 126, "41_34": 127, "13_28": 128, "11_11": 129, "28_13": 130, "6_8": 131, "34_30": 132, "19_24": 133, "34_43": 134, "6_41": 135, "33_49": 136, "12_35": 137, "36_36": 138, "28_27": 139, "24_50": 140, "32_36": 141, "16_16": 142, "28_5": 143, "25_4": 144, "8_34": 145, "33_24": 146, "6_31": 147, "46_24": 148, "43_43": 149, "20_33": 150, "2_3": 151, "49_28": 152, "4_4": 153, "9_27": 154, "8_35": 155, "28_9": 156, "27_23": 157, "45_31": 158, "8_50": 159, "11_38": 160, "47_4": 161, "15_19": 162, "28_35": 163, "6_20": 164, "12_48": 165, "28_33": 166, "2_38": 167, "23_24": 168, "32_45": 169, "18_20": 170, "24_46": 171, "12_32": 172, "36_40": 173, "12_19": 174, "39_32": 175, "47_11": 176, "26_22": 177, "49_6": 178, "7_36": 179, "33_3": 180, "33_27": 181, "35_9": 182, "35_4": 183, "6_49": 184, "11_35": 185, "15_24": 186, "8_49": 187, "13_33": 188, "41_49": 189, "6_28": 190, "29_29": 191, "36_24": 192, "15_50": 193, "11_3": 194, "42_33": 195, "36_13": 196, "12_28": 197, "49_38": 198, "9_35": 199, "30_33": 200, "39_4": 201, "17_17": 202, "13_19": 203, "27_28": 204, "4_34": 205, "16_32": 206, "28_8": 207, "40_38": 208, "33_47": 209, "19_44": 210, "34_8": 211, "19_50": 212, "29_35": 213, "38_44": 214, "2_24": 215, "50_6": 216, "49_7": 217, "4_6": 218, "8_44": 219, "49_29": 220, "38_4": 221, "3_49": 222, "9_38": 223, "17_24": 224, "3_36": 225, "34_6": 226, "27_5": 227, "23_13": 228, "34_39": 229, "6_9": 230, "23_19": 231, "38_45": 232, "3_33": 233, "38_47": 234, "24_19": 235, "38_3": 236, "16_8": 237, "50_33": 238, "36_9": 239, "4_8": 240, "45_45": 241, "4_30": 242, "41_24": 243, "36_34": 244, "38_49": 245, "28_34": 246, "43_27": 247, "4_32": 248, "27_33": 249, "35_43": 250, "6_36": 251, "9_36": 252, "35_30": 253, "35_14": 254, "35_8": 255, "40_40": 256, "27_34": 257, "33_15": 258, "36_47": 259, "24_27": 260, "17_30": 261, "5_3": 262, "40_9": 263, "42_36": 264, "38_9": 265, "9_15": 266, "28_49": 267, "32_16": 268, "34_32": 269, "44_33": 270, "41_11": 271, "29_11": 272, "3_2": 273, "35_2": 274, "42_19": 275, "41_28": 276, "27_45": 277, "49_12": 278, "38_8": 279, "23_42": 280, "41_38": 281, "35_6": 282, "36_35": 283, "10_10": 284, "4_41": 285, "34_49": 286, "27_43": 287, "30_31": 288, "42_41": 289, "48_32": 290, "32_40": 291, "44_38": 292, "36_2": 293, "28_44": 294, "35_47": 295, "6_33": 296, "3_3": 297, "34_15": 298, "11_45": 299, "27_6": 300, "31_38": 301, "41_9": 302, "23_33": 303, "28_6": 304, "48_48": 305, "47_35": 306, "22_36": 307, "24_30": 308, "50_15": 309, "40_34": 310, "33_11": 311, "24_49": 312, "36_6": 313, "40_32": 314, "8_12": 315, "30_34": 316, "30_30": 317, "31_45": 318, "28_30": 319, "25_32": 320, "19_36": 321, "8_39": 322, "27_4": 323, "49_31": 324, "32_29": 325, "40_3": 326, "38_6": 327, "29_2": 328, "43_34": 329, "31_42": 330, "36_33": 331, "6_4": 332, "29_32": 333, "4_38": 334, "24_44": 335, "9_22": 336, "35_31": 337, "29_41": 338, "32_12": 339, "27_19": 340, "45_38": 341, "50_27": 342, "30_35": 343, "29_39": 344, "33_28": 345, "33_19": 346, "45_5": 347, "42_45": 348, "27_17": 349, "41_3": 350, "20_26": 351, "32_34": 352, "8_11": 353, "19_23": 354, "40_6": 355, "5_49": 356, "27_29": 357, "13_27": 358, "47_29": 359, "39_8": 360, "27_9": 361, "35_12": 362, "23_36": 363, "48_34": 364, "20_38": 365, "7_46": 366, "42_35": 367, "24_33": 368, "49_32": 369, "33_36": 370, "4_2": 371, "45_23": 372, "29_5": 373, "49_16": 374, "49_34": 375, "35_33": 376, "32_25": 377, "42_8": 378, "34_28": 379, "28_36": 380, "3_30": 381, "2_40": 382, "6_40": 383, "43_30": 384, "34_24": 385, "13_5": 386, "47_10": 387, "36_18": 388, "35_29": 389, "3_40": 390, "24_9": 391, "40_35": 392, "49_8": 393, "28_24": 394, "4_28": 395, "42_42": 396, "41_4": 397, "43_28": 398, "41_44": 399, "19_4": 400, "49_14": 401, "29_45": 402, "32_6": 403, "7_20": 404, "47_42": 405, "12_27": 406, "12_9": 407, "29_16": 408, "35_36": 409, "23_16": 410, "34_9": 411, "24_37": 412, "29_10": 413, "38_16": 414, "9_23": 415, "12_3": 416, "45_22": 417, "12_13": 418, "7_38": 419, "27_35": 420, "41_27": 421, "32_30": 422, "22_45": 423, "3_27": 424, "43_6": 425, "29_43": 426, "32_9": 427, "9_49": 428, "19_3": 429, "15_34": 430, "31_35": 431, "40_12": 432, "30_5": 433, "36_49": 434, "42_6": 435, "50_9": 436, "13_36": 437, "45_49": 438, "36_31": 439, "16_36": 440, "6_50": 441, "6_3": 442, "49_3": 443, "50_36": 444, "26_34": 445, "19_38": 446, "40_2": 447, "8_4": 448, "50_46": 449, "30_13": 450, "35_27": 451, "6_39": 452, "12_6": 453, "44_34": 454, "47_45": 455, "45_27": 456, "38_36": 457, "27_36": 458, "40_49": 459, "32_5": 460, "18_18": 461, "33_31": 462, "38_12": 463, "11_47": 464, "44_44": 465, "31_31": 466, "38_31": 467, "9_44": 468, "14_49": 469, "34_11": 470, "41_19": 471, "29_49": 472, "19_13": 473, "27_31": 474, "8_45": 475, "36_23": 476, "28_38": 477, "45_6": 478, "8_40": 479, "27_18": 480, "46_50": 481, "27_47": 482, "48_28": 483, "48_12": 484, "24_42": 485, "27_38": 486, "13_13": 487, "44_27": 488, "14_23": 489, "30_9": 490, "39_6": 491, "9_33": 492, "31_27": 493, "36_17": 494, "25_16": 495, "38_27": 496, "12_8": 497, "23_29": 498, "33_8": 499, "3_11": 500, "30_24": 501, "25_23": 502, "16_34": 503, "7_31": 504, "47_44": 505, "23_27": 506, "10_39": 507, "8_28": 508, "27_8": 509, "31_8": 510, "39_35": 511, "8_48": 512, "34_27": 513, "12_44": 514, "49_47": 515, "32_35": 516, "34_44": 517, "31_3": 518, "25_27": 519, "33_38": 520, "38_28": 521, "9_34": 522, "8_43": 523, "18_49": 524, "24_3": 525, "9_17": 526, "24_36": 527, "33_9": 528, "6_32": 529, "41_7": 530, "9_30": 531, "3_45": 532, "33_6": 533, "3_24": 534, "13_23": 535, "31_34": 536, "35_32": 537, "13_42": 538, "28_42": 539, "29_14": 540, "23_6": 541, "5_30": 542, "20_7": 543, "33_44": 544, "2_25": 545, "44_28": 546, "5_51": 547, "33_30": 548, "31_7": 549, "33_4": 550, "42_28": 551, "42_23": 552, "15_41": 553, "44_12": 554, "24_41": 555, "49_27": 556, "39_34": 557, "15_9": 558, "10_38": 559, "12_24": 560, "13_24": 561, "8_9": 562, "17_51": 563, "19_34": 564, "32_17": 565, "19_26": 566, "13_9": 567, "49_18": 568, "23_9": 569, "6_45": 570, "3_7": 571, "31_40": 572, "24_6": 573, "34_48": 574, "10_8": 575, "20_27": 576, "11_29": 577, "4_9": 578, "35_24": 579, "26_33": 580, "2_34": 581, "45_47": 582, "29_40": 583, "4_27": 584, "36_28": 585, "2_4": 586, "36_44": 587, "2_14": 588, "21_16": 589, "40_29": 590, "8_42": 591, "36_45": 592, "36_3": 593, "9_8": 594, "28_19": 595, "3_19": 596, "30_23": 597, "47_38": 598, "34_7": 599, "49_39": 600, "49_33": 601, "28_31": 602, "29_26": 603, "25_2": 604, "49_30": 605, "9_18": 606, "36_5": 607, "3_43": 608, "31_19": 609, "31_9": 610, "6_24": 611, "35_40": 612, "20_41": 613, "29_8": 614, "26_49": 615, "28_46": 616, "19_19": 617, "27_41": 618, "15_6": 619, "42_10": 620, "35_42": 621, "9_6": 622, "9_21": 623, "8_23": 624, "7_3": 625, "21_28": 626, "41_31": 627, "19_27": 628, "41_29": 629, "28_4": 630, "47_8": 631, "26_26": 632, "31_30": 633, "50_38": 634, "36_8": 635, "33_18": 636, "49_19": 637, "31_33": 638, "5_29": 639, "4_7": 640, "43_8": 641, "47_3": 642, "24_38": 643, "44_42": 644, "13_4": 645, "16_29": 646, "14_27": 647, "50_49": 648, "6_10": 649, "36_43": 650, "41_6": 651, "9_3": 652, "27_3": 653, "12_33": 654, "42_31": 655, "32_15": 656, "34_3": 657, "23_45": 658, "9_43": 659, "33_2": 660, "33_41": 661, "46_3": 662, "44_11": 663, "7_41": 664, "24_12": 665, "40_45": 666, "49_4": 667, "42_48": 668, "42_39": 669, "21_32": 670, "43_36": 671, "16_28": 672, "21_39": 673, "36_38": 674, "48_16": 675, "28_21": 676, "49_10": 677, "48_37": 678, "9_19": 679, "45_11": 680, "28_43": 681, "49_44": 682, "2_29": 683, "27_44": 684, "26_36": 685, "49_2": 686, "3_9": 687, "4_29": 688, "8_36": 689, "39_12": 690, "9_41": 691, "47_33": 692, "37_24": 693, "24_17": 694, "48_8": 695, "9_50": 696, "11_40": 697, "27_30": 698, "34_2": 699, "12_34": 700, "49_36": 701, "22_3": 702, "23_28": 703, "9_4": 704, "36_19": 705, "2_49": 706, "8_14": 707, "48_40": 708, "8_41": 709, "38_14": 710, "13_44": 711, "36_30": 712, "34_25": 713, "30_3": 714, "5_8": 715, "36_15": 716, "10_41": 717, "43_9": 718, "44_36": 719, "13_8": 720, "40_7": 721, "24_13": 722, "43_44": 723, "50_12": 724, "41_33": 725, "33_45": 726, "3_29": 727, "10_40": 728, "2_35": 729, "30_28": 730, "47_9": 731, "3_35": 732, "17_15": 733, "20_42": 734, "9_42": 735, "9_28": 736, "29_6": 737, "50_37": 738, "43_16": 739, "24_28": 740, "27_20": 741, "27_26": 742, "23_49": 743, "16_38": 744, "49_9": 745, "45_29": 746, "6_42": 747, "39_9": 748, "11_32": 749, "30_49": 750, "28_3": 751, "3_12": 752, "31_2": 753, "8_2": 754, "44_43": 755, "7_49": 756, "4_25": 757, "19_17": 758, "42_9": 759, "28_48": 760, "49_23": 761, "38_33": 762, "32_28": 763, "31_49": 764, "16_42": 765, "11_8": 766, "19_28": 767, "7_9": 768, "31_44": 769, "10_29": 770, "45_9": 771, "12_40": 772, "7_29": 773, "5_36": 774, "49_13": 775, "45_13": 776, "28_50": 777, "16_49": 778, "27_2": 779, "29_34": 780, "34_16": 781, "34_33": 782, "41_40": 783, "2_8": 784, "38_7": 785, "35_13": 786, "31_28": 787, "19_12": 788, "16_10": 789, "34_12": 790, "43_31": 791, "29_18": 792, "44_23": 793, "2_5": 794, "29_12": 795, "36_20": 796, "14_14": 797, "36_22": 798, "3_28": 799, "30_27": 800, "32_41": 801, "12_12": 802, "26_11": 803, "2_20": 804, "34_19": 805, "5_45": 806, "13_6": 807, "23_8": 808, "3_31": 809, "38_50": 810, "3_15": 811, "8_3": 812, "33_23": 813, "8_27": 814, "18_30": 815, "4_13": 816, "23_4": 817, "33_40": 818, "3_26": 819, "36_42": 820, "17_27": 821, "3_6": 822, "13_16": 823, "15_40": 824, "21_49": 825, "36_29": 826, "42_47": 827, "11_26": 828, "19_9": 829, "20_36": 830, "49_21": 831, "27_7": 832, "44_31": 833, "18_32": 834, "29_4": 835, "6_2": 836, "4_49": 837, "8_5": 838, "29_42": 839, "29_24": 840, "26_27": 841, "40_28": 842, "4_31": 843, "6_30": 844, "29_47": 845, "20_20": 846, "30_20": 847, "39_30": 848, "16_21": 849, "28_16": 850, "23_30": 851, "42_24": 852, "37_48": 853, "27_13": 854, "44_3": 855, "12_16": 856, "44_47": 857, "11_44": 858, "30_38": 859, "23_44": 860, "8_21": 861, "49_42": 862, "42_44": 863, "31_50": 864, "44_24": 865, "13_30": 866, "31_43": 867, "28_15": 868, "12_31": 869, "5_48": 870, "11_10": 871, "8_31": 872, "31_47": 873, "47_32": 874, "32_10": 875, "28_17": 876, "9_11": 877, "30_4": 878, "49_15": 879, "28_11": 880, "3_50": 881, "12_4": 882, "40_30": 883, "19_8": 884, "31_16": 885, "26_28": 886, "23_34": 887, "15_33": 888, "23_5": 889, "18_22": 890, "24_2": 891, "46_16": 892, "30_17": 893, "24_16": 894, "35_41": 895, "42_26": 896, "12_11": 897, "32_49": 898, "47_26": 899, "8_15": 900, "8_25": 901, "40_41": 902, "29_3": 903, "26_20": 904, "6_5": 905, "34_40": 906, "6_19": 907, "21_9": 908, "24_5": 909, "31_4": 910, "31_41": 911, "7_32": 912, "13_45": 913, "47_6": 914, "9_13": 915, "4_3": 916, "43_7": 917, "32_11": 918, "16_48": 919, "26_7": 920, "11_16": 921, "13_38": 922, "49_50": 923, "4_36": 924, "16_13": 925, "30_16": 926, "5_2": 927, "7_35": 928, "23_31": 929, "25_8": 930, "39_25": 931, "27_25": 932, "28_47": 933, "15_36": 934, "5_32": 935, "36_11": 936, "39_49": 937, "30_6": 938, "22_42": 939, "41_35": 940, "12_49": 941, "36_7": 942, "47_36": 943, "44_13": 944, "3_8": 945, "48_5": 946, "24_26": 947, "34_37": 948, "2_6": 949, "43_3": 950, "44_29": 951, "5_16": 952, "26_19": 953, "45_50": 954, "17_36": 955, "40_5": 956, "30_44": 957, "22_9": 958, "38_22": 959, "11_6": 960, "27_40": 961, "29_9": 962, "29_36": 963, "48_21": 964, "33_39": 965, "3_4": 966, "14_30": 967, "28_23": 968, "4_10": 969, "42_27": 970, "14_3": 971, "40_48": 972, "31_18": 973, "11_28": 974, "3_17": 975, "3_34": 976, "22_33": 977, "28_12": 978, "24_35": 979, "41_32": 980, "49_11": 981, "9_40": 982, "29_33": 983, "21_33": 984, "45_28": 985, "30_14": 986, "38_24": 987, "20_6": 988, "36_16": 989, "34_14": 990, "17_9": 991, "39_27": 992, "4_20": 993, "35_3": 994, "6_11": 995, "11_4": 996, "9_31": 997, "35_45": 998, "10_35": 999, "49_26": 1000, "44_50": 1001, "36_26": 1002, "13_18": 1003, "50_40": 1004, "35_39": 1005, "18_8": 1006, "32_50": 1007, "2_27": 1008, "2_9": 1009, "18_45": 1010, "31_36": 1011, "23_20": 1012, "23_14": 1013, "24_32": 1014, "50_34": 1015, "31_23": 1016, "4_42": 1017, "42_38": 1018, "24_47": 1019, "37_50": 1020, "29_27": 1021, "41_42": 1022, "49_43": 1023, "10_49": 1024, "28_22": 1025, "3_13": 1026, "4_39": 1027, "28_39": 1028, "24_8": 1029, "46_49": 1030, "31_24": 1031, "10_32": 1032, "27_50": 1033, "28_29": 1034, "45_40": 1035, "26_45": 1036, "2_7": 1037, "27_16": 1038, "9_45": 1039, "12_46": 1040, "33_22": 1041, "10_34": 1042, "40_33": 1043, "6_26": 1044, "35_22": 1045, "8_19": 1046, "14_6": 1047, "48_50": 1048, "42_3": 1049, "40_15": 1050, "5_34": 1051, "8_47": 1052, "8_24": 1053, "4_33": 1054, "3_20": 1055, "30_32": 1056, "47_23": 1057, "20_49": 1058, "41_26": 1059, "42_12": 1060, "41_22": 1061, "16_40": 1062, "31_20": 1063, "9_16": 1064, "21_8": 1065, "12_30": 1066, "19_21": 1067, "49_46": 1068, "19_31": 1069, "39_41": 1070, "8_18": 1071, "39_10": 1072, "21_36": 1073, "22_6": 1074, "50_28": 1075, "8_30": 1076, "27_39": 1077, "16_12": 1078, "32_7": 1079, "18_27": 1080, "38_13": 1081, "19_30": 1082, "40_4": 1083, "40_50": 1084, "44_9": 1085, "6_23": 1086, "47_31": 1087, "12_42": 1088, "6_13": 1089, "27_42": 1090, "30_8": 1091, "22_2": 1092, "12_38": 1093, "6_16": 1094, "18_42": 1095, "4_23": 1096, "41_10": 1097, "4_24": 1098, "33_12": 1099, "31_11": 1100, "41_20": 1101, "28_18": 1102, "47_28": 1103, "38_42": 1104, "38_43": 1105, "16_9": 1106, "15_17": 1107, "44_10": 1108, "4_44": 1109, "36_32": 1110, "34_36": 1111, "18_13": 1112, "22_27": 1113, "16_41": 1114, "16_35": 1115, "42_18": 1116, "2_42": 1117, "33_21": 1118, "31_29": 1119, "6_44": 1120, "10_11": 1121, "5_40": 1122, "21_13": 1123, "37_23": 1124, "4_40": 1125, "42_49": 1126, "6_18": 1127, "36_4": 1128, "34_47": 1129, "2_15": 1130, "45_35": 1131, "34_29": 1132, "18_33": 1133, "5_44": 1134, "39_40": 1135, "20_3": 1136, "27_32": 1137, "22_35": 1138, "26_8": 1139, "22_43": 1140, "46_33": 1141, "9_29": 1142, "2_33": 1143, "28_40": 1144, "51_22": 1145, "32_42": 1146, "18_28": 1147, "40_24": 1148, "22_49": 1149, "47_34": 1150, "34_5": 1151, "32_4": 1152, "42_34": 1153, "34_46": 1154, "19_37": 1155, "10_36": 1156, "23_38": 1157, "2_18": 1158, "22_8": 1159, "31_12": 1160, "47_49": 1161, "29_44": 1162, "9_48": 1163, "24_34": 1164, "48_4": 1165, "15_28": 1166, "2_28": 1167, "43_22": 1168, "18_48": 1169, "30_18": 1170, "24_4": 1171, "6_29": 1172, "47_40": 1173, "12_29": 1174, "28_25": 1175, "28_20": 1176, "47_41": 1177, "16_20": 1178, "31_14": 1179, "38_26": 1180, "13_49": 1181, "7_27": 1182, "14_36": 1183, "38_23": 1184, "34_42": 1185, "45_33": 1186, "33_26": 1187, "9_7": 1188, "36_50": 1189, "6_14": 1190, "18_31": 1191, "46_19": 1192, "3_47": 1193, "14_4": 1194, "40_11": 1195, "23_25": 1196, "17_33": 1197, "19_49": 1198, "7_16": 1199, "14_9": 1200, "26_13": 1201, "4_12": 1202, "22_50": 1203, "2_19": 1204, "28_41": 1205, "14_34": 1206, "44_41": 1207, "7_19": 1208, "10_16": 1209, "23_22": 1210, "5_13": 1211, "42_2": 1212, "26_38": 1213, "50_48": 1214, "51_36": 1215, "26_3": 1216, "34_31": 1217, "23_41": 1218, "16_43": 1219, "34_10": 1220, "18_9": 1221, "12_5": 1222, "3_42": 1223, "36_10": 1224, "2_30": 1225, "34_26": 1226, "13_41": 1227, "26_4": 1228, "14_5": 1229, "14_28": 1230, "13_3": 1231, "3_46": 1232, "2_13": 1233, "44_19": 1234, "35_18": 1235, "27_37": 1236, "23_7": 1237, "43_32": 1238, "20_28": 1239, "16_19": 1240, "28_2": 1241, "26_42": 1242, "43_18": 1243, "11_22": 1244, "35_10": 1245, "33_20": 1246, "15_23": 1247, "36_21": 1248, "41_46": 1249, "9_12": 1250, "3_22": 1251, "33_16": 1252, "49_40": 1253, "45_36": 1254, "4_19": 1255, "3_44": 1256, "19_46": 1257, "4_11": 1258, "22_18": 1259, "38_30": 1260, "42_13": 1261, "16_3": 1262, "35_16": 1263, "12_25": 1264, "4_45": 1265, "49_20": 1266, "11_12": 1267, "30_26": 1268, "28_32": 1269, "41_47": 1270, "40_10": 1271, "48_18": 1272, "26_32": 1273, "38_20": 1274, "10_45": 1275, "23_3": 1276, "6_15": 1277, "37_36": 1278, "9_2": 1279, "16_24": 1280, "22_30": 1281, "24_29": 1282, "34_21": 1283, "8_22": 1284, "50_30": 1285, "9_47": 1286, "23_2": 1287, "15_46": 1288, "5_25": 1289, "11_7": 1290, "42_32": 1291, "18_3": 1292, "13_35": 1293, "20_31": 1294, "38_48": 1295, "38_19": 1296, "44_18": 1297, "18_50": 1298, "48_39": 1299, "21_27": 1300, "32_43": 1301, "31_13": 1302, "15_3": 1303, "23_37": 1304, "49_22": 1305, "28_7": 1306, "41_23": 1307, "44_14": 1308, "16_7": 1309, "11_41": 1310, "20_23": 1311, "19_22": 1312, "18_19": 1313, "16_6": 1314, "20_9": 1315, "16_31": 1316, "16_33": 1317, "32_3": 1318, "43_29": 1319, "21_24": 1320, "30_39": 1321, "29_22": 1322, "20_24": 1323, "34_45": 1324, "2_44": 1325, "23_15": 1326, "39_42": 1327, "18_40": 1328, "22_41": 1329, "40_31": 1330, "10_9": 1331, "40_18": 1332, "44_5": 1333, "14_29": 1334, "25_28": 1335, "44_32": 1336, "14_31": 1337, "31_32": 1338, "47_24": 1339, "19_7": 1340, "11_49": 1341, "42_16": 1342, "29_21": 1343, "6_43": 1344, "42_20": 1345, "30_2": 1346, "3_21": 1347, "13_12": 1348, "18_44": 1349, "35_7": 1350, "17_2": 1351, "22_23": 1352, "47_27": 1353, "21_18": 1354, "40_39": 1355, "42_22": 1356, "6_22": 1357, "45_30": 1358, "23_50": 1359, "44_26": 1360, "9_26": 1361, "43_49": 1362, "12_20": 1363, "31_26": 1364, "7_44": 1365, "18_23": 1366, "40_14": 1367, "22_29": 1368, "10_6": 1369, "12_7": 1370, "7_2": 1371, "22_44": 1372, "38_21": 1373, "13_46": 1374, "26_6": 1375, "20_30": 1376, "33_29": 1377, "23_43": 1378, "22_13": 1379, "29_31": 1380, "24_43": 1381, "41_16": 1382, "41_30": 1383, "45_12": 1384, "15_20": 1385, "19_42": 1386, "42_43": 1387, "6_47": 1388, "24_45": 1389, "11_33": 1390, "42_5": 1391, "20_5": 1392, "9_20": 1393, "33_46": 1394, "22_28": 1395, "43_24": 1396, "11_34": 1397, "46_13": 1398, "7_4": 1399, "19_16": 1400, "41_15": 1401, "28_26": 1402, "45_10": 1403, "43_33": 1404, "50_39": 1405, "45_3": 1406, "14_43": 1407, "30_41": 1408, "30_15": 1409, "7_23": 1410, "50_31": 1411, "7_43": 1412, "8_26": 1413, "48_43": 1414, "24_20": 1415, "15_49": 1416, "47_39": 1417, "50_8": 1418, "8_29": 1419, "3_23": 1420, "18_41": 1421, "46_31": 1422, "3_10": 1423, "45_32": 1424, "20_11": 1425, "41_13": 1426, "14_33": 1427, "10_4": 1428, "14_32": 1429, "35_20": 1430, "10_47": 1431, "41_39": 1432, "36_46": 1433, "2_22": 1434, "13_15": 1435, "2_32": 1436, "19_2": 1437, "46_41": 1438, "48_25": 1439, "39_36": 1440, "32_47": 1441, "13_47": 1442, "22_38": 1443, "35_26": 1444, "38_46": 1445, "26_2": 1446, "42_29": 1447, "18_36": 1448, "40_13": 1449, "32_24": 1450, "22_22": 1451, "18_51": 1452, "12_36": 1453, "39_47": 1454, "39_33": 1455, "23_18": 1456, "26_29": 1457, "34_22": 1458, "38_15": 1459, "32_26": 1460, "11_27": 1461, "3_18": 1462, "18_35": 1463, "14_8": 1464, "16_30": 1465, "49_17": 1466, "18_43": 1467, "24_48": 1468, "26_23": 1469, "8_13": 1470, "26_41": 1471, "30_43": 1472, "29_20": 1473, "40_26": 1474, "21_34": 1475, "16_26": 1476, "40_25": 1477, "42_40": 1478, "41_18": 1479, "17_23": 1480, "23_17": 1481, "9_25": 1482, "24_40": 1483, "11_36": 1484, "26_9": 1485, "39_45": 1486, "50_3": 1487, "44_30": 1488, "22_40": 1489, "24_18": 1490, "7_47": 1491, "50_23": 1492, "27_11": 1493, "44_17": 1494, "32_21": 1495, "26_15": 1496, "21_30": 1497, "18_29": 1498, "4_14": 1499, "20_35": 1500, "43_48": 1501, "45_34": 1502, "37_27": 1503, "50_18": 1504, "16_27": 1505, "27_21": 1506, "23_26": 1507, "40_47": 1508, "40_16": 1509, "20_2": 1510, "13_31": 1511, "30_45": 1512, "18_38": 1513, "26_35": 1514, "2_43": 1515, "25_48": 1516, "33_43": 1517, "36_39": 1518, "21_38": 1519, "35_48": 1520, "46_46": 1521, "10_27": 1522, "17_28": 1523, "48_49": 1524, "20_43": 1525, "33_17": 1526, "37_34": 1527, "15_27": 1528, "17_3": 1529, "13_2": 1530, "28_14": 1531, "16_46": 1532, "21_4": 1533, "2_31": 1534, "26_24": 1535, "27_22": 1536, "39_21": 1537, "39_22": 1538, "50_44": 1539, "34_13": 1540, "13_26": 1541, "16_23": 1542, "39_48": 1543, "20_29": 1544, "48_35": 1545, "43_2": 1546, "44_4": 1547, "7_34": 1548, "40_27": 1549, "26_16": 1550, "23_12": 1551, "8_10": 1552, "32_23": 1553, "15_30": 1554, "22_14": 1555, "33_34": 1556, "19_6": 1557, "21_19": 1558, "30_40": 1559, "15_39": 1560, "25_5": 1561, "35_17": 1562, "5_12": 1563, "24_10": 1564, "26_47": 1565, "25_45": 1566, "9_32": 1567, "44_22": 1568, "39_3": 1569, "26_40": 1570, "30_19": 1571, "12_22": 1572, "4_48": 1573, "11_20": 1574, "50_10": 1575, "40_36": 1576, "5_24": 1577, "43_14": 1578, "11_31": 1579, "7_14": 1580, "35_19": 1581, "11_48": 1582, "40_42": 1583, "24_21": 1584, "22_16": 1585, "46_40": 1586, "15_13": 1587, "30_22": 1588, "34_50": 1589, "23_47": 1590, "44_40": 1591, "5_14": 1592, "12_2": 1593, "47_7": 1594, "8_37": 1595, "32_44": 1596, "16_5": 1597, "5_20": 1598, "46_28": 1599, "9_39": 1600, "21_48": 1601, "33_14": 1602, "48_38": 1603, "39_18": 1604, "10_2": 1605, "24_22": 1606, "21_3": 1607, "40_51": 1608, "13_40": 1609, "26_44": 1610, "3_16": 1611, "29_30": 1612, "18_6": 1613, "39_43": 1614, "47_18": 1615, "50_2": 1616, "25_49": 1617, "9_14": 1618, "16_44": 1619, "5_42": 1620, "18_24": 1621, "39_29": 1622, "30_12": 1623, "48_23": 1624, "3_25": 1625, "46_42": 1626, "26_31": 1627, "20_50": 1628, "47_50": 1629, "5_22": 1630, "23_40": 1631, "16_25": 1632, "49_45": 1633, "22_12": 1634, "41_12": 1635, "18_2": 1636, "27_15": 1637, "14_17": 1638, "20_4": 1639, "12_41": 1640, "22_34": 1641, "19_41": 1642, "4_26": 1643, "15_26": 1644, "3_32": 1645, "7_6": 1646, "14_22": 1647, "27_46": 1648, "38_18": 1649, "49_25": 1650, "2_10": 1651, "33_7": 1652, "40_20": 1653, "32_2": 1654, "11_2": 1655, "17_49": 1656, "50_22": 1657, "25_12": 1658, "14_26": 1659, "45_39": 1660, "46_7": 1661, "13_43": 1662, "45_16": 1663, "23_39": 1664, "7_11": 1665, "44_20": 1666, "22_39": 1667, "43_26": 1668, "12_50": 1669, "36_37": 1670, "48_9": 1671, "13_34": 1672, "26_30": 1673, "19_35": 1674, "48_22": 1675, "3_14": 1676, "43_13": 1677, "25_44": 1678, "16_50": 1679, "17_32": 1680, "45_25": 1681, "23_32": 1682, "3_39": 1683, "40_46": 1684, "22_5": 1685, "19_45": 1686, "40_22": 1687, "26_43": 1688, "22_11": 1689, "47_13": 1690, "4_18": 1691, "5_38": 1692, "7_33": 1693, "16_14": 1694, "36_12": 1695, "44_7": 1696, "30_29": 1697, "45_42": 1698, "10_26": 1699, "20_16": 1700, "27_10": 1701, "15_8": 1702, "22_51": 1703, "18_34": 1704, "36_14": 1705, "34_18": 1706, "32_31": 1707, "46_27": 1708, "6_7": 1709, "51_16": 1710, "13_22": 1711, "22_17": 1712, "4_16": 1713, "14_44": 1714, "6_48": 1715, "39_31": 1716, "14_2": 1717, "8_7": 1718, "47_30": 1719, "26_50": 1720, "44_16": 1721, "29_23": 1722, "38_5": 1723, "49_48": 1724, "32_20": 1725, "15_32": 1726, "42_46": 1727, "22_24": 1728, "45_44": 1729, "47_20": 1730, "43_23": 1731, "39_15": 1732, "33_5": 1733, "39_16": 1734, "2_48": 1735, "10_31": 1736, "48_2": 1737, "7_24": 1738, "37_25": 1739, "22_31": 1740, "43_20": 1741, "22_10": 1742, "22_4": 1743, "18_15": 1744, "33_32": 1745, "39_13": 1746, "2_23": 1747, "7_12": 1748, "4_50": 1749, "31_10": 1750, "25_18": 1751, "4_21": 1752, "10_22": 1753, "47_19": 1754, "51_12": 1755, "45_18": 1756, "25_39": 1757, "25_34": 1758, "45_24": 1759, "10_12": 1760, "7_18": 1761, "48_24": 1762, "13_32": 1763, "18_7": 1764, "48_27": 1765, "18_17": 1766, "5_23": 1767, "12_10": 1768, "16_22": 1769, "32_37": 1770, "37_8": 1771, "45_26": 1772, "24_7": 1773, "16_4": 1774, "18_4": 1775, "30_21": 1776, "23_48": 1777, "2_26": 1778, "20_45": 1779, "7_40": 1780, "12_15": 1781, "43_39": 1782, "39_23": 1783, "10_42": 1784, "16_51": 1785, "46_12": 1786, "18_16": 1787, "25_9": 1788, "36_51": 1789, "7_8": 1790, "37_12": 1791, "16_18": 1792, "2_17": 1793, "17_19": 1794, "30_47": 1795, "12_45": 1796, "26_10": 1797, "48_3": 1798, "39_26": 1799, "17_12": 1800, "15_38": 1801, "16_11": 1802, "17_44": 1803, "32_14": 1804, "28_45": 1805, "44_2": 1806, "50_4": 1807, "19_47": 1808, "13_39": 1809, "41_14": 1810, "15_12": 1811, "4_22": 1812, "12_51": 1813, "27_14": 1814, "48_11": 1815, "50_32": 1816, "17_18": 1817, "40_19": 1818, "14_40": 1819, "45_20": 1820, "39_24": 1821, "43_38": 1822, "26_14": 1823, "45_4": 1824, "47_16": 1825, "8_17": 1826, "3_48": 1827, "12_14": 1828, "46_15": 1829, "22_32": 1830, "12_37": 1831, "17_35": 1832, "20_40": 1833, "26_39": 1834, "43_19": 1835, "25_42": 1836, "19_18": 1837, "30_50": 1838, "48_6": 1839, "32_33": 1840, "14_12": 1841, "51_5": 1842, "50_16": 1843, "40_23": 1844, "14_16": 1845, "10_3": 1846, "43_5": 1847, "51_18": 1848, "25_40": 1849, "31_22": 1850, "17_8": 1851, "42_25": 1852, "44_15": 1853, "12_39": 1854, "20_12": 1855, "48_41": 1856, "45_19": 1857, "15_44": 1858, "2_50": 1859, "14_7": 1860, "16_45": 1861, "41_48": 1862, "22_19": 1863, "19_40": 1864, "17_14": 1865, "50_45": 1866, "10_50": 1867, "10_44": 1868, "25_37": 1869, "15_18": 1870, "39_50": 1871, "17_22": 1872, "33_10": 1873, "50_11": 1874, "12_23": 1875, "40_44": 1876, "2_12": 1877, "19_43": 1878, "27_48": 1879, "18_47": 1880, "11_50": 1881, "2_11": 1882, "21_44": 1883, "5_33": 1884, "31_39": 1885, "36_48": 1886, "39_44": 1887, "37_32": 1888, "37_19": 1889, "44_45": 1890, "50_26": 1891, "20_32": 1892, "20_47": 1893, "12_17": 1894, "46_36": 1895, "15_2": 1896, "29_48": 1897, "22_48": 1898, "18_25": 1899, "24_39": 1900, "10_24": 1901, "32_13": 1902, "13_50": 1903, "18_21": 1904, "31_46": 1905, "46_38": 1906, "46_34": 1907, "51_40": 1908, "32_27": 1909, "13_21": 1910, "10_33": 1911, "50_20": 1912, "32_18": 1913, "14_41": 1914, "16_39": 1915, "9_10": 1916, "16_47": 1917, "20_15": 1918, "50_47": 1919, "21_29": 1920, "44_39": 1921, "50_13": 1922, "5_6": 1923, "25_3": 1924, "44_25": 1925, "48_36": 1926, "48_42": 1927, "48_29": 1928, "7_30": 1929, "30_7": 1930, "44_21": 1931, "20_44": 1932, "32_22": 1933, "50_42": 1934, "18_39": 1935, "18_12": 1936, "12_18": 1937, "7_26": 1938, "5_43": 1939, "42_50": 1940, "0_0": 1941, "1_1": 1942}