{"PAD": 0, "DUMMY_START_RELATION": 1, "UNK": 2, "19_5": 3, "3_9": 4, "51_35": 5, "12_53": 6, "14_14": 7, "40_26": 8, "18_18": 9, "7_51": 10, "51_51": 11, "13_26": 12, "30_30": 13, "43_47": 14, "36_36": 15, "47_13": 16, "26_49": 17, "45_45": 18, "34_49": 19, "51_25": 20, "55_55": 21, "40_42": 22, "4_56": 23, "47_7": 24, "49_49": 25, "22_6": 26, "2_28": 27, "25_40": 28, "47_39": 29, "20_20": 30, "7_36": 31, "29_29": 32, "36_50": 33, "48_2": 34, "15_8": 35, "25_29": 36, "48_8": 37, "31_31": 38, "16_38": 39, "37_37": 40, "33_12": 41, "16_42": 42, "41_51": 43, "15_38": 44, "17_17": 45, "28_40": 46, "53_27": 47, "2_49": 48, "21_5": 49, "2_2": 50, "44_30": 51, "56_55": 52, "9_15": 53, "6_8": 54, "25_42": 55, "6_54": 56, "13_13": 57, "36_42": 58, "36_47": 59, "42_16": 60, "36_7": 61, "19_34": 62, "5_19": 63, "7_7": 64, "54_23": 65, "20_2": 66, "43_43": 67, "56_13": 68, "4_4": 69, "3_3": 70, "47_47": 71, "7_47": 72, "8_16": 73, "45_19": 74, "16_15": 75, "52_52": 76, "50_26": 77, "25_25": 78, "2_26": 79, "33_27": 80, "29_49": 81, "27_53": 82, "49_29": 83, "8_7": 84, "40_49": 85, "20_26": 86, "40_3": 87, "2_38": 88, "35_15": 89, "36_51": 90, "45_4": 91, "51_8": 92, "6_55": 93, "14_46": 94, "42_35": 95, "50_50": 96, "42_42": 97, "34_2": 98, "43_51": 99, "49_28": 100, "49_26": 101, "47_36": 102, "40_40": 103, "51_20": 104, "2_11": 105, "2_44": 106, "51_36": 107, "18_49": 108, "7_2": 109, "10_26": 110, "50_20": 111, "40_38": 112, "49_25": 113, "51_26": 114, "15_40": 115, "26_16": 116, "38_42": 117, "30_15": 118, "10_49": 119, "38_35": 120, "35_35": 121, "42_38": 122, "4_6": 123, "24_2": 124, "49_40": 125, "7_50": 126, "6_45": 127, "5_21": 128, "38_7": 129, "26_40": 130, "38_30": 131, "9_33": 132, "49_2": 133, "2_42": 134, "7_32": 135, "24_49": 136, "49_45": 137, "25_2": 138, "12_33": 139, "42_25": 140, "23_9": 141, "28_28": 142, "9_23": 143, "25_5": 144, "56_6": 145, "50_39": 146, "25_10": 147, "51_42": 148, "51_7": 149, "44_2": 150, "13_40": 151, "50_49": 152, "39_36": 153, "36_2": 154, "26_35": 155, "6_6": 156, "6_4": 157, "50_38": 158, "39_7": 159, "8_3": 160, "37_34": 161, "7_25": 162, "9_3": 163, "45_6": 164, "51_41": 165, "10_10": 166, "33_13": 167, "24_26": 168, "34_34": 169, "15_13": 170, "36_49": 171, "34_23": 172, "35_29": 173, "8_41": 174, "42_2": 175, "47_4": 176, "49_43": 177, "28_2": 178, "2_34": 179, "55_56": 180, "15_49": 181, "44_35": 182, "51_33": 183, "9_9": 184, "16_8": 185, "8_32": 186, "38_45": 187, "16_26": 188, "54_6": 189, "50_8": 190, "27_33": 191, "8_50": 192, "35_18": 193, "9_26": 194, "8_56": 195, "26_9": 196, "20_50": 197, "53_12": 198, "40_51": 199, "30_35": 200, "13_38": 201, "28_49": 202, "55_45": 203, "7_40": 204, "9_8": 205, "23_54": 206, "42_40": 207, "51_13": 208, "44_44": 209, "50_28": 210, "55_4": 211, "28_38": 212, "19_13": 213, "51_49": 214, "35_45": 215, "47_49": 216, "2_18": 217, "8_9": 218, "40_2": 219, "43_49": 220, "5_26": 221, "20_34": 222, "46_46": 223, "13_56": 224, "15_9": 225, "34_25": 226, "39_50": 227, "13_47": 228, "34_21": 229, "25_47": 230, "56_4": 231, "2_43": 232, "4_51": 233, "40_30": 234, "34_51": 235, "47_43": 236, "40_44": 237, "22_2": 238, "38_16": 239, "46_6": 240, "44_42": 241, "2_25": 242, "38_38": 243, "35_26": 244, "25_20": 245, "40_25": 246, "51_15": 247, "29_56": 248, "2_8": 249, "26_45": 250, "51_2": 251, "39_44": 252, "6_56": 253, "49_9": 254, "42_36": 255, "36_48": 256, "21_13": 257, "34_47": 258, "8_8": 259, "47_50": 260, "34_5": 261, "38_25": 262, "2_40": 263, "9_25": 264, "10_15": 265, "34_50": 266, "41_13": 267, "49_10": 268, "45_35": 269, "49_5": 270, "49_24": 271, "26_6": 272, "49_7": 273, "48_13": 274, "25_34": 275, "45_55": 276, "38_40": 277, "35_13": 278, "29_45": 279, "48_28": 280, "6_15": 281, "46_5": 282, "3_48": 283, "44_51": 284, "40_7": 285, "20_7": 286, "18_22": 287, "19_35": 288, "2_22": 289, "50_2": 290, "25_9": 291, "25_7": 292, "48_42": 293, "50_7": 294, "50_9": 295, "42_28": 296, "43_45": 297, "44_28": 298, "49_16": 299, "19_56": 300, "42_22": 301, "40_35": 302, "41_8": 303, "29_26": 304, "26_51": 305, "38_49": 306, "11_11": 307, "34_42": 308, "7_49": 309, "15_10": 310, "21_42": 311, "32_50": 312, "9_45": 313, "50_18": 314, "43_2": 315, "16_35": 316, "48_38": 317, "25_55": 318, "28_8": 319, "35_51": 320, "41_2": 321, "32_32": 322, "12_45": 323, "6_5": 324, "4_55": 325, "18_7": 326, "15_28": 327, "6_40": 328, "18_50": 329, "5_25": 330, "5_5": 331, "9_5": 332, "37_50": 333, "56_35": 334, "25_49": 335, "7_20": 336, "15_34": 337, "40_41": 338, "18_48": 339, "18_42": 340, "32_7": 341, "10_25": 342, "41_19": 343, "51_34": 344, "26_15": 345, "44_7": 346, "48_26": 347, "48_12": 348, "49_41": 349, "50_42": 350, "35_56": 351, "8_2": 352, "5_49": 353, "44_20": 354, "45_9": 355, "34_7": 356, "45_8": 357, "35_46": 358, "35_8": 359, "33_53": 360, "7_28": 361, "50_36": 362, "2_51": 363, "56_29": 364, "3_40": 365, "49_51": 366, "55_6": 367, "35_44": 368, "23_38": 369, "15_15": 370, "49_8": 371, "32_25": 372, "51_18": 373, "30_45": 374, "19_26": 375, "40_50": 376, "13_35": 377, "34_16": 378, "43_40": 379, "54_54": 380, "44_15": 381, "40_39": 382, "7_37": 383, "45_49": 384, "19_47": 385, "44_3": 386, "38_2": 387, "51_47": 388, "9_35": 389, "26_5": 390, "23_13": 391, "15_45": 392, "7_6": 393, "9_49": 394, "48_3": 395, "43_38": 396, "49_34": 397, "35_27": 398, "50_25": 399, "49_44": 400, "48_18": 401, "16_16": 402, "2_36": 403, "45_40": 404, "7_26": 405, "25_50": 406, "19_19": 407, "42_34": 408, "2_20": 409, "8_49": 410, "56_34": 411, "40_24": 412, "44_8": 413, "30_38": 414, "2_19": 415, "7_41": 416, "8_15": 417, "25_26": 418, "50_44": 419, "44_39": 420, "49_35": 421, "54_39": 422, "6_31": 423, "44_11": 424, "36_39": 425, "26_29": 426, "50_48": 427, "2_50": 428, "42_15": 429, "20_51": 430, "30_2": 431, "44_36": 432, "15_26": 433, "50_5": 434, "12_8": 435, "44_10": 436, "45_23": 437, "50_15": 438, "26_26": 439, "55_25": 440, "18_51": 441, "5_3": 442, "41_49": 443, "35_49": 444, "19_51": 445, "4_22": 446, "35_41": 447, "39_35": 448, "51_4": 449, "4_38": 450, "49_20": 451, "34_45": 452, "53_25": 453, "51_50": 454, "56_2": 455, "45_38": 456, "8_51": 457, "23_23": 458, "43_25": 459, "45_16": 460, "51_45": 461, "34_26": 462, "8_35": 463, "25_51": 464, "2_35": 465, "15_35": 466, "18_40": 467, "26_7": 468, "50_3": 469, "27_27": 470, "48_41": 471, "44_26": 472, "15_51": 473, "41_26": 474, "42_13": 475, "15_6": 476, "2_45": 477, "28_50": 478, "24_40": 479, "45_13": 480, "25_28": 481, "21_34": 482, "2_48": 483, "42_56": 484, "35_34": 485, "44_40": 486, "56_23": 487, "35_42": 488, "4_45": 489, "48_48": 490, "7_8": 491, "15_2": 492, "47_8": 493, "34_38": 494, "7_15": 495, "35_2": 496, "38_15": 497, "32_15": 498, "34_36": 499, "26_2": 500, "6_21": 501, "47_18": 502, "13_2": 503, "35_23": 504, "4_35": 505, "29_19": 506, "19_15": 507, "45_15": 508, "25_36": 509, "13_48": 510, "37_39": 511, "7_39": 512, "9_2": 513, "2_15": 514, "27_7": 515, "15_44": 516, "38_28": 517, "5_6": 518, "37_8": 519, "45_2": 520, "39_25": 521, "13_45": 522, "38_9": 523, "11_20": 524, "6_22": 525, "44_50": 526, "35_40": 527, "41_7": 528, "20_49": 529, "47_25": 530, "22_40": 531, "45_26": 532, "41_41": 533, "13_41": 534, "18_2": 535, "41_48": 536, "37_15": 537, "33_45": 538, "15_25": 539, "47_10": 540, "27_35": 541, "2_41": 542, "26_13": 543, "6_38": 544, "35_4": 545, "39_15": 546, "38_34": 547, "13_6": 548, "45_46": 549, "15_47": 550, "42_30": 551, "13_51": 552, "36_18": 553, "13_19": 554, "38_6": 555, "49_50": 556, "41_42": 557, "23_19": 558, "9_19": 559, "44_24": 560, "29_51": 561, "3_5": 562, "33_30": 563, "34_20": 564, "42_44": 565, "13_43": 566, "16_37": 567, "43_26": 568, "3_14": 569, "18_36": 570, "7_34": 571, "8_34": 572, "15_5": 573, "42_26": 574, "13_34": 575, "19_9": 576, "36_25": 577, "19_29": 578, "27_13": 579, "22_45": 580, "55_42": 581, "35_38": 582, "13_15": 583, "20_25": 584, "55_22": 585, "11_2": 586, "9_6": 587, "34_15": 588, "6_51": 589, "49_38": 590, "46_14": 591, "51_39": 592, "56_25": 593, "50_46": 594, "23_15": 595, "29_22": 596, "45_51": 597, "51_24": 598, "32_8": 599, "21_9": 600, "43_15": 601, "11_36": 602, "13_5": 603, "50_51": 604, "33_35": 605, "34_8": 606, "53_15": 607, "16_25": 608, "44_18": 609, "34_35": 610, "35_48": 611, "16_34": 612, "15_52": 613, "16_24": 614, "50_32": 615, "17_39": 616, "2_9": 617, "13_49": 618, "18_44": 619, "7_21": 620, "22_7": 621, "41_56": 622, "29_35": 623, "25_30": 624, "40_20": 625, "40_45": 626, "9_41": 627, "44_53": 628, "25_32": 629, "37_16": 630, "22_27": 631, "7_18": 632, "47_19": 633, "35_3": 634, "42_7": 635, "26_10": 636, "41_40": 637, "26_50": 638, "42_21": 639, "49_18": 640, "33_42": 641, "44_47": 642, "45_21": 643, "45_42": 644, "55_51": 645, "21_11": 646, "47_26": 647, "26_19": 648, "15_17": 649, "47_29": 650, "17_9": 651, "45_48": 652, "38_41": 653, "44_49": 654, "53_53": 655, "49_48": 656, "48_7": 657, "2_7": 658, "4_2": 659, "54_27": 660, "3_44": 661, "34_30": 662, "10_7": 663, "44_33": 664, "6_2": 665, "8_48": 666, "15_19": 667, "40_8": 668, "24_23": 669, "50_47": 670, "35_22": 671, "4_40": 672, "51_11": 673, "13_10": 674, "42_51": 675, "26_55": 676, "15_7": 677, "8_13": 678, "50_55": 679, "36_8": 680, "35_10": 681, "36_9": 682, "43_28": 683, "30_42": 684, "53_29": 685, "18_25": 686, "35_19": 687, "18_8": 688, "9_34": 689, "19_32": 690, "19_20": 691, "17_50": 692, "40_47": 693, "39_9": 694, "26_25": 695, "17_20": 696, "41_38": 697, "32_39": 698, "47_51": 699, "6_35": 700, "26_17": 701, "22_51": 702, "32_31": 703, "49_15": 704, "8_28": 705, "9_10": 706, "22_56": 707, "52_47": 708, "53_35": 709, "21_43": 710, "48_35": 711, "35_47": 712, "38_8": 713, "39_8": 714, "49_22": 715, "35_9": 716, "34_44": 717, "34_9": 718, "15_42": 719, "31_6": 720, "28_45": 721, "6_46": 722, "9_40": 723, "15_4": 724, "28_18": 725, "25_16": 726, "28_44": 727, "29_15": 728, "8_25": 729, "6_41": 730, "8_45": 731, "12_48": 732, "25_41": 733, "13_9": 734, "48_34": 735, "8_4": 736, "35_53": 737, "16_40": 738, "47_24": 739, "8_29": 740, "7_42": 741, "19_45": 742, "45_43": 743, "49_19": 744, "2_24": 745, "51_38": 746, "28_26": 747, "4_15": 748, "25_37": 749, "3_7": 750, "8_26": 751, "35_55": 752, "11_42": 753, "15_48": 754, "23_47": 755, "18_30": 756, "8_42": 757, "26_23": 758, "4_8": 759, "5_13": 760, "38_13": 761, "11_18": 762, "16_49": 763, "5_45": 764, "5_9": 765, "48_51": 766, "40_16": 767, "46_55": 768, "33_33": 769, "9_13": 770, "38_51": 771, "9_7": 772, "4_31": 773, "10_39": 774, "13_33": 775, "7_48": 776, "19_49": 777, "15_53": 778, "26_8": 779, "41_22": 780, "38_53": 781, "7_13": 782, "48_44": 783, "6_9": 784, "8_44": 785, "8_21": 786, "20_40": 787, "5_40": 788, "48_50": 789, "41_16": 790, "40_5": 791, "51_28": 792, "38_18": 793, "51_53": 794, "47_16": 795, "13_42": 796, "47_40": 797, "30_40": 798, "23_6": 799, "49_21": 800, "34_37": 801, "56_46": 802, "54_40": 803, "15_32": 804, "22_22": 805, "40_15": 806, "7_35": 807, "39_19": 808, "32_18": 809, "28_47": 810, "41_18": 811, "15_43": 812, "23_8": 813, "11_44": 814, "24_47": 815, "37_40": 816, "30_44": 817, "3_35": 818, "40_23": 819, "22_35": 820, "33_15": 821, "8_23": 822, "48_40": 823, "44_25": 824, "25_39": 825, "7_38": 826, "16_47": 827, "6_48": 828, "2_30": 829, "22_4": 830, "56_8": 831, "39_11": 832, "56_15": 833, "44_12": 834, "12_35": 835, "43_54": 836, "55_7": 837, "55_15": 838, "16_3": 839, "9_21": 840, "26_33": 841, "24_24": 842, "35_12": 843, "48_9": 844, "45_41": 845, "53_28": 846, "45_54": 847, "16_33": 848, "43_13": 849, "25_56": 850, "3_8": 851, "23_51": 852, "29_47": 853, "8_33": 854, "36_4": 855, "48_55": 856, "21_23": 857, "29_34": 858, "25_13": 859, "48_25": 860, "50_34": 861, "26_43": 862, "42_45": 863, "46_15": 864, "35_6": 865, "23_39": 866, "55_18": 867, "17_35": 868, "33_34": 869, "47_48": 870, "38_43": 871, "19_2": 872, "28_53": 873, "10_41": 874, "48_6": 875, "40_17": 876, "15_30": 877, "6_42": 878, "27_50": 879, "40_6": 880, "34_40": 881, "7_3": 882, "44_19": 883, "45_5": 884, "51_5": 885, "8_6": 886, "19_42": 887, "12_26": 888, "44_34": 889, "5_33": 890, "20_5": 891, "39_17": 892, "20_47": 893, "35_52": 894, "15_39": 895, "19_6": 896, "31_32": 897, "43_48": 898, "8_39": 899, "51_6": 900, "28_43": 901, "10_47": 902, "6_16": 903, "45_44": 904, "47_17": 905, "40_19": 906, "19_43": 907, "48_49": 908, "43_6": 909, "41_10": 910, "9_55": 911, "35_5": 912, "3_32": 913, "28_11": 914, "40_9": 915, "53_45": 916, "13_4": 917, "50_11": 918, "9_46": 919, "35_54": 920, "22_34": 921, "5_34": 922, "40_55": 923, "9_28": 924, "18_5": 925, "56_47": 926, "55_41": 927, "53_9": 928, "48_16": 929, "29_7": 930, "55_9": 931, "54_8": 932, "23_45": 933, "27_12": 934, "34_13": 935, "51_40": 936, "5_46": 937, "36_41": 938, "51_22": 939, "2_13": 940, "6_39": 941, "8_47": 942, "50_23": 943, "5_15": 944, "5_7": 945, "49_42": 946, "19_53": 947, "40_28": 948, "5_35": 949, "18_9": 950, "2_53": 951, "47_55": 952, "35_16": 953, "47_34": 954, "49_13": 955, "34_22": 956, "44_38": 957, "6_13": 958, "53_33": 959, "51_3": 960, "15_21": 961, "28_42": 962, "26_52": 963, "25_18": 964, "51_56": 965, "20_35": 966, "9_43": 967, "17_15": 968, "6_3": 969, "41_6": 970, "30_50": 971, "41_5": 972, "2_52": 973, "7_55": 974, "34_48": 975, "7_29": 976, "55_13": 977, "10_30": 978, "39_32": 979, "53_30": 980, "28_39": 981, "8_54": 982, "23_2": 983, "40_4": 984, "18_47": 985, "39_23": 986, "5_39": 987, "10_35": 988, "25_45": 989, "16_23": 990, "36_44": 991, "45_7": 992, "26_34": 993, "30_26": 994, "34_41": 995, "29_41": 996, "37_7": 997, "15_29": 998, "20_37": 999, "15_37": 1000, "5_38": 1001, "26_42": 1002, "36_32": 1003, "41_50": 1004, "3_50": 1005, "20_36": 1006, "5_51": 1007, "48_22": 1008, "12_19": 1009, "42_49": 1010, "13_55": 1011, "13_23": 1012, "26_4": 1013, "38_47": 1014, "32_3": 1015, "6_53": 1016, "25_31": 1017, "16_51": 1018, "10_48": 1019, "40_43": 1020, "43_44": 1021, "3_39": 1022, "56_26": 1023, "41_15": 1024, "46_35": 1025, "18_3": 1026, "5_53": 1027, "7_31": 1028, "26_44": 1029, "9_47": 1030, "2_12": 1031, "12_9": 1032, "7_9": 1033, "28_51": 1034, "9_4": 1035, "9_36": 1036, "54_26": 1037, "32_17": 1038, "13_20": 1039, "42_18": 1040, "35_25": 1041, "34_11": 1042, "24_48": 1043, "38_12": 1044, "18_32": 1045, "47_20": 1046, "22_55": 1047, "7_45": 1048, "41_27": 1049, "50_10": 1050, "28_9": 1051, "41_9": 1052, "48_46": 1053, "39_47": 1054, "6_50": 1055, "40_13": 1056, "12_13": 1057, "47_52": 1058, "56_7": 1059, "22_13": 1060, "6_49": 1061, "42_50": 1062, "40_36": 1063, "15_18": 1064, "4_9": 1065, "22_15": 1066, "44_13": 1067, "17_45": 1068, "40_34": 1069, "2_6": 1070, "39_39": 1071, "33_51": 1072, "44_45": 1073, "50_40": 1074, "35_39": 1075, "13_21": 1076, "25_24": 1077, "46_45": 1078, "34_33": 1079, "42_20": 1080, "28_34": 1081, "38_48": 1082, "26_38": 1083, "11_49": 1084, "8_53": 1085, "39_13": 1086, "22_8": 1087, "41_35": 1088, "6_26": 1089, "35_21": 1090, "29_23": 1091, "4_18": 1092, "53_38": 1093, "35_43": 1094, "33_44": 1095, "27_47": 1096, "13_22": 1097, "38_22": 1098, "50_4": 1099, "13_29": 1100, "27_8": 1101, "35_33": 1102, "20_44": 1103, "29_33": 1104, "13_25": 1105, "29_24": 1106, "19_8": 1107, "22_49": 1108, "4_25": 1109, "39_45": 1110, "55_35": 1111, "41_29": 1112, "35_36": 1113, "34_19": 1114, "31_4": 1115, "38_26": 1116, "7_10": 1117, "54_35": 1118, "42_19": 1119, "25_35": 1120, "13_53": 1121, "40_10": 1122, "26_41": 1123, "29_13": 1124, "11_40": 1125, "45_10": 1126, "15_41": 1127, "15_20": 1128, "6_36": 1129, "21_40": 1130, "51_16": 1131, "11_50": 1132, "56_45": 1133, "21_15": 1134, "24_51": 1135, "25_38": 1136, "6_34": 1137, "8_18": 1138, "16_30": 1139, "53_40": 1140, "13_12": 1141, "11_25": 1142, "18_13": 1143, "13_18": 1144, "7_4": 1145, "36_56": 1146, "42_41": 1147, "9_29": 1148, "18_28": 1149, "32_4": 1150, "45_27": 1151, "18_55": 1152, "21_51": 1153, "3_25": 1154, "51_9": 1155, "45_22": 1156, "47_2": 1157, "7_44": 1158, "2_39": 1159, "38_21": 1160, "9_53": 1161, "52_13": 1162, "8_12": 1163, "5_50": 1164, "13_52": 1165, "42_6": 1166, "29_53": 1167, "41_33": 1168, "17_36": 1169, "20_15": 1170, "9_38": 1171, "8_5": 1172, "56_17": 1173, "20_42": 1174, "4_13": 1175, "15_54": 1176, "20_11": 1177, "2_47": 1178, "12_51": 1179, "37_47": 1180, "7_5": 1181, "35_20": 1182, "8_38": 1183, "36_6": 1184, "52_15": 1185, "50_30": 1186, "18_4": 1187, "36_5": 1188, "29_16": 1189, "51_29": 1190, "8_19": 1191, "49_36": 1192, "43_41": 1193, "25_6": 1194, "51_23": 1195, "45_12": 1196, "22_18": 1197, "7_43": 1198, "54_13": 1199, "12_16": 1200, "9_42": 1201, "40_54": 1202, "42_8": 1203, "40_12": 1204, "42_11": 1205, "5_48": 1206, "41_28": 1207, "23_5": 1208, "18_38": 1209, "42_33": 1210, "26_27": 1211, "48_47": 1212, "23_35": 1213, "36_10": 1214, "49_47": 1215, "55_46": 1216, "26_11": 1217, "36_20": 1218, "26_47": 1219, "38_50": 1220, "25_8": 1221, "26_12": 1222, "26_48": 1223, "19_7": 1224, "9_51": 1225, "41_25": 1226, "39_42": 1227, "10_45": 1228, "39_49": 1229, "55_26": 1230, "35_30": 1231, "16_19": 1232, "50_41": 1233, "45_34": 1234, "45_17": 1235, "5_41": 1236, "41_44": 1237, "51_43": 1238, "11_28": 1239, "3_18": 1240, "17_23": 1241, "31_29": 1242, "38_23": 1243, "6_44": 1244, "24_29": 1245, "34_18": 1246, "19_40": 1247, "51_27": 1248, "16_48": 1249, "3_43": 1250, "20_18": 1251, "43_56": 1252, "11_7": 1253, "9_48": 1254, "35_50": 1255, "12_38": 1256, "56_41": 1257, "12_10": 1258, "3_23": 1259, "37_48": 1260, "9_18": 1261, "14_12": 1262, "27_19": 1263, "48_53": 1264, "7_19": 1265, "2_16": 1266, "30_49": 1267, "12_40": 1268, "28_25": 1269, "25_3": 1270, "19_25": 1271, "56_31": 1272, "43_22": 1273, "11_35": 1274, "7_24": 1275, "2_5": 1276, "48_10": 1277, "21_45": 1278, "7_17": 1279, "2_4": 1280, "7_56": 1281, "13_11": 1282, "32_34": 1283, "16_9": 1284, "47_35": 1285, "16_27": 1286, "42_47": 1287, "45_29": 1288, "10_12": 1289, "27_32": 1290, "48_5": 1291, "40_48": 1292, "5_27": 1293, "51_19": 1294, "51_44": 1295, "8_37": 1296, "53_51": 1297, "2_21": 1298, "56_36": 1299, "20_13": 1300, "56_43": 1301, "22_47": 1302, "26_24": 1303, "43_52": 1304, "23_34": 1305, "17_47": 1306, "41_24": 1307, "27_5": 1308, "6_47": 1309, "6_23": 1310, "24_8": 1311, "45_52": 1312, "51_21": 1313, "32_47": 1314, "45_30": 1315, "9_12": 1316, "38_27": 1317, "8_36": 1318, "23_29": 1319, "40_22": 1320, "27_41": 1321, "51_48": 1322, "45_56": 1323, "32_6": 1324, "48_45": 1325, "44_43": 1326, "24_34": 1327, "53_42": 1328, "35_37": 1329, "33_48": 1330, "46_13": 1331, "34_29": 1332, "30_39": 1333, "24_35": 1334, "38_19": 1335, "12_4": 1336, "41_54": 1337, "24_25": 1338, "40_18": 1339, "10_5": 1340, "36_17": 1341, "47_6": 1342, "22_41": 1343, "8_40": 1344, "40_32": 1345, "43_50": 1346, "21_21": 1347, "6_33": 1348, "47_32": 1349, "30_56": 1350, "10_36": 1351, "11_39": 1352, "53_8": 1353, "54_12": 1354, "5_52": 1355, "12_47": 1356, "53_2": 1357, "4_32": 1358, "5_36": 1359, "41_4": 1360, "14_35": 1361, "38_5": 1362, "36_21": 1363, "39_10": 1364, "25_11": 1365, "27_38": 1366, "39_3": 1367, "5_23": 1368, "35_11": 1369, "30_9": 1370, "32_36": 1371, "24_19": 1372, "16_5": 1373, "40_53": 1374, "53_34": 1375, "24_3": 1376, "13_28": 1377, "48_27": 1378, "28_35": 1379, "29_2": 1380, "29_9": 1381, "38_55": 1382, "8_46": 1383, "26_56": 1384, "49_27": 1385, "7_22": 1386, "15_31": 1387, "6_19": 1388, "26_39": 1389, "42_9": 1390, "5_24": 1391, "56_19": 1392, "21_35": 1393, "39_56": 1394, "53_5": 1395, "21_41": 1396, "56_56": 1397, "16_45": 1398, "53_19": 1399, "10_27": 1400, "40_27": 1401, "29_6": 1402, "28_12": 1403, "49_11": 1404, "39_40": 1405, "13_46": 1406, "16_2": 1407, "25_19": 1408, "22_44": 1409, "16_29": 1410, "15_12": 1411, "55_29": 1412, "35_17": 1413, "50_35": 1414, "10_9": 1415, "45_28": 1416, "21_38": 1417, "26_54": 1418, "36_26": 1419, "23_26": 1420, "38_44": 1421, "26_20": 1422, "38_39": 1423, "19_50": 1424, "21_49": 1425, "29_25": 1426, "34_56": 1427, "15_33": 1428, "19_16": 1429, "34_28": 1430, "18_15": 1431, "19_23": 1432, "29_43": 1433, "39_48": 1434, "49_39": 1435, "50_37": 1436, "53_26": 1437, "40_33": 1438, "36_34": 1439, "53_7": 1440, "15_50": 1441, "49_33": 1442, "52_45": 1443, "28_7": 1444, "18_11": 1445, "40_56": 1446, "41_36": 1447, "13_54": 1448, "7_53": 1449, "18_6": 1450, "7_27": 1451, "20_28": 1452, "17_43": 1453, "2_33": 1454, "11_8": 1455, "51_55": 1456, "15_22": 1457, "10_52": 1458, "34_43": 1459, "31_35": 1460, "41_43": 1461, "56_22": 1462, "39_6": 1463, "38_46": 1464, "12_5": 1465, "25_17": 1466, "39_38": 1467, "10_43": 1468, "17_40": 1469, "27_49": 1470, "48_29": 1471, "2_23": 1472, "41_47": 1473, "27_45": 1474, "43_42": 1475, "49_6": 1476, "43_19": 1477, "33_41": 1478, "27_22": 1479, "45_18": 1480, "48_15": 1481, "27_4": 1482, "32_20": 1483, "55_48": 1484, "29_31": 1485, "22_29": 1486, "43_24": 1487, "52_35": 1488, "19_27": 1489, "39_30": 1490, "33_54": 1491, "27_56": 1492, "39_51": 1493, "33_16": 1494, "54_2": 1495, "39_41": 1496, "10_38": 1497, "2_56": 1498, "23_3": 1499, "43_27": 1500, "50_53": 1501, "21_7": 1502, "54_15": 1503, "45_33": 1504, "16_6": 1505, "10_44": 1506, "15_55": 1507, "17_6": 1508, "5_20": 1509, "6_43": 1510, "12_15": 1511, "43_23": 1512, "6_25": 1513, "2_27": 1514, "56_40": 1515, "54_21": 1516, "33_6": 1517, "38_36": 1518, "46_8": 1519, "49_23": 1520, "40_21": 1521, "9_32": 1522, "8_55": 1523, "20_19": 1524, "27_18": 1525, "50_19": 1526, "33_39": 1527, "48_37": 1528, "23_40": 1529, "17_7": 1530, "21_19": 1531, "8_43": 1532, "36_38": 1533, "11_33": 1534, "18_27": 1535, "43_3": 1536, "53_44": 1537, "24_44": 1538, "13_27": 1539, "25_48": 1540, "53_41": 1541, "9_50": 1542, "52_43": 1543, "40_29": 1544, "9_30": 1545, "13_8": 1546, "56_30": 1547, "47_27": 1548, "23_22": 1549, "19_39": 1550, "25_15": 1551, "35_7": 1552, "44_17": 1553, "51_10": 1554, "52_50": 1555, "19_33": 1556, "5_47": 1557, "5_8": 1558, "9_37": 1559, "54_43": 1560, "27_15": 1561, "42_53": 1562, "8_22": 1563, "48_17": 1564, "21_24": 1565, "27_43": 1566, "49_30": 1567, "24_45": 1568, "27_9": 1569, "46_16": 1570, "12_54": 1571, "21_2": 1572, "26_30": 1573, "23_50": 1574, "17_27": 1575, "53_16": 1576, "18_20": 1577, "19_12": 1578, "33_29": 1579, "51_12": 1580, "19_21": 1581, "54_33": 1582, "26_28": 1583, "38_4": 1584, "45_47": 1585, "43_53": 1586, "4_26": 1587, "48_21": 1588, "10_40": 1589, "13_7": 1590, "44_9": 1591, "50_33": 1592, "26_36": 1593, "27_29": 1594, "18_24": 1595, "5_55": 1596, "12_44": 1597, "11_51": 1598, "54_34": 1599, "38_20": 1600, "21_26": 1601, "38_56": 1602, "30_16": 1603, "4_7": 1604, "44_48": 1605, "9_16": 1606, "33_5": 1607, "22_9": 1608, "13_44": 1609, "24_5": 1610, "9_44": 1611, "44_41": 1612, "47_22": 1613, "6_10": 1614, "42_39": 1615, "53_48": 1616, "54_51": 1617, "55_33": 1618, "27_48": 1619, "22_38": 1620, "26_18": 1621, "49_53": 1622, "33_3": 1623, "47_42": 1624, "52_23": 1625, "27_40": 1626, "43_35": 1627, "5_43": 1628, "47_28": 1629, "21_27": 1630, "30_34": 1631, "56_39": 1632, "22_21": 1633, "42_55": 1634, "53_13": 1635, "37_13": 1636, "43_7": 1637, "8_11": 1638, "18_34": 1639, "20_9": 1640, "4_20": 1641, "12_7": 1642, "3_26": 1643, "24_10": 1644, "41_55": 1645, "4_41": 1646, "30_10": 1647, "25_44": 1648, "15_3": 1649, "52_9": 1650, "5_2": 1651, "42_48": 1652, "21_6": 1653, "47_33": 1654, "32_10": 1655, "22_12": 1656, "47_5": 1657, "55_40": 1658, "19_48": 1659, "4_47": 1660, "19_18": 1661, "27_42": 1662, "10_51": 1663, "42_5": 1664, "12_50": 1665, "48_11": 1666, "54_41": 1667, "42_23": 1668, "24_13": 1669, "30_8": 1670, "13_30": 1671, "39_2": 1672, "17_13": 1673, "24_15": 1674, "32_29": 1675, "11_34": 1676, "24_7": 1677, "35_28": 1678, "18_26": 1679, "21_53": 1680, "38_54": 1681, "16_12": 1682, "34_55": 1683, "16_50": 1684, "9_20": 1685, "3_45": 1686, "33_26": 1687, "38_24": 1688, "56_48": 1689, "11_26": 1690, "32_37": 1691, "7_12": 1692, "47_9": 1693, "47_15": 1694, "12_2": 1695, "36_55": 1696, "5_42": 1697, "22_10": 1698, "21_50": 1699, "19_44": 1700, "41_34": 1701, "18_23": 1702, "48_19": 1703, "50_6": 1704, "12_12": 1705, "27_14": 1706, "36_28": 1707, "29_27": 1708, "34_6": 1709, "15_23": 1710, "36_15": 1711, "19_38": 1712, "53_50": 1713, "6_29": 1714, "48_36": 1715, "43_9": 1716, "25_12": 1717, "49_52": 1718, "24_50": 1719, "27_26": 1720, "15_27": 1721, "43_8": 1722, "28_48": 1723, "18_35": 1724, "5_30": 1725, "19_41": 1726, "50_21": 1727, "6_7": 1728, "21_25": 1729, "23_49": 1730, "39_5": 1731, "23_16": 1732, "40_46": 1733, "27_10": 1734, "6_32": 1735, "25_43": 1736, "7_23": 1737, "55_8": 1738, "26_46": 1739, "22_26": 1740, "43_10": 1741, "7_16": 1742, "21_39": 1743, "17_25": 1744, "39_53": 1745, "18_37": 1746, "52_5": 1747, "42_27": 1748, "46_29": 1749, "11_13": 1750, "16_13": 1751, "6_18": 1752, "41_53": 1753, "4_36": 1754, "53_22": 1755, "54_19": 1756, "20_8": 1757, "33_40": 1758, "47_38": 1759, "26_21": 1760, "22_28": 1761, "41_45": 1762, "12_18": 1763, "6_27": 1764, "33_19": 1765, "45_39": 1766, "25_23": 1767, "26_3": 1768, "10_6": 1769, "33_28": 1770, "27_36": 1771, "43_46": 1772, "50_17": 1773, "42_43": 1774, "9_54": 1775, "53_55": 1776, "17_5": 1777, "33_47": 1778, "26_37": 1779, "27_44": 1780, "34_24": 1781, "29_40": 1782, "24_21": 1783, "54_45": 1784, "10_32": 1785, "31_15": 1786, "4_27": 1787, "53_49": 1788, "53_23": 1789, "10_50": 1790, "28_36": 1791, "56_5": 1792, "45_3": 1793, "28_16": 1794, "56_38": 1795, "53_36": 1796, "27_2": 1797, "29_48": 1798, "37_32": 1799, "47_12": 1800, "15_16": 1801, "21_29": 1802, "49_32": 1803, "38_33": 1804, "45_53": 1805, "52_26": 1806, "45_25": 1807, "46_9": 1808, "32_40": 1809, "30_41": 1810, "15_46": 1811, "31_25": 1812, "9_27": 1813, "55_38": 1814, "16_41": 1815, "28_22": 1816, "26_53": 1817, "17_34": 1818, "53_6": 1819, "20_17": 1820, "47_37": 1821, "10_13": 1822, "39_26": 1823, "44_27": 1824, "20_12": 1825, "37_35": 1826, "53_21": 1827, "23_53": 1828, "39_29": 1829, "41_32": 1830, "19_11": 1831, "20_32": 1832, "32_49": 1833, "43_5": 1834, "32_27": 1835, "52_2": 1836, "37_9": 1837, "29_38": 1838, "5_29": 1839, "9_56": 1840, "18_39": 1841, "22_42": 1842, "53_39": 1843, "7_11": 1844, "12_27": 1845, "55_5": 1846, "36_40": 1847, "27_24": 1848, "56_51": 1849, "4_5": 1850, "17_56": 1851, "39_21": 1852, "5_18": 1853, "28_13": 1854, "37_3": 1855, "24_41": 1856, "23_21": 1857, "6_12": 1858, "2_55": 1859, "38_11": 1860, "43_55": 1861, "5_10": 1862, "50_12": 1863, "20_48": 1864, "21_33": 1865, "48_4": 1866, "34_32": 1867, "4_11": 1868, "13_16": 1869, "29_55": 1870, "10_24": 1871, "28_41": 1872, "41_39": 1873, "2_29": 1874, "50_43": 1875, "12_22": 1876, "30_24": 1877, "47_21": 1878, "54_5": 1879, "41_23": 1880, "37_26": 1881, "41_30": 1882, "23_52": 1883, "28_32": 1884, "15_56": 1885, "18_21": 1886, "6_17": 1887, "12_39": 1888, "29_4": 1889, "55_34": 1890, "5_12": 1891, "9_22": 1892, "25_4": 1893, "11_9": 1894, "3_24": 1895, "39_16": 1896, "42_54": 1897, "5_16": 1898, "5_54": 1899, "39_54": 1900, "32_9": 1901, "3_33": 1902, "17_32": 1903, "36_53": 1904, "45_24": 1905, "20_27": 1906, "11_16": 1907, "22_48": 1908, "17_48": 1909, "18_14": 1910, "41_21": 1911, "33_10": 1912, "8_20": 1913, "44_5": 1914, "36_35": 1915, "27_51": 1916, "20_38": 1917, "4_16": 1918, "30_48": 1919, "5_22": 1920, "35_24": 1921, "4_29": 1922, "39_43": 1923, "8_10": 1924, "25_21": 1925, "27_6": 1926, "11_47": 1927, "32_26": 1928, "7_30": 1929, "33_22": 1930, "36_13": 1931, "13_37": 1932, "4_53": 1933, "23_25": 1934, "37_36": 1935, "49_56": 1936, "33_4": 1937, "30_53": 1938, "22_19": 1939, "52_49": 1940, "53_54": 1941, "36_11": 1942, "3_12": 1943, "54_18": 1944, "22_33": 1945, "10_19": 1946, "18_10": 1947, "46_48": 1948, "26_22": 1949, "47_11": 1950, "33_9": 1951, "34_53": 1952, "54_42": 1953, "47_41": 1954, "30_7": 1955, "24_27": 1956, "9_17": 1957, "56_53": 1958, "36_54": 1959, "34_54": 1960, "29_8": 1961, "40_37": 1962, "12_23": 1963, "28_30": 1964, "13_36": 1965, "16_11": 1966, "12_29": 1967, "50_16": 1968, "26_32": 1969, "46_40": 1970, "53_43": 1971, "4_12": 1972, "55_23": 1973, "25_22": 1974, "16_46": 1975, "24_53": 1976, "33_2": 1977, "19_22": 1978, "29_20": 1979, "9_39": 1980, "38_29": 1981, "40_11": 1982, "56_42": 1983, "27_25": 1984, "43_11": 1985, "12_20": 1986, "10_53": 1987, "48_33": 1988, "35_31": 1989, "33_21": 1990, "44_16": 1991, "32_12": 1992, "28_20": 1993, "19_10": 1994, "39_4": 1995, "23_42": 1996, "46_50": 1997, "19_28": 1998, "48_20": 1999, "5_56": 2000, "27_21": 2001, "33_49": 2002, "18_45": 2003, "21_12": 2004, "22_17": 2005, "39_18": 2006, "12_3": 2007, "18_12": 2008, "53_10": 2009, "12_28": 2010, "12_21": 2011, "12_42": 2012, "22_23": 2013, "34_27": 2014, "30_13": 2015, "46_38": 2016, "49_12": 2017, "39_24": 2018, "12_25": 2019, "16_53": 2020, "5_44": 2021, "33_23": 2022, "44_6": 2023, "11_53": 2024, "29_54": 2025, "47_44": 2026, "50_24": 2027, "29_39": 2028, "12_14": 2029, "39_37": 2030, "3_36": 2031, "52_24": 2032, "23_27": 2033, "25_27": 2034, "3_15": 2035, "43_21": 2036, "15_36": 2037, "16_22": 2038, "51_30": 2039, "2_54": 2040, "14_39": 2041, "12_46": 2042, "29_10": 2043, "54_36": 2044, "37_29": 2045, "10_18": 2046, "23_12": 2047, "18_41": 2048, "13_17": 2049, "51_32": 2050, "23_55": 2051, "23_7": 2052, "34_39": 2053, "24_16": 2054, "49_54": 2055, "10_8": 2056, "20_41": 2057, "53_4": 2058, "43_39": 2059, "22_25": 2060, "29_3": 2061, "43_29": 2062, "28_15": 2063, "38_32": 2064, "55_50": 2065, "3_6": 2066, "48_39": 2067, "12_49": 2068, "12_6": 2069, "11_45": 2070, "56_9": 2071, "56_16": 2072, "21_54": 2073, "30_33": 2074, "36_3": 2075, "39_28": 2076, "13_24": 2077, "41_20": 2078, "8_30": 2079, "43_34": 2080, "13_3": 2081, "22_30": 2082, "20_39": 2083, "43_18": 2084, "52_10": 2085, "54_9": 2086, "10_22": 2087, "11_41": 2088, "32_38": 2089, "30_6": 2090, "31_37": 2091, "23_48": 2092, "12_41": 2093, "12_11": 2094, "16_44": 2095, "54_49": 2096, "31_7": 2097, "33_7": 2098, "12_34": 2099, "27_55": 2100, "9_52": 2101, "13_50": 2102, "12_52": 2103, "18_19": 2104, "22_39": 2105, "54_16": 2106, "8_24": 2107, "34_4": 2108, "41_11": 2109, "56_49": 2110, "29_5": 2111, "37_27": 2112, "32_13": 2113, "21_47": 2114, "34_17": 2115, "27_54": 2116, "18_33": 2117, "23_41": 2118, "11_12": 2119, "14_8": 2120, "8_27": 2121, "37_20": 2122, "30_22": 2123, "28_33": 2124, "37_25": 2125, "3_37": 2126, "39_33": 2127, "55_53": 2128, "30_27": 2129, "22_43": 2130, "46_22": 2131, "19_24": 2132, "44_22": 2133, "48_30": 2134, "47_23": 2135, "27_46": 2136, "3_29": 2137, "51_54": 2138, "11_48": 2139, "55_43": 2140, "39_12": 2141, "3_16": 2142, "29_21": 2143, "6_30": 2144, "22_5": 2145, "39_34": 2146, "27_34": 2147, "5_17": 2148, "24_38": 2149, "29_32": 2150, "15_24": 2151, "33_8": 2152, "30_18": 2153, "29_42": 2154, "22_53": 2155, "20_29": 2156, "11_21": 2157, "39_14": 2158, "27_39": 2159, "36_29": 2160, "35_14": 2161, "10_29": 2162, "31_50": 2163, "45_20": 2164, "16_7": 2165, "39_27": 2166, "46_56": 2167, "30_28": 2168, "52_6": 2169, "53_11": 2170, "29_46": 2171, "22_16": 2172, "19_54": 2173, "13_32": 2174, "20_53": 2175, "17_22": 2176, "55_47": 2177, "29_12": 2178, "55_2": 2179, "46_43": 2180, "25_53": 2181, "4_34": 2182, "11_19": 2183, "42_24": 2184, "16_4": 2185, "34_12": 2186, "38_10": 2187, "33_38": 2188, "46_26": 2189, "47_45": 2190, "48_43": 2191, "39_22": 2192, "8_14": 2193, "38_3": 2194, "32_28": 2195, "16_10": 2196, "4_50": 2197, "23_33": 2198, "20_45": 2199, "46_27": 2200, "18_56": 2201, "24_18": 2202, "29_37": 2203, "48_56": 2204, "20_6": 2205, "43_17": 2206, "7_54": 2207, "23_18": 2208, "30_25": 2209, "9_11": 2210, "50_13": 2211, "53_24": 2212, "4_48": 2213, "44_29": 2214, "47_46": 2215, "13_39": 2216, "53_52": 2217, "8_31": 2218, "7_33": 2219, "33_18": 2220, "53_20": 2221, "32_16": 2222, "37_19": 2223, "56_27": 2224, "5_4": 2225, "32_51": 2226, "32_41": 2227, "31_8": 2228, "36_19": 2229, "52_53": 2230, "14_3": 2231, "4_39": 2232, "29_36": 2233, "47_56": 2234, "18_54": 2235, "42_12": 2236, "19_36": 2237, "23_24": 2238, "14_27": 2239, "12_43": 2240, "37_18": 2241, "41_12": 2242, "21_36": 2243, "46_47": 2244, "19_37": 2245, "21_18": 2246, "48_23": 2247, "32_42": 2248, "30_5": 2249, "16_54": 2250, "55_36": 2251, "21_48": 2252, "24_30": 2253, "42_32": 2254, "56_18": 2255, "11_4": 2256, "48_24": 2257, "11_43": 2258, "10_33": 2259, "29_18": 2260, "37_31": 2261, "27_23": 2262, "50_22": 2263, "55_27": 2264, "23_20": 2265, "18_29": 2266, "20_4": 2267, "36_37": 2268, "50_56": 2269, "30_51": 2270, "46_12": 2271, "21_8": 2272, "4_28": 2273, "33_50": 2274, "42_29": 2275, "18_43": 2276, "16_39": 2277, "54_7": 2278, "28_4": 2279, "16_28": 2280, "54_29": 2281, "56_50": 2282, "29_44": 2283, "56_54": 2284, "54_44": 2285, "35_32": 2286, "28_19": 2287, "36_27": 2288, "50_52": 2289, "20_43": 2290, "31_56": 2291, "6_52": 2292, "24_43": 2293, "3_47": 2294, "23_43": 2295, "43_12": 2296, "54_38": 2297, "17_26": 2298, "53_56": 2299, "44_32": 2300, "12_32": 2301, "45_11": 2302, "16_56": 2303, "54_56": 2304, "27_37": 2305, "6_20": 2306, "11_38": 2307, "47_3": 2308, "27_17": 2309, "44_54": 2310, "14_18": 2311, "3_38": 2312, "16_32": 2313, "23_17": 2314, "4_33": 2315, "50_27": 2316, "22_46": 2317, "24_42": 2318, "52_12": 2319, "39_20": 2320, "33_11": 2321, "3_13": 2322, "33_55": 2323, "17_44": 2324, "36_30": 2325, "27_16": 2326, "43_20": 2327, "22_50": 2328, "43_33": 2329, "3_51": 2330, "21_22": 2331, "32_35": 2332, "32_19": 2333, "27_30": 2334, "32_44": 2335, "23_56": 2336, "20_23": 2337, "4_21": 2338, "27_20": 2339, "54_53": 2340, "50_31": 2341, "33_43": 2342, "24_39": 2343, "10_16": 2344, "24_52": 2345, "30_36": 2346, "21_4": 2347, "0_0": 2348, "1_1": 2349}