{"PAD": 0, "DUMMY_START_RELATION": 1, "UNK": 2, "284_158": 3, "181_158": 4, "12_158": 5, "439_158": 6, "247_158": 7, "303_158": 8, "169_158": 9, "78_158": 10, "174_158": 11, "110_158": 12, "13_158": 13, "337_158": 14, "232_158": 15, "228_158": 16, "486_158": 17, "376_158": 18, "77_158": 19, "61_158": 20, "122_158": 21, "301_158": 22, "273_158": 23, "484_158": 24, "325_158": 25, "483_158": 26, "13_10": 27, "145_158": 28, "50_158": 29, "259_158": 30, "116_158": 31, "314_158": 32, "143_158": 33, "197_287": 34, "239_158": 35, "460_158": 36, "60_158": 37, "370_158": 38, "276_158": 39, "76_158": 40, "104_158": 41, "3_158": 42, "5_158": 43, "287_158": 44, "4_158": 45, "133_158": 46, "239_10": 47, "180_158": 48, "114_158": 49, "137_158": 50, "360_158": 51, "170_158": 52, "278_158": 53, "223_158": 54, "74_158": 55, "289_158": 56, "40_158": 57, "102_158": 58, "193_158": 59, "467_158": 60, "63_158": 61, "334_158": 62, "396_158": 63, "406_158": 64, "421_158": 65, "371_158": 66, "501_158": 67, "332_158": 68, "198_158": 69, "220_158": 70, "212_158": 71, "157_158": 72, "105_158": 73, "173_158": 74, "158_158": 75, "80_158": 76, "462_158": 77, "162_158": 78, "153_16": 79, "16_153": 80, "477_499": 81, "499_477": 82, "311_332": 83, "332_311": 84, "404_404": 85, "264_139": 86, "139_264": 87, "380_441": 88, "441_380": 89, "455_455": 90, "496_208": 91, "208_496": 92, "496_236": 93, "236_496": 94, "498_278": 95, "278_498": 96, "368_441": 97, "441_368": 98, "498_171": 99, "171_498": 100, "395_17": 101, "17_395": 102, "309_16": 103, "16_309": 104, "309_309": 105, "425_82": 106, "82_425": 107, "425_387": 108, "387_425": 109, "80_243": 110, "243_80": 111, "405_441": 112, "441_405": 113, "225_479": 114, "479_225": 115, "225_499": 116, "499_225": 117, "225_448": 118, "448_225": 119, "105_104": 120, "104_105": 121, "483_483": 122, "444_444": 123, "444_463": 124, "463_444": 125, "224_441": 126, "441_224": 127, "27_11": 128, "11_27": 129, "384_99": 130, "99_384": 131, "376_93": 132, "93_376": 133, "376_240": 134, "240_376": 135, "376_284": 136, "284_376": 137, "8_376": 138, "376_8": 139, "167_139": 140, "139_167": 141, "156_81": 142, "81_156": 143, "22_139": 144, "139_22": 145, "446_188": 146, "188_446": 147, "405_330": 148, "330_405": 149, "217_171": 150, "171_217": 151, "419_139": 152, "139_419": 153, "419_16": 154, "16_419": 155, "97_183": 156, "183_97": 157, "395_252": 158, "252_395": 159, "5_171": 160, "171_5": 161, "236_139": 162, "139_236": 163, "236_275": 164, "275_236": 165, "97_338": 166, "338_97": 167, "373_352": 168, "352_373": 169, "373_318": 170, "318_373": 171, "373_81": 172, "81_373": 173, "5_66": 174, "66_5": 175, "198_29": 176, "29_198": 177, "390_147": 178, "147_390": 179, "180_171": 180, "171_180": 181, "57_98": 182, "98_57": 183, "156_156": 184, "499_499": 185, "499_81": 186, "81_499": 187, "380_17": 188, "17_380": 189, "27_330": 190, "330_27": 191, "8_441": 192, "441_8": 193, "446_11": 194, "11_446": 195, "215_42": 196, "42_215": 197, "233_390": 198, "390_233": 199, "233_147": 200, "147_233": 201, "189_499": 202, "499_189": 203, "238_238": 204, "238_426": 205, "426_238": 206, "210_210": 207, "438_371": 208, "371_438": 209, "185_447": 210, "447_185": 211, "353_34": 212, "34_353": 213, "380_171": 214, "171_380": 215, "15_139": 216, "139_15": 217, "446_39": 218, "39_446": 219, "8_278": 220, "278_8": 221, "165_139": 222, "139_165": 223, "165_499": 224, "499_165": 225, "165_165": 226, "479_327": 227, "327_479": 228, "479_186": 229, "186_479": 230, "198_79": 231, "79_198": 232, "76_60": 233, "60_76": 234, "405_296": 235, "296_405": 236, "321_183": 237, "183_321": 238, "272_34": 239, "34_272": 240, "287_119": 241, "119_287": 242, "287_365": 243, "365_287": 244, "368_296": 245, "296_368": 246, "484_238": 247, "238_484": 248, "384_499": 249, "499_384": 250, "307_186": 251, "186_307": 252, "307_34": 253, "34_307": 254, "307_6": 255, "6_307": 256, "307_442": 257, "442_307": 258, "307_305": 259, "305_307": 260, "298_99": 261, "99_298": 262, "213_69": 263, "69_213": 264, "213_64": 265, "64_213": 266, "215_312": 267, "312_215": 268, "265_265": 269, "265_410": 270, "410_265": 271, "265_444": 272, "444_265": 273, "180_39": 274, "39_180": 275, "484_376": 276, "376_484": 277, "241_79": 278, "79_241": 279, "241_221": 280, "221_241": 281, "405_278": 282, "278_405": 283, "217_66": 284, "66_217": 285, "446_317": 286, "317_446": 287, "203_203": 288, "203_455": 289, "455_203": 290, "421_376": 291, "376_421": 292, "337_179": 293, "179_337": 294, "99_139": 295, "139_99": 296, "99_99": 297, "99_499": 298, "499_99": 299, "68_39": 300, "39_68": 301, "460_460": 302, "380_371": 303, "371_380": 304, "224_330": 305, "330_224": 306, "484_112": 307, "112_484": 308, "498_104": 309, "104_498": 310, "185_289": 311, "289_185": 312, "189_417": 313, "417_189": 314, "189_99": 315, "99_189": 316, "189_248": 317, "248_189": 318, "189_165": 319, "165_189": 320, "363_363": 321, "363_300": 322, "300_363": 323, "363_404": 324, "404_363": 325, "363_120": 326, "120_363": 327, "120_139": 328, "139_120": 329, "120_499": 330, "499_120": 331, "298_122": 332, "122_298": 333, "376_172": 334, "172_376": 335, "376_65": 336, "65_376": 337, "444_466": 338, "466_444": 339, "444_352": 340, "352_444": 341, "444_233": 342, "233_444": 343, "444_334": 344, "334_444": 345, "183_16": 346, "16_183": 347, "301_93": 348, "93_301": 349, "301_4": 350, "4_301": 351, "380_39": 352, "39_380": 353, "49_7": 354, "7_49": 355, "336_244": 356, "244_336": 357, "336_336": 358, "499_277": 359, "277_499": 360, "332_252": 361, "252_332": 362, "207_334": 363, "334_207": 364, "300_139": 365, "139_300": 366, "498_66": 367, "66_498": 368, "125_339": 369, "339_125": 370, "405_4": 371, "4_405": 372, "388_207": 373, "207_388": 374, "100_139": 375, "139_100": 376, "180_259": 377, "259_180": 378, "27_171": 379, "171_27": 380, "79_79": 381, "101_290": 382, "290_101": 383, "427_16": 384, "16_427": 385, "470_248": 386, "248_470": 387, "35_499": 388, "499_35": 389, "272_6": 390, "6_272": 391, "212_212": 392, "447_314": 393, "314_447": 394, "416_499": 395, "499_416": 396, "416_236": 397, "236_416": 398, "209_16": 399, "16_209": 400, "45_210": 401, "210_45": 402, "350_350": 403, "320_166": 404, "166_320": 405, "320_241": 406, "241_320": 407, "497_293": 408, "293_497": 409, "497_447": 410, "447_497": 411, "497_149": 412, "149_497": 413, "497_352": 414, "352_497": 415, "497_69": 416, "69_497": 417, "389_289": 418, "289_389": 419, "27_66": 420, "66_27": 421, "407_139": 422, "139_407": 423, "407_417": 424, "417_407": 425, "152_434": 426, "434_152": 427, "152_423": 428, "423_152": 429, "152_226": 430, "226_152": 431, "152_81": 432, "81_152": 433, "152_183": 434, "183_152": 435, "170_317": 436, "317_170": 437, "399_489": 438, "489_399": 439, "105_11": 440, "11_105": 441, "97_16": 442, "16_97": 443, "97_483": 444, "483_97": 445, "8_17": 446, "17_8": 447, "92_92": 448, "92_107": 449, "107_92": 450, "38_305": 451, "305_38": 452, "304_16": 453, "16_304": 454, "444_347": 455, "347_444": 456, "295_42": 457, "42_295": 458, "295_409": 459, "409_295": 460, "295_325": 461, "325_295": 462, "446_482": 463, "482_446": 464, "123_23": 465, "23_123": 466, "224_421": 467, "421_224": 468, "261_16": 469, "16_261": 470, "293_293": 471, "368_114": 472, "114_368": 473, "5_482": 474, "482_5": 475, "487_487": 476, "44_165": 477, "165_44": 478, "94_23": 479, "23_94": 480, "376_347": 481, "347_376": 482, "88_242": 483, "242_88": 484, "352_352": 485, "176_66": 486, "66_176": 487, "129_207": 488, "207_129": 489, "129_283": 490, "283_129": 491, "203_352": 492, "352_203": 493, "203_318": 494, "318_203": 495, "165_248": 496, "248_165": 497, "148_7": 498, "7_148": 499, "47_99": 500, "99_47": 501, "73_421": 502, "421_73": 503, "73_222": 504, "222_73": 505, "73_260": 506, "260_73": 507, "73_271": 508, "271_73": 509, "73_73": 510, "73_293": 511, "293_73": 512, "73_352": 513, "352_73": 514, "73_23": 515, "23_73": 516, "73_497": 517, "497_73": 518, "170_441": 519, "441_170": 520, "479_60": 521, "60_479": 522, "479_479": 523, "215_48": 524, "48_215": 525, "215_406": 526, "406_215": 527, "215_289": 528, "289_215": 529, "293_352": 530, "352_293": 531, "293_81": 532, "81_293": 533, "203_175": 534, "175_203": 535, "173_216": 536, "216_173": 537, "105_17": 538, "17_105": 539, "224_171": 540, "171_224": 541, "224_11": 542, "11_224": 543, "174_330": 544, "330_174": 545, "57_57": 546, "95_139": 547, "139_95": 548, "475_372": 549, "372_475": 550, "234_165": 551, "165_234": 552, "301_322": 553, "322_301": 554, "407_466": 555, "466_407": 556, "407_248": 557, "248_407": 558, "120_417": 559, "417_120": 560, "186_183": 561, "183_186": 562, "186_266": 563, "266_186": 564, "186_444": 565, "444_186": 566, "438_252": 567, "252_438": 568, "198_252": 569, "252_198": 570, "462_341": 571, "341_462": 572, "450_466": 573, "466_450": 574, "368_317": 575, "317_368": 576, "217_39": 577, "39_217": 578, "120_81": 579, "81_120": 580, "120_156": 581, "156_120": 582, "120_239": 583, "239_120": 584, "120_277": 585, "277_120": 586, "467_329": 587, "329_467": 588, "395_171": 589, "171_395": 590, "315_42": 591, "42_315": 592, "2_320": 593, "320_2": 594, "128_128": 595, "350_6": 596, "6_350": 597, "495_489": 598, "489_495": 599, "337_482": 600, "482_337": 601, "290_290": 602, "346_23": 603, "23_346": 604, "346_354": 605, "354_346": 606, "346_121": 607, "121_346": 608, "346_346": 609, "346_147": 610, "147_346": 611, "78_78": 612, "270_139": 613, "139_270": 614, "270_99": 615, "99_270": 616, "444_366": 617, "366_444": 618, "277_82": 619, "82_277": 620, "495_495": 621, "185_325": 622, "325_185": 623, "499_248": 624, "248_499": 625, "221_284": 626, "284_221": 627, "320_463": 628, "463_320": 629, "20_7": 630, "7_20": 631, "477_165": 632, "165_477": 633, "498_330": 634, "330_498": 635, "458_11": 636, "11_458": 637, "174_174": 638, "221_221": 639, "8_39": 640, "39_8": 641, "212_207": 642, "207_212": 643, "479_265": 644, "265_479": 645, "479_385": 646, "385_479": 647, "479_375": 648, "375_479": 649, "405_259": 650, "259_405": 651, "74_85": 652, "85_74": 653, "475_289": 654, "289_475": 655, "475_33": 656, "33_475": 657, "475_345": 658, "345_475": 659, "217_441": 660, "441_217": 661, "76_308": 662, "308_76": 663, "405_371": 664, "371_405": 665, "446_371": 666, "371_446": 667, "151_231": 668, "231_151": 669, "151_34": 670, "34_151": 671, "151_499": 672, "499_151": 673, "332_17": 674, "17_332": 675, "62_275": 676, "275_62": 677, "62_62": 678, "62_499": 679, "499_62": 680, "62_448": 681, "448_62": 682, "471_137": 683, "137_471": 684, "106_241": 685, "241_106": 686, "115_115": 687, "438_441": 688, "441_438": 689, "27_441": 690, "441_27": 691, "368_11": 692, "11_368": 693, "69_149": 694, "149_69": 695, "470_165": 696, "165_470": 697, "265_42": 698, "42_265": 699, "425_207": 700, "207_425": 701, "425_455": 702, "455_425": 703, "425_336": 704, "336_425": 705, "425_495": 706, "495_425": 707, "425_126": 708, "126_425": 709, "336_489": 710, "489_336": 711, "336_89": 712, "89_336": 713, "336_58": 714, "58_336": 715, "460_376": 716, "376_460": 717, "403_165": 718, "165_403": 719, "403_248": 720, "248_403": 721, "403_394": 722, "394_403": 723, "80_376": 724, "376_80": 725, "93_460": 726, "460_93": 727, "463_139": 728, "139_463": 729, "497_497": 730, "497_203": 731, "203_497": 732, "497_199": 733, "199_497": 734, "497_466": 735, "466_497": 736, "497_81": 737, "81_497": 738, "120_443": 739, "443_120": 740, "120_483": 741, "483_120": 742, "462_250": 743, "250_462": 744, "22_99": 745, "99_22": 746, "405_29": 747, "29_405": 748, "368_188": 749, "188_368": 750, "297_7": 751, "7_297": 752, "499_16": 753, "16_499": 754, "466_203": 755, "203_466": 756, "466_99": 757, "99_466": 758, "466_366": 759, "366_466": 760, "466_120": 761, "120_466": 762, "466_44": 763, "44_466": 764, "466_447": 765, "447_466": 766, "466_62": 767, "62_466": 768, "466_165": 769, "165_466": 770, "466_454": 771, "454_466": 772, "466_466": 773, "466_364": 774, "364_466": 775, "466_207": 776, "207_466": 777, "466_455": 778, "455_466": 779, "466_139": 780, "139_466": 781, "466_69": 782, "69_466": 783, "337_289": 784, "289_337": 785, "215_179": 786, "179_215": 787, "332_171": 788, "171_332": 789, "337_48": 790, "48_337": 791, "337_406": 792, "406_337": 793, "96_96": 794, "96_460": 795, "460_96": 796, "172_248": 797, "248_172": 798, "172_305": 799, "305_172": 800, "271_271": 801, "221_3": 802, "3_221": 803, "446_252": 804, "252_446": 805, "301_302": 806, "302_301": 807, "68_371": 808, "371_68": 809, "77_287": 810, "287_77": 811, "428_220": 812, "220_428": 813, "264_455": 814, "455_264": 815, "264_64": 816, "64_264": 817, "310_207": 818, "207_310": 819, "225_447": 820, "447_225": 821, "262_499": 822, "499_262": 823, "105_278": 824, "278_105": 825, "356_39": 826, "39_356": 827, "183_139": 828, "139_183": 829, "122_122": 830, "426_426": 831, "56_463": 832, "463_56": 833, "56_56": 834, "407_499": 835, "499_407": 836, "399_194": 837, "194_399": 838, "319_139": 839, "139_319": 840, "319_499": 841, "499_319": 842, "319_64": 843, "64_319": 844, "319_319": 845, "319_466": 846, "466_319": 847, "319_354": 848, "354_319": 849, "319_99": 850, "99_319": 851, "319_183": 852, "183_319": 853, "293_318": 854, "318_293": 855, "177_499": 856, "499_177": 857, "301_410": 858, "410_301": 859, "183_183": 860, "198_17": 861, "17_198": 862, "197_11": 863, "11_197": 864, "98_191": 865, "191_98": 866, "98_98": 867, "420_16": 868, "16_420": 869, "473_473": 870, "271_139": 871, "139_271": 872, "236_236": 873, "295_232": 874, "232_295": 875, "295_162": 876, "162_295": 877, "149_139": 878, "139_149": 879, "149_16": 880, "16_149": 881, "172_129": 882, "129_172": 883, "396_398": 884, "398_396": 885, "114_265": 886, "265_114": 887, "130_290": 888, "290_130": 889, "8_252": 890, "252_8": 891, "407_86": 892, "86_407": 893, "407_23": 894, "23_407": 895, "407_203": 896, "203_407": 897, "407_354": 898, "354_407": 899, "407_334": 900, "334_407": 901, "407_444": 902, "444_407": 903, "407_97": 904, "97_407": 905, "311_364": 906, "364_311": 907, "220_419": 908, "419_220": 909, "368_171": 910, "171_368": 911, "364_139": 912, "139_364": 913, "364_499": 914, "499_364": 915, "266_201": 916, "201_266": 917, "356_188": 918, "188_356": 919, "76_23": 920, "23_76": 921, "368_482": 922, "482_368": 923, "315_48": 924, "48_315": 925, "250_416": 926, "416_250": 927, "250_175": 928, "175_250": 929, "250_443": 930, "443_250": 931, "250_145": 932, "145_250": 933, "458_104": 934, "104_458": 935, "438_39": 936, "39_438": 937, "84_18": 938, "18_84": 939, "187_466": 940, "466_187": 941, "187_119": 942, "119_187": 943, "404_156": 944, "156_404": 945, "498_11": 946, "11_498": 947, "298_375": 948, "375_298": 949, "259_60": 950, "60_259": 951, "405_317": 952, "317_405": 953, "38_186": 954, "186_38": 955, "38_34": 956, "34_38": 957, "38_119": 958, "119_38": 959, "38_6": 960, "6_38": 961, "38_442": 962, "442_38": 963, "38_354": 964, "354_38": 965, "38_25": 966, "25_38": 967, "38_282": 968, "282_38": 969, "38_280": 970, "280_38": 971, "38_7": 972, "7_38": 973, "38_493": 974, "493_38": 975, "38_468": 976, "468_38": 977, "460_86": 978, "86_460": 979, "356_371": 980, "371_356": 981, "307_119": 982, "119_307": 983, "93_60": 984, "60_93": 985, "93_174": 986, "174_93": 987, "145_145": 988, "317_161": 989, "161_317": 990, "332_11": 991, "11_332": 992, "174_20": 993, "20_174": 994, "498_39": 995, "39_498": 996, "445_57": 997, "57_445": 998, "445_98": 999, "98_445": 1000, "445_445": 1001, "445_391": 1002, "391_445": 1003, "295_48": 1004, "48_295": 1005, "295_312": 1006, "312_295": 1007, "368_330": 1008, "330_368": 1009, "240_363": 1010, "363_240": 1011, "240_120": 1012, "120_240": 1013, "374_374": 1014, "380_252": 1015, "252_380": 1016, "27_259": 1017, "259_27": 1018, "275_354": 1019, "354_275": 1020, "275_466": 1021, "466_275": 1022, "275_310": 1023, "310_275": 1024, "275_275": 1025, "213_354": 1026, "354_213": 1027, "392_305": 1028, "305_392": 1029, "479_190": 1030, "190_479": 1031, "170_330": 1032, "330_170": 1033, "185_179": 1034, "179_185": 1035, "428_162": 1036, "162_428": 1037, "332_9": 1038, "9_332": 1039, "332_73": 1040, "73_332": 1041, "438_66": 1042, "66_438": 1043, "220_351": 1044, "351_220": 1045, "200_139": 1046, "139_200": 1047, "200_200": 1048, "200_168": 1049, "168_200": 1050, "200_151": 1051, "151_200": 1052, "200_499": 1053, "499_200": 1054, "200_448": 1055, "448_200": 1056, "102_102": 1057, "22_466": 1058, "466_22": 1059, "56_16": 1060, "16_56": 1061, "314_60": 1062, "60_314": 1063, "160_337": 1064, "337_160": 1065, "172_463": 1066, "463_172": 1067, "172_306": 1068, "306_172": 1069, "100_499": 1070, "499_100": 1071, "76_76": 1072, "9_199": 1073, "199_9": 1074, "34_34": 1075, "18_221": 1076, "221_18": 1077, "18_119": 1078, "119_18": 1079, "217_17": 1080, "17_217": 1081, "466_499": 1082, "499_466": 1083, "479_97": 1084, "97_479": 1085, "44_499": 1086, "499_44": 1087, "466_293": 1088, "293_466": 1089, "466_352": 1090, "352_466": 1091, "282_354": 1092, "354_282": 1093, "224_259": 1094, "259_224": 1095, "45_275": 1096, "275_45": 1097, "317_287": 1098, "287_317": 1099, "306_306": 1100, "18_34": 1101, "34_18": 1102, "18_354": 1103, "354_18": 1104, "18_282": 1105, "282_18": 1106, "501_119": 1107, "119_501": 1108, "18_6": 1109, "6_18": 1110, "18_71": 1111, "71_18": 1112, "295_239": 1113, "239_295": 1114, "295_449": 1115, "449_295": 1116, "295_179": 1117, "179_295": 1118, "271_213": 1119, "213_271": 1120, "271_187": 1121, "187_271": 1122, "271_466": 1123, "466_271": 1124, "271_100": 1125, "100_271": 1126, "271_447": 1127, "447_271": 1128, "271_99": 1129, "99_271": 1130, "271_407": 1131, "407_271": 1132, "271_203": 1133, "203_271": 1134, "271_225": 1135, "225_271": 1136, "271_375": 1137, "375_271": 1138, "271_366": 1139, "366_271": 1140, "271_374": 1141, "374_271": 1142, "271_270": 1143, "270_271": 1144, "271_167": 1145, "167_271": 1146, "271_455": 1147, "455_271": 1148, "271_186": 1149, "186_271": 1150, "271_34": 1151, "34_271": 1152, "271_212": 1153, "212_271": 1154, "271_119": 1155, "119_271": 1156, "271_6": 1157, "6_271": 1158, "271_442": 1159, "442_271": 1160, "271_444": 1161, "444_271": 1162, "271_16": 1163, "16_271": 1164, "271_280": 1165, "280_271": 1166, "271_7": 1167, "7_271": 1168, "271_499": 1169, "499_271": 1170, "271_149": 1171, "149_271": 1172, "271_293": 1173, "293_271": 1174, "271_260": 1175, "260_271": 1176, "483_442": 1177, "442_483": 1178, "483_266": 1179, "266_483": 1180, "483_376": 1181, "376_483": 1182, "483_479": 1183, "479_483": 1184, "209_275": 1185, "275_209": 1186, "259_239": 1187, "239_259": 1188, "110_301": 1189, "301_110": 1190, "110_103": 1191, "103_110": 1192, "344_183": 1193, "183_344": 1194, "344_344": 1195, "234_248": 1196, "248_234": 1197, "426_16": 1198, "16_426": 1199, "282_34": 1200, "34_282": 1201, "282_212": 1202, "212_282": 1203, "282_305": 1204, "305_282": 1205, "282_282": 1206, "282_221": 1207, "221_282": 1208, "181_60": 1209, "60_181": 1210, "60_64": 1211, "64_60": 1212, "432_57": 1213, "57_432": 1214, "432_432": 1215, "148_305": 1216, "305_148": 1217, "224_66": 1218, "66_224": 1219, "237_237": 1220, "237_137": 1221, "137_237": 1222, "97_97": 1223, "97_186": 1224, "186_97": 1225, "98_404": 1226, "404_98": 1227, "170_39": 1228, "39_170": 1229, "85_85": 1230, "85_469": 1231, "469_85": 1232, "85_175": 1233, "175_85": 1234, "85_207": 1235, "207_85": 1236, "85_443": 1237, "443_85": 1238, "85_145": 1239, "145_85": 1240, "395_29": 1241, "29_395": 1242, "77_50": 1243, "50_77": 1244, "374_165": 1245, "165_374": 1246, "374_149": 1247, "149_374": 1248, "374_499": 1249, "499_374": 1250, "374_86": 1251, "86_374": 1252, "374_364": 1253, "364_374": 1254, "407_407": 1255, "407_455": 1256, "455_407": 1257, "79_221": 1258, "221_79": 1259, "212_64": 1260, "64_212": 1261, "198_371": 1262, "371_198": 1263, "446_441": 1264, "441_446": 1265, "351_16": 1266, "16_351": 1267, "351_351": 1268, "172_7": 1269, "7_172": 1270, "172_114": 1271, "114_172": 1272, "407_232": 1273, "232_407": 1274, "407_166": 1275, "166_407": 1276, "170_252": 1277, "252_170": 1278, "478_82": 1279, "82_478": 1280, "180_482": 1281, "482_180": 1282, "275_148": 1283, "148_275": 1284, "275_16": 1285, "16_275": 1286, "275_290": 1287, "290_275": 1288, "176_278": 1289, "278_176": 1290, "446_278": 1291, "278_446": 1292, "27_29": 1293, "29_27": 1294, "121_354": 1295, "354_121": 1296, "347_23": 1297, "23_347": 1298, "347_347": 1299, "373_175": 1300, "175_373": 1301, "405_110": 1302, "110_405": 1303, "217_482": 1304, "482_217": 1305, "301_484": 1306, "484_301": 1307, "389_48": 1308, "48_389": 1309, "389_239": 1310, "239_389": 1311, "389_179": 1312, "179_389": 1313, "389_409": 1314, "409_389": 1315, "174_66": 1316, "66_174": 1317, "105_171": 1318, "171_105": 1319, "153_320": 1320, "320_153": 1321, "417_417": 1322, "446_66": 1323, "66_446": 1324, "174_39": 1325, "39_174": 1326, "444_455": 1327, "455_444": 1328, "21_250": 1329, "250_21": 1330, "172_172": 1331, "224_296": 1332, "296_224": 1333, "241_460": 1334, "460_241": 1335, "176_330": 1336, "330_176": 1337, "237_493": 1338, "493_237": 1339, "315_312": 1340, "312_315": 1341, "388_175": 1342, "175_388": 1343, "388_407": 1344, "407_388": 1345, "329_340": 1346, "340_329": 1347, "329_394": 1348, "394_329": 1349, "76_136": 1350, "136_76": 1351, "444_207": 1352, "207_444": 1353, "198_39": 1354, "39_198": 1355, "164_299": 1356, "299_164": 1357, "366_248": 1358, "248_366": 1359, "390_42": 1360, "42_390": 1361, "141_343": 1362, "343_141": 1363, "443_444": 1364, "444_443": 1365, "293_455": 1366, "455_293": 1367, "293_207": 1368, "207_293": 1369, "293_444": 1370, "444_293": 1371, "165_447": 1372, "447_165": 1373, "272_119": 1374, "119_272": 1375, "170_278": 1376, "278_170": 1377, "444_23": 1378, "23_444": 1379, "2_325": 1380, "325_2": 1381, "2_174": 1382, "174_2": 1383, "326_326": 1384, "375_375": 1385, "395_104": 1386, "104_395": 1387, "88_96": 1388, "96_88": 1389, "271_172": 1390, "172_271": 1391, "466_175": 1392, "175_466": 1393, "395_296": 1394, "296_395": 1395, "234_99": 1396, "99_234": 1397, "438_278": 1398, "278_438": 1399, "150_444": 1400, "444_150": 1401, "150_455": 1402, "455_150": 1403, "263_345": 1404, "345_263": 1405, "105_29": 1406, "29_105": 1407, "74_145": 1408, "145_74": 1409, "74_397": 1410, "397_74": 1411, "239_466": 1412, "466_239": 1413, "106_11": 1414, "11_106": 1415, "321_321": 1416, "444_175": 1417, "175_444": 1418, "444_69": 1419, "69_444": 1420, "444_499": 1421, "499_444": 1422, "68_11": 1423, "11_68": 1424, "38_365": 1425, "365_38": 1426, "38_79": 1427, "79_38": 1428, "38_444": 1429, "444_38": 1430, "215_370": 1431, "370_215": 1432, "356_441": 1433, "441_356": 1434, "130_11": 1435, "11_130": 1436, "477_139": 1437, "139_477": 1438, "307_444": 1439, "444_307": 1440, "307_16": 1441, "16_307": 1442, "80_23": 1443, "23_80": 1444, "277_86": 1445, "86_277": 1446, "189_189": 1447, "68_482": 1448, "482_68": 1449, "380_330": 1450, "330_380": 1451, "388_417": 1452, "417_388": 1453, "295_406": 1454, "406_295": 1455, "15_417": 1456, "417_15": 1457, "374_139": 1458, "139_374": 1459, "374_99": 1460, "99_374": 1461, "84_353": 1462, "353_84": 1463, "390_497": 1464, "497_390": 1465, "431_207": 1466, "207_431": 1467, "170_29": 1468, "29_170": 1469, "432_98": 1470, "98_432": 1471, "432_191": 1472, "191_432": 1473, "432_445": 1474, "445_432": 1475, "432_494": 1476, "494_432": 1477, "432_111": 1478, "111_432": 1479, "432_391": 1480, "391_432": 1481, "432_407": 1482, "407_432": 1483, "108_108": 1484, "390_179": 1485, "179_390": 1486, "427_23": 1487, "23_427": 1488, "149_352": 1489, "352_149": 1490, "156_72": 1491, "72_156": 1492, "156_277": 1493, "277_156": 1494, "5_371": 1495, "371_5": 1496, "438_317": 1497, "317_438": 1498, "176_482": 1499, "482_176": 1500, "27_188": 1501, "188_27": 1502, "497_300": 1503, "300_497": 1504, "497_499": 1505, "499_497": 1506, "497_452": 1507, "452_497": 1508, "405_482": 1509, "482_405": 1510, "217_252": 1511, "252_217": 1512, "388_86": 1513, "86_388": 1514, "106_106": 1515, "380_278": 1516, "278_380": 1517, "191_404": 1518, "404_191": 1519, "499_139": 1520, "139_499": 1521, "337_42": 1522, "42_337": 1523, "421_197": 1524, "197_421": 1525, "105_371": 1526, "371_105": 1527, "8_482": 1528, "482_8": 1529, "307_443": 1530, "443_307": 1531, "369_73": 1532, "73_369": 1533, "224_39": 1534, "39_224": 1535, "224_482": 1536, "482_224": 1537, "187_187": 1538, "187_416": 1539, "416_187": 1540, "187_165": 1541, "165_187": 1542, "187_455": 1543, "455_187": 1544, "5_29": 1545, "29_5": 1546, "338_305": 1547, "305_338": 1548, "458_171": 1549, "171_458": 1550, "270_417": 1551, "417_270": 1552, "466_208": 1553, "208_466": 1554, "466_236": 1555, "236_466": 1556, "466_248": 1557, "248_466": 1558, "170_482": 1559, "482_170": 1560, "315_406": 1561, "406_315": 1562, "2_48": 1563, "48_2": 1564, "287_287": 1565, "403_404": 1566, "404_403": 1567, "438_29": 1568, "29_438": 1569, "380_29": 1570, "29_380": 1571, "407_64": 1572, "64_407": 1573, "48_285": 1574, "285_48": 1575, "76_167": 1576, "167_76": 1577, "470_499": 1578, "499_470": 1579, "64_15": 1580, "15_64": 1581, "231_290": 1582, "290_231": 1583, "231_444": 1584, "444_231": 1585, "84_272": 1586, "272_84": 1587, "84_388": 1588, "388_84": 1589, "315_289": 1590, "289_315": 1591, "162_42": 1592, "42_162": 1593, "438_482": 1594, "482_438": 1595, "460_136": 1596, "136_460": 1597, "190_190": 1598, "295_109": 1599, "109_295": 1600, "169_85": 1601, "85_169": 1602, "169_145": 1603, "145_169": 1604, "18_187": 1605, "187_18": 1606, "173_461": 1607, "461_173": 1608, "262_139": 1609, "139_262": 1610, "458_441": 1611, "441_458": 1612, "280_16": 1613, "16_280": 1614, "76_301": 1615, "301_76": 1616, "203_207": 1617, "207_203": 1618, "203_384": 1619, "384_203": 1620, "203_499": 1621, "499_203": 1622, "203_448": 1623, "448_203": 1624, "203_336": 1625, "336_203": 1626, "203_151": 1627, "151_203": 1628, "203_35": 1629, "35_203": 1630, "149_455": 1631, "455_149": 1632, "149_444": 1633, "444_149": 1634, "9_460": 1635, "460_9": 1636, "225_175": 1637, "175_225": 1638, "400_497": 1639, "497_400": 1640, "223_376": 1641, "376_223": 1642, "68_17": 1643, "17_68": 1644, "332_29": 1645, "29_332": 1646, "458_482": 1647, "482_458": 1648, "417_499": 1649, "499_417": 1650, "417_208": 1651, "208_417": 1652, "236_444": 1653, "444_236": 1654, "80_264": 1655, "264_80": 1656, "189_139": 1657, "139_189": 1658, "189_442": 1659, "442_189": 1660, "18_394": 1661, "394_18": 1662, "105_39": 1663, "39_105": 1664, "454_419": 1665, "419_454": 1666, "147_354": 1667, "354_147": 1668, "147_121": 1669, "121_147": 1670, "147_147": 1671, "200_182": 1672, "182_200": 1673, "208_208": 1674, "180_252": 1675, "252_180": 1676, "88_283": 1677, "283_88": 1678, "495_89": 1679, "89_495": 1680, "100_86": 1681, "86_100": 1682, "174_17": 1683, "17_174": 1684, "300_270": 1685, "270_300": 1686, "460_60": 1687, "60_460": 1688, "36_16": 1689, "16_36": 1690, "36_107": 1691, "107_36": 1692, "204_334": 1693, "334_204": 1694, "447_139": 1695, "139_447": 1696, "447_248": 1697, "248_447": 1698, "220_269": 1699, "269_220": 1700, "380_104": 1701, "104_380": 1702, "264_285": 1703, "285_264": 1704, "93_287": 1705, "287_93": 1706, "166_162": 1707, "162_166": 1708, "407_175": 1709, "175_407": 1710, "73_69": 1711, "69_73": 1712, "180_66": 1713, "66_180": 1714, "385_183": 1715, "183_385": 1716, "385_466": 1717, "466_385": 1718, "385_385": 1719, "458_371": 1720, "371_458": 1721, "217_278": 1722, "278_217": 1723, "350_99": 1724, "99_350": 1725, "277_393": 1726, "393_277": 1727, "277_59": 1728, "59_277": 1729, "277_324": 1730, "324_277": 1731, "277_287": 1732, "287_277": 1733, "315_325": 1734, "325_315": 1735, "5_4": 1736, "4_5": 1737, "395_330": 1738, "330_395": 1739, "304_461": 1740, "461_304": 1741, "180_317": 1742, "317_180": 1743, "364_348": 1744, "348_364": 1745, "113_76": 1746, "76_113": 1747, "446_17": 1748, "17_446": 1749, "203_86": 1750, "86_203": 1751, "407_285": 1752, "285_407": 1753, "2_60": 1754, "60_2": 1755, "2_376": 1756, "376_2": 1757, "342_342": 1758, "467_419": 1759, "419_467": 1760, "224_188": 1761, "188_224": 1762, "499_183": 1763, "183_499": 1764, "499_483": 1765, "483_499": 1766, "499_309": 1767, "309_499": 1768, "442_442": 1769, "442_499": 1770, "499_442": 1771, "150_421": 1772, "421_150": 1773, "150_233": 1774, "233_150": 1775, "150_189": 1776, "189_150": 1777, "150_353": 1778, "353_150": 1779, "241_285": 1780, "285_241": 1781, "407_99": 1782, "99_407": 1783, "461_305": 1784, "305_461": 1785, "428_2": 1786, "2_428": 1787, "65_429": 1788, "429_65": 1789, "352_217": 1790, "217_352": 1791, "352_81": 1792, "81_352": 1793, "76_396": 1794, "396_76": 1795, "18_18": 1796, "18_496": 1797, "496_18": 1798, "356_252": 1799, "252_356": 1800, "260_260": 1801, "260_455": 1802, "455_260": 1803, "260_69": 1804, "69_260": 1805, "380_223": 1806, "223_380": 1807, "458_39": 1808, "39_458": 1809, "321_7": 1810, "7_321": 1811, "321_186": 1812, "186_321": 1813, "384_183": 1814, "183_384": 1815, "384_448": 1816, "448_384": 1817, "327_183": 1818, "183_327": 1819, "266_6": 1820, "6_266": 1821, "5_296": 1822, "296_5": 1823, "165_168": 1824, "168_165": 1825, "13_13": 1826, "356_171": 1827, "171_356": 1828, "217_11": 1829, "11_217": 1830, "444_346": 1831, "346_444": 1832, "68_188": 1833, "188_68": 1834, "394_298": 1835, "298_394": 1836, "5_441": 1837, "441_5": 1838, "93_93": 1839, "198_317": 1840, "317_198": 1841, "301_167": 1842, "167_301": 1843, "390_12": 1844, "12_390": 1845, "265_186": 1846, "186_265": 1847, "496_466": 1848, "466_496": 1849, "496_69": 1850, "69_496": 1851, "311_96": 1852, "96_311": 1853, "447_499": 1854, "499_447": 1855, "447_447": 1856, "495_58": 1857, "58_495": 1858, "495_126": 1859, "126_495": 1860, "33_171": 1861, "171_33": 1862, "259_439": 1863, "439_259": 1864, "280_280": 1865, "105_482": 1866, "482_105": 1867, "407_81": 1868, "81_407": 1869, "190_183": 1870, "183_190": 1871, "296_115": 1872, "115_296": 1873, "304_145": 1874, "145_304": 1875, "304_175": 1876, "175_304": 1877, "253_305": 1878, "305_253": 1879, "166_179": 1880, "179_166": 1881, "321_280": 1882, "280_321": 1883, "321_342": 1884, "342_321": 1885, "192_318": 1886, "318_192": 1887, "192_339": 1888, "339_192": 1889, "192_399": 1890, "399_192": 1891, "293_120": 1892, "120_293": 1893, "460_308": 1894, "308_460": 1895, "353_453": 1896, "453_353": 1897, "174_394": 1898, "394_174": 1899, "262_376": 1900, "376_262": 1901, "483_139": 1902, "139_483": 1903, "483_151": 1904, "151_483": 1905, "105_93": 1906, "93_105": 1907, "350_16": 1908, "16_350": 1909, "494_404": 1910, "404_494": 1911, "241_284": 1912, "284_241": 1913, "464_354": 1914, "354_464": 1915, "105_317": 1916, "317_105": 1917, "97_148": 1918, "148_97": 1919, "230_466": 1920, "466_230": 1921, "9_80": 1922, "80_9": 1923, "9_9": 1924, "9_248": 1925, "248_9": 1926, "9_122": 1927, "122_9": 1928, "9_376": 1929, "376_9": 1930, "315_232": 1931, "232_315": 1932, "315_179": 1933, "179_315": 1934, "166_289": 1935, "289_166": 1936, "448_183": 1937, "183_448": 1938, "295_106": 1939, "106_295": 1940, "295_173": 1941, "173_295": 1942, "442_115": 1943, "115_442": 1944, "442_16": 1945, "16_442": 1946, "442_266": 1947, "266_442": 1948, "442_479": 1949, "479_442": 1950, "149_73": 1951, "73_149": 1952, "149_260": 1953, "260_149": 1954, "149_248": 1955, "248_149": 1956, "149_499": 1957, "499_149": 1958, "120_366": 1959, "366_120": 1960, "68_317": 1961, "317_68": 1962, "96_74": 1963, "74_96": 1964, "356_482": 1965, "482_356": 1966, "405_252": 1967, "252_405": 1968, "236_499": 1969, "499_236": 1970, "99_151": 1971, "151_99": 1972, "198_66": 1973, "66_198": 1974, "34_466": 1975, "466_34": 1976, "208_275": 1977, "275_208": 1978, "208_183": 1979, "183_208": 1980, "298_298": 1981, "298_385": 1982, "385_298": 1983, "298_291": 1984, "291_298": 1985, "421_167": 1986, "167_421": 1987, "69_69": 1988, "69_139": 1989, "139_69": 1990, "495_204": 1991, "204_495": 1992, "495_277": 1993, "277_495": 1994, "116_354": 1995, "354_116": 1996, "62_165": 1997, "165_62": 1998, "65_23": 1999, "23_65": 2000, "93_266": 2001, "266_93": 2002, "498_441": 2003, "441_498": 2004, "275_7": 2005, "7_275": 2006, "71_6": 2007, "6_71": 2008, "225_466": 2009, "466_225": 2010, "319_121": 2011, "121_319": 2012, "380_66": 2013, "66_380": 2014, "70_7": 2015, "7_70": 2016, "193_347": 2017, "347_193": 2018, "165_285": 2019, "285_165": 2020, "293_175": 2021, "175_293": 2022, "91_444": 2023, "444_91": 2024, "325_287": 2025, "287_325": 2026, "325_370": 2027, "370_325": 2028, "361_444": 2029, "444_361": 2030, "361_463": 2031, "463_361": 2032, "380_482": 2033, "482_380": 2034, "337_394": 2035, "394_337": 2036, "321_210": 2037, "210_321": 2038, "498_14": 2039, "14_498": 2040, "444_64": 2041, "64_444": 2042, "444_410": 2043, "410_444": 2044, "444_442": 2045, "442_444": 2046, "444_266": 2047, "266_444": 2048, "444_272": 2049, "272_444": 2050, "405_17": 2051, "17_405": 2052, "220_284": 2053, "284_220": 2054, "151_275": 2055, "275_151": 2056, "151_151": 2057, "107_419": 2058, "419_107": 2059, "61_23": 2060, "23_61": 2061, "97_210": 2062, "210_97": 2063, "284_179": 2064, "179_284": 2065, "320_271": 2066, "271_320": 2067, "65_17": 2068, "17_65": 2069, "260_222": 2070, "222_260": 2071, "8_104": 2072, "104_8": 2073, "172_460": 2074, "460_172": 2075, "108_73": 2076, "73_108": 2077, "448_275": 2078, "275_448": 2079, "161_3": 2080, "3_161": 2081, "161_79": 2082, "79_161": 2083, "303_303": 2084, "84_119": 2085, "119_84": 2086, "4_248": 2087, "248_4": 2088, "217_104": 2089, "104_217": 2090, "301_194": 2091, "194_301": 2092, "368_39": 2093, "39_368": 2094, "86_208": 2095, "208_86": 2096, "484_259": 2097, "259_484": 2098, "484_460": 2099, "460_484": 2100, "466_149": 2101, "149_466": 2102, "245_122": 2103, "122_245": 2104, "353_79": 2105, "79_353": 2106, "145_341": 2107, "341_145": 2108, "305_305": 2109, "38_342": 2110, "342_38": 2111, "3_354": 2112, "354_3": 2113, "452_447": 2114, "447_452": 2115, "174_376": 2116, "376_174": 2117, "405_188": 2118, "188_405": 2119, "307_7": 2120, "7_307": 2121, "372_248": 2122, "248_372": 2123, "372_35": 2124, "35_372": 2125, "337_486": 2126, "486_337": 2127, "458_252": 2128, "252_458": 2129, "446_330": 2130, "330_446": 2131, "375_468": 2132, "468_375": 2133, "375_7": 2134, "7_375": 2135, "375_128": 2136, "128_375": 2137, "375_466": 2138, "466_375": 2139, "375_16": 2140, "16_375": 2141, "375_448": 2142, "448_375": 2143, "245_171": 2144, "171_245": 2145, "264_153": 2146, "153_264": 2147, "58_125": 2148, "125_58": 2149, "58_326": 2150, "326_58": 2151, "58_58": 2152, "58_126": 2153, "126_58": 2154, "58_399": 2155, "399_58": 2156, "58_281": 2157, "281_58": 2158, "58_339": 2159, "339_58": 2160, "58_488": 2161, "488_58": 2162, "58_218": 2163, "218_58": 2164, "276_329": 2165, "329_276": 2166, "334_334": 2167, "421_421": 2168, "100_352": 2169, "352_100": 2170, "100_81": 2171, "81_100": 2172, "459_183": 2173, "183_459": 2174, "459_16": 2175, "16_459": 2176, "459_448": 2177, "448_459": 2178, "213_366": 2179, "366_213": 2180, "236_417": 2181, "417_236": 2182, "236_366": 2183, "366_236": 2184, "405_39": 2185, "39_405": 2186, "293_260": 2187, "260_293": 2188, "431_308": 2189, "308_431": 2190, "217_371": 2191, "371_217": 2192, "166_232": 2193, "232_166": 2194, "444_2": 2195, "2_444": 2196, "444_16": 2197, "16_444": 2198, "81_248": 2199, "248_81": 2200, "260_444": 2201, "444_260": 2202, "395_317": 2203, "317_395": 2204, "166_486": 2205, "486_166": 2206, "166_312": 2207, "312_166": 2208, "477_404": 2209, "404_477": 2210, "477_310": 2211, "310_477": 2212, "477_248": 2213, "248_477": 2214, "105_330": 2215, "330_105": 2216, "240_233": 2217, "233_240": 2218, "458_330": 2219, "330_458": 2220, "388_203": 2221, "203_388": 2222, "497_318": 2223, "318_497": 2224, "497_175": 2225, "175_497": 2226, "497_183": 2227, "183_497": 2228, "351_479": 2229, "479_351": 2230, "484_88": 2231, "88_484": 2232, "217_29": 2233, "29_217": 2234, "180_11": 2235, "11_180": 2236, "438_438": 2237, "365_119": 2238, "119_365": 2239, "212_119": 2240, "119_212": 2241, "84_104": 2242, "104_84": 2243, "405_409": 2244, "409_405": 2245, "45_159": 2246, "159_45": 2247, "198_330": 2248, "330_198": 2249, "55_55": 2250, "353_483": 2251, "483_353": 2252, "403_499": 2253, "499_403": 2254, "403_357": 2255, "357_403": 2256, "210_275": 2257, "275_210": 2258, "233_107": 2259, "107_233": 2260, "233_93": 2261, "93_233": 2262, "233_443": 2263, "443_233": 2264, "233_183": 2265, "183_233": 2266, "166_48": 2267, "48_166": 2268, "444_203": 2269, "203_444": 2270, "405_11": 2271, "11_405": 2272, "304_183": 2273, "183_304": 2274, "336_126": 2275, "126_336": 2276, "484_320": 2277, "320_484": 2278, "450_139": 2279, "139_450": 2280, "450_285": 2281, "285_450": 2282, "319_407": 2283, "407_319": 2284, "319_374": 2285, "374_319": 2286, "107_16": 2287, "16_107": 2288, "395_11": 2289, "11_395": 2290, "307_85": 2291, "85_307": 2292, "307_354": 2293, "354_307": 2294, "282_242": 2295, "242_282": 2296, "332_284": 2297, "284_332": 2298, "332_388": 2299, "388_332": 2300, "387_466": 2301, "466_387": 2302, "172_16": 2303, "16_172": 2304, "110_16": 2305, "16_110": 2306, "307_272": 2307, "272_307": 2308, "307_71": 2309, "71_307": 2310, "8_414": 2311, "414_8": 2312, "459_7": 2313, "7_459": 2314, "153_186": 2315, "186_153": 2316, "356_11": 2317, "11_356": 2318, "298_466": 2319, "466_298": 2320, "484_233": 2321, "233_484": 2322, "484_76": 2323, "76_484": 2324, "348_447": 2325, "447_348": 2326, "348_139": 2327, "139_348": 2328, "348_374": 2329, "374_348": 2330, "348_348": 2331, "348_183": 2332, "183_348": 2333, "348_69": 2334, "69_348": 2335, "211_211": 2336, "448_177": 2337, "177_448": 2338, "448_70": 2339, "70_448": 2340, "448_499": 2341, "499_448": 2342, "448_130": 2343, "130_448": 2344, "60_174": 2345, "174_60": 2346, "395_188": 2347, "188_395": 2348, "176_17": 2349, "17_176": 2350, "156_324": 2351, "324_156": 2352, "195_149": 2353, "149_195": 2354, "184_345": 2355, "345_184": 2356, "240_76": 2357, "76_240": 2358, "240_460": 2359, "460_240": 2360, "221_174": 2361, "174_221": 2362, "13_76": 2363, "76_13": 2364, "105_441": 2365, "441_105": 2366, "76_193": 2367, "193_76": 2368, "376_96": 2369, "96_376": 2370, "203_81": 2371, "81_203": 2372, "459_139": 2373, "139_459": 2374, "222_222": 2375, "180_278": 2376, "278_180": 2377, "15_334": 2378, "334_15": 2379, "73_65": 2380, "65_73": 2381, "73_427": 2382, "427_73": 2383, "73_93": 2384, "93_73": 2385, "73_203": 2386, "203_73": 2387, "73_347": 2388, "347_73": 2389, "73_463": 2390, "463_73": 2391, "332_482": 2392, "482_332": 2393, "332_39": 2394, "39_332": 2395, "380_188": 2396, "188_380": 2397, "198_482": 2398, "482_198": 2399, "403_466": 2400, "466_403": 2401, "403_322": 2402, "322_403": 2403, "215_325": 2404, "325_215": 2405, "185_312": 2406, "312_185": 2407, "246_16": 2408, "16_246": 2409, "94_94": 2410, "356_376": 2411, "376_356": 2412, "113_16": 2413, "16_113": 2414, "458_188": 2415, "188_458": 2416, "322_322": 2417, "322_248": 2418, "248_322": 2419, "498_371": 2420, "371_498": 2421, "56_196": 2422, "196_56": 2423, "220_70": 2424, "70_220": 2425, "485_460": 2426, "460_485": 2427, "4_287": 2428, "287_4": 2429, "186_186": 2430, "186_74": 2431, "74_186": 2432, "186_142": 2433, "142_186": 2434, "186_335": 2435, "335_186": 2436, "186_158": 2437, "158_186": 2438, "8_11": 2439, "11_8": 2440, "495_455": 2441, "455_495": 2442, "439_328": 2443, "328_439": 2444, "439_341": 2445, "341_439": 2446, "439_34": 2447, "34_439": 2448, "119_251": 2449, "251_119": 2450, "68_441": 2451, "441_68": 2452, "220_16": 2453, "16_220": 2454, "185_42": 2455, "42_185": 2456, "167_401": 2457, "401_167": 2458, "167_484": 2459, "484_167": 2460, "167_118": 2461, "118_167": 2462, "347_463": 2463, "463_347": 2464, "364_248": 2465, "248_364": 2466, "57_404": 2467, "404_57": 2468, "498_17": 2469, "17_498": 2470, "306_328": 2471, "328_306": 2472, "405_171": 2473, "171_405": 2474, "167_408": 2475, "408_167": 2476, "8_188": 2477, "188_8": 2478, "313_443": 2479, "443_313": 2480, "313_483": 2481, "483_313": 2482, "313_16": 2483, "16_313": 2484, "148_499": 2485, "499_148": 2486, "148_328": 2487, "328_148": 2488, "148_350": 2489, "350_148": 2490, "217_296": 2491, "296_217": 2492, "73_233": 2493, "233_73": 2494, "73_447": 2495, "447_73": 2496, "73_139": 2497, "139_73": 2498, "209_248": 2499, "248_209": 2500, "468_468": 2501, "468_7": 2502, "7_468": 2503, "468_265": 2504, "265_468": 2505, "200_163": 2506, "163_200": 2507, "41_172": 2508, "172_41": 2509, "5_17": 2510, "17_5": 2511, "8_296": 2512, "296_8": 2513, "238_463": 2514, "463_238": 2515, "395_441": 2516, "441_395": 2517, "185_370": 2518, "370_185": 2519, "16_139": 2520, "139_16": 2521, "16_466": 2522, "466_16": 2523, "16_196": 2524, "196_16": 2525, "16_327": 2526, "327_16": 2527, "16_16": 2528, "293_222": 2529, "222_293": 2530, "466_285": 2531, "285_466": 2532, "5_104": 2533, "104_5": 2534, "334_148": 2535, "148_334": 2536, "149_236": 2537, "236_149": 2538, "50_272": 2539, "272_50": 2540, "438_296": 2541, "296_438": 2542, "215_162": 2543, "162_215": 2544, "209_72": 2545, "72_209": 2546, "483_34": 2547, "34_483": 2548, "483_477": 2549, "477_483": 2550, "483_466": 2551, "466_483": 2552, "483_7": 2553, "7_483": 2554, "483_74": 2555, "74_483": 2556, "483_334": 2557, "334_483": 2558, "483_187": 2559, "187_483": 2560, "307_183": 2561, "183_307": 2562, "264_171": 2563, "171_264": 2564, "180_188": 2565, "188_180": 2566, "498_296": 2567, "296_498": 2568, "224_252": 2569, "252_224": 2570, "393_393": 2571, "276_37": 2572, "37_276": 2573, "320_93": 2574, "93_320": 2575, "320_15": 2576, "15_320": 2577, "60_394": 2578, "394_60": 2579, "233_233": 2580, "180_371": 2581, "371_180": 2582, "499_275": 2583, "275_499": 2584, "210_159": 2585, "159_210": 2586, "442_183": 2587, "183_442": 2588, "442_97": 2589, "97_442": 2590, "68_171": 2591, "171_68": 2592, "282_121": 2593, "121_282": 2594, "446_29": 2595, "29_446": 2596, "172_107": 2597, "107_172": 2598, "172_76": 2599, "76_172": 2600, "298_358": 2601, "358_298": 2602, "308_302": 2603, "302_308": 2604, "373_199": 2605, "199_373": 2606, "145_329": 2607, "329_145": 2608, "295_289": 2609, "289_295": 2610, "14_14": 2611, "499_455": 2612, "455_499": 2613, "176_176": 2614, "447_156": 2615, "156_447": 2616, "380_296": 2617, "296_380": 2618, "366_447": 2619, "447_366": 2620, "366_329": 2621, "329_366": 2622, "346_348": 2623, "348_346": 2624, "346_291": 2625, "291_346": 2626, "346_183": 2627, "183_346": 2628, "346_16": 2629, "16_346": 2630, "346_298": 2631, "298_346": 2632, "346_419": 2633, "419_346": 2634, "346_205": 2635, "205_346": 2636, "346_148": 2637, "148_346": 2638, "346_149": 2639, "149_346": 2640, "346_401": 2641, "401_346": 2642, "346_90": 2643, "90_346": 2644, "346_350": 2645, "350_346": 2646, "346_28": 2647, "28_346": 2648, "346_416": 2649, "416_346": 2650, "346_466": 2651, "466_346": 2652, "346_209": 2653, "209_346": 2654, "346_231": 2655, "231_346": 2656, "346_87": 2657, "87_346": 2658, "346_483": 2659, "483_346": 2660, "346_310": 2661, "310_346": 2662, "346_321": 2663, "321_346": 2664, "346_265": 2665, "265_346": 2666, "346_100": 2667, "100_346": 2668, "346_290": 2669, "290_346": 2670, "346_454": 2671, "454_346": 2672, "346_196": 2673, "196_346": 2674, "346_496": 2675, "496_346": 2676, "346_385": 2677, "385_346": 2678, "346_374": 2679, "374_346": 2680, "346_493": 2681, "493_346": 2682, "346_213": 2683, "213_346": 2684, "346_34": 2685, "34_346": 2686, "346_347": 2687, "347_346": 2688, "346_463": 2689, "463_346": 2690, "346_461": 2691, "461_346": 2692, "346_70": 2693, "70_346": 2694, "346_235": 2695, "235_346": 2696, "346_338": 2697, "338_346": 2698, "346_306": 2699, "306_346": 2700, "346_392": 2701, "392_346": 2702, "346_305": 2703, "305_346": 2704, "346_280": 2705, "280_346": 2706, "346_351": 2707, "351_346": 2708, "346_342": 2709, "342_346": 2710, "346_69": 2711, "69_346": 2712, "346_246": 2713, "246_346": 2714, "346_128": 2715, "128_346": 2716, "346_211": 2717, "211_346": 2718, "346_253": 2719, "253_346": 2720, "346_492": 2721, "492_346": 2722, "346_375": 2723, "375_346": 2724, "346_269": 2725, "269_346": 2726, "346_142": 2727, "142_346": 2728, "346_159": 2729, "159_346": 2730, "346_443": 2731, "443_346": 2732, "346_456": 2733, "456_346": 2734, "346_97": 2735, "97_346": 2736, "346_358": 2737, "358_346": 2738, "346_130": 2739, "130_346": 2740, "346_210": 2741, "210_346": 2742, "346_86": 2743, "86_346": 2744, "346_25": 2745, "25_346": 2746, "346_275": 2747, "275_346": 2748, "497_139": 2749, "139_497": 2750, "394_233": 2751, "233_394": 2752, "466_354": 2753, "354_466": 2754, "466_23": 2755, "23_466": 2756, "466_206": 2757, "206_466": 2758, "466_334": 2759, "334_466": 2760, "466_97": 2761, "97_466": 2762, "223_284": 2763, "284_223": 2764, "368_104": 2765, "104_368": 2766, "176_29": 2767, "29_176": 2768, "96_86": 2769, "86_96": 2770, "96_417": 2771, "417_96": 2772, "96_482": 2773, "482_96": 2774, "217_188": 2775, "188_217": 2776, "8_371": 2777, "371_8": 2778, "8_330": 2779, "330_8": 2780, "100_99": 2781, "99_100": 2782, "13_60": 2783, "60_13": 2784, "390_449": 2785, "449_390": 2786, "47_376": 2787, "376_47": 2788, "47_353": 2789, "353_47": 2790, "458_29": 2791, "29_458": 2792, "68_29": 2793, "29_68": 2794, "79_77": 2795, "77_79": 2796, "290_240": 2797, "240_290": 2798, "185_72": 2799, "72_185": 2800, "149_207": 2801, "207_149": 2802, "149_354": 2803, "354_149": 2804, "57_191": 2805, "191_57": 2806, "35_455": 2807, "455_35": 2808, "366_264": 2809, "264_366": 2810, "317_76": 2811, "76_317": 2812, "261_23": 2813, "23_261": 2814, "150_499": 2815, "499_150": 2816, "200_359": 2817, "359_200": 2818, "239_394": 2819, "394_239": 2820, "240_123": 2821, "123_240": 2822, "370_60": 2823, "60_370": 2824, "370_9": 2825, "9_370": 2826, "337_337": 2827, "69_443": 2828, "443_69": 2829, "69_183": 2830, "183_69": 2831, "69_305": 2832, "305_69": 2833, "69_7": 2834, "7_69": 2835, "5_330": 2836, "330_5": 2837, "421_60": 2838, "60_421": 2839, "173_419": 2840, "419_173": 2841, "211_499": 2842, "499_211": 2843, "211_210": 2844, "210_211": 2845, "27_317": 2846, "317_27": 2847, "332_296": 2848, "296_332": 2849, "37_38": 2850, "38_37": 2851, "37_479": 2852, "479_37": 2853, "394_394": 2854, "213_447": 2855, "447_213": 2856, "213_139": 2857, "139_213": 2858, "213_236": 2859, "236_213": 2860, "408_16": 2861, "16_408": 2862, "101_376": 2863, "376_101": 2864, "352_318": 2865, "318_352": 2866, "466_81": 2867, "81_466": 2868, "314_7": 2869, "7_314": 2870, "176_317": 2871, "317_176": 2872, "460_463": 2873, "463_460": 2874, "332_66": 2875, "66_332": 2876, "224_4": 2877, "4_224": 2878, "217_317": 2879, "317_217": 2880, "287_484": 2881, "484_287": 2882, "301_284": 2883, "284_301": 2884, "394_79": 2885, "79_394": 2886, "484_50": 2887, "50_484": 2888, "170_66": 2889, "66_170": 2890, "275_305": 2891, "305_275": 2892, "287_29": 2893, "29_287": 2894, "293_447": 2895, "447_293": 2896, "31_23": 2897, "23_31": 2898, "269_269": 2899, "70_16": 2900, "16_70": 2901, "394_343": 2902, "343_394": 2903, "233_172": 2904, "172_233": 2905, "186_499": 2906, "499_186": 2907, "389_312": 2908, "312_389": 2909, "198_11": 2910, "11_198": 2911, "376_310": 2912, "310_376": 2913, "498_29": 2914, "29_498": 2915, "376_76": 2916, "76_376": 2917, "364_444": 2918, "444_364": 2919, "420_309": 2920, "309_420": 2921, "180_17": 2922, "17_180": 2923, "172_134": 2924, "134_172": 2925, "368_252": 2926, "252_368": 2927, "128_385": 2928, "385_128": 2929, "498_252": 2930, "252_498": 2931, "444_497": 2932, "497_444": 2933, "444_165": 2934, "165_444": 2935, "444_183": 2936, "183_444": 2937, "390_226": 2938, "226_390": 2939, "416_455": 2940, "455_416": 2941, "79_75": 2942, "75_79": 2943, "15_233": 2944, "233_15": 2945, "260_203": 2946, "203_260": 2947, "187_444": 2948, "444_187": 2949, "187_38": 2950, "38_187": 2951, "187_186": 2952, "186_187": 2953, "187_34": 2954, "34_187": 2955, "187_6": 2956, "6_187": 2957, "187_442": 2958, "442_187": 2959, "187_354": 2960, "354_187": 2961, "187_282": 2962, "282_187": 2963, "187_305": 2964, "305_187": 2965, "115_8": 2966, "8_115": 2967, "416_34": 2968, "34_416": 2969, "416_417": 2970, "417_416": 2971, "416_305": 2972, "305_416": 2973, "416_208": 2974, "208_416": 2975, "416_290": 2976, "290_416": 2977, "498_317": 2978, "317_498": 2979, "149_366": 2980, "366_149": 2981, "149_348": 2982, "348_149": 2983, "277_264": 2984, "264_277": 2985, "484_431": 2986, "431_484": 2987, "93_74": 2988, "74_93": 2989, "93_153": 2990, "153_93": 2991, "455_126": 2992, "126_455": 2993, "352_329": 2994, "329_352": 2995, "231_208": 2996, "208_231": 2997, "231_236": 2998, "236_231": 2999, "313_183": 3000, "183_313": 3001, "313_275": 3002, "275_313": 3003, "313_419": 3004, "419_313": 3005, "87_363": 3006, "363_87": 3007, "356_17": 3008, "17_356": 3009, "499_175": 3010, "175_499": 3011, "332_330": 3012, "330_332": 3013, "96_266": 3014, "266_96": 3015, "36_73": 3016, "73_36": 3017, "466_153": 3018, "153_466": 3019, "466_272": 3020, "272_466": 3021, "466_221": 3022, "221_466": 3023, "265_123": 3024, "123_265": 3025, "265_151": 3026, "151_265": 3027, "34_499": 3028, "499_34": 3029, "321_499": 3030, "499_321": 3031, "321_265": 3032, "265_321": 3033, "321_266": 3034, "266_321": 3035, "321_334": 3036, "334_321": 3037, "321_208": 3038, "208_321": 3039, "215_447": 3040, "447_215": 3041, "80_418": 3042, "418_80": 3043, "454_139": 3044, "139_454": 3045, "272_187": 3046, "187_272": 3047, "488_126": 3048, "126_488": 3049, "488_495": 3050, "495_488": 3051, "488_488": 3052, "488_267": 3053, "267_488": 3054, "488_89": 3055, "89_488": 3056, "105_188": 3057, "188_105": 3058, "128_354": 3059, "354_128": 3060, "128_310": 3061, "310_128": 3062, "128_275": 3063, "275_128": 3064, "128_7": 3065, "7_128": 3066, "40_357": 3067, "357_40": 3068, "368_371": 3069, "371_368": 3070, "298_16": 3071, "16_298": 3072, "233_447": 3073, "447_233": 3074, "237_353": 3075, "353_237": 3076, "3_376": 3077, "376_3": 3078, "337_325": 3079, "325_337": 3080, "114_114": 3081, "27_252": 3082, "252_27": 3083, "198_2": 3084, "2_198": 3085, "356_330": 3086, "330_356": 3087, "105_66": 3088, "66_105": 3089, 