{"PAD": 0, "DUMMY_START_RELATION": 1, "UNK": 2, "6_6": 3, "36_18": 4, "50_17": 5, "8_25": 6, "38_38": 7, "37_28": 8, "14_45": 9, "5_25": 10, "43_32": 11, "14_22": 12, "28_17": 13, "17_26": 14, "28_47": 15, "27_29": 16, "13_5": 17, "47_48": 18, "37_17": 19, "34_47": 20, "5_44": 21, "49_17": 22, "5_18": 23, "2_42": 24, "3_14": 25, "33_46": 26, "51_51": 27, "36_46": 28, "34_13": 29, "6_35": 30, "18_47": 31, "46_46": 32, "46_24": 33, "17_4": 34, "22_21": 35, "41_47": 36, "8_41": 37, "10_47": 38, "17_49": 39, "17_47": 40, "25_13": 41, "46_7": 42, "27_50": 43, "37_37": 44, "23_45": 45, "40_34": 46, "4_34": 47, "40_19": 48, "16_16": 49, "44_17": 50, "44_2": 51, "13_44": 52, "44_45": 53, "31_24": 54, "27_14": 55, "30_30": 56, "34_12": 57, "11_24": 58, "36_38": 59, "46_32": 60, "43_21": 61, "34_46": 62, "20_17": 63, "44_44": 64, "48_24": 65, "20_50": 66, "32_32": 67, "44_18": 68, "36_35": 69, "12_12": 70, "41_50": 71, "45_17": 72, "13_2": 73, "36_36": 74, "7_46": 75, "21_24": 76, "4_47": 77, "45_29": 78, "3_50": 79, "16_36": 80, "5_45": 81, "34_37": 82, "35_35": 83, "4_50": 84, "39_29": 85, "12_44": 86, "37_14": 87, "45_47": 88, "28_4": 89, "33_33": 90, "5_8": 91, "6_36": 92, "39_25": 93, "18_4": 94, "14_28": 95, "36_33": 96, "30_27": 97, "50_45": 98, "48_48": 99, "32_46": 100, "12_37": 101, "40_40": 102, "37_20": 103, "10_27": 104, "18_34": 105, "34_31": 106, "40_2": 107, "44_39": 108, "8_17": 109, "30_37": 110, "7_22": 111, "6_31": 112, "5_17": 113, "26_51": 114, "36_40": 115, "10_10": 116, "37_2": 117, "12_41": 118, "28_50": 119, "14_29": 120, "25_49": 121, "33_24": 122, "25_25": 123, "23_17": 124, "16_34": 125, "47_10": 126, "45_13": 127, "13_13": 128, "5_13": 129, "13_49": 130, "11_47": 131, "5_27": 132, "42_8": 133, "18_39": 134, "41_12": 135, "32_43": 136, "5_49": 137, "18_18": 138, "35_24": 139, "8_8": 140, "19_48": 141, "5_14": 142, "47_47": 143, "30_49": 144, "46_11": 145, "7_41": 146, "38_10": 147, "22_25": 148, "18_19": 149, "34_34": 150, "14_20": 151, "22_46": 152, "3_42": 153, "39_44": 154, "5_5": 155, "35_48": 156, "14_17": 157, "8_18": 158, "20_37": 159, "8_47": 160, "21_7": 161, "11_45": 162, "26_36": 163, "49_5": 164, "44_13": 165, "23_28": 166, "12_45": 167, "25_20": 168, "40_48": 169, "8_49": 170, "26_26": 171, "46_18": 172, "17_50": 173, "20_23": 174, "36_51": 175, "31_31": 176, "27_17": 177, "18_45": 178, "51_47": 179, "36_39": 180, "41_29": 181, "14_27": 182, "18_49": 183, "37_18": 184, "33_26": 185, "45_50": 186, "10_6": 187, "45_23": 188, "45_14": 189, "31_34": 190, "20_4": 191, "39_18": 192, "44_19": 193, "32_24": 194, "37_47": 195, "35_21": 196, "15_40": 197, "46_36": 198, "3_3": 199, "19_16": 200, "16_31": 201, "12_18": 202, "26_20": 203, "49_12": 204, "26_2": 205, "49_39": 206, "12_49": 207, "45_45": 208, "27_30": 209, "33_21": 210, "51_11": 211, "50_39": 212, "27_5": 213, "20_47": 214, "12_17": 215, "19_40": 216, "18_29": 217, "35_2": 218, "34_29": 219, "42_15": 220, "25_14": 221, "22_45": 222, "37_36": 223, "17_37": 224, "30_47": 225, "30_18": 226, "27_37": 227, "39_49": 228, "47_11": 229, "17_2": 230, "4_37": 231, "2_16": 232, "20_14": 233, "25_45": 234, "12_24": 235, "39_50": 236, "17_13": 237, "49_44": 238, "23_41": 239, "45_37": 240, "21_13": 241, "4_4": 242, "37_23": 243, "8_44": 244, "14_13": 245, "48_40": 246, "37_41": 247, "46_19": 248, "26_11": 249, "31_29": 250, "21_51": 251, "13_17": 252, "12_36": 253, "43_43": 254, "41_41": 255, "44_25": 256, "34_9": 257, "40_11": 258, "42_44": 259, "17_51": 260, "20_26": 261, "19_6": 262, "10_17": 263, "27_47": 264, "21_21": 265, "32_21": 266, "19_42": 267, "44_34": 268, "15_18": 269, "8_13": 270, "41_18": 271, "6_25": 272, "9_38": 273, "11_38": 274, "41_17": 275, "3_18": 276, "26_47": 277, "46_48": 278, "14_4": 279, "50_41": 280, "25_30": 281, "14_30": 282, "19_19": 283, "28_2": 284, "17_29": 285, "49_20": 286, "34_30": 287, "17_36": 288, "42_5": 289, "18_37": 290, "44_49": 291, "6_11": 292, "11_46": 293, "17_44": 294, "32_3": 295, "18_20": 296, "45_4": 297, "10_8": 298, "24_46": 299, "31_9": 300, "38_31": 301, "23_49": 302, "28_14": 303, "13_25": 304, "18_48": 305, "49_22": 306, "44_8": 307, "45_5": 308, "49_41": 309, "14_5": 310, "27_2": 311, "9_47": 312, "15_47": 313, "15_15": 314, "30_14": 315, "42_18": 316, "18_46": 317, "15_48": 318, "36_9": 319, "25_44": 320, "48_19": 321, "28_6": 322, "21_8": 323, "13_45": 324, "27_34": 325, "26_18": 326, "8_48": 327, "28_29": 328, "31_15": 329, "48_2": 330, "22_12": 331, "6_34": 332, "25_18": 333, "51_36": 334, "25_5": 335, "12_32": 336, "41_34": 337, "47_9": 338, "30_23": 339, "47_40": 340, "14_37": 341, "47_6": 342, "40_6": 343, "46_43": 344, "5_47": 345, "29_15": 346, "43_46": 347, "4_29": 348, "21_9": 349, "12_46": 350, "31_48": 351, "30_48": 352, "25_17": 353, "21_46": 354, "18_12": 355, "35_39": 356, "44_46": 357, "2_48": 358, "44_47": 359, "25_11": 360, "42_13": 361, "3_29": 362, "22_17": 363, "45_34": 364, "11_11": 365, "12_8": 366, "28_11": 367, "36_25": 368, "41_23": 369, "36_8": 370, "21_48": 371, "44_37": 372, "50_4": 373, "5_2": 374, "15_36": 375, "35_47": 376, "12_39": 377, "35_46": 378, "30_25": 379, "47_28": 380, "22_5": 381, "44_5": 382, "36_24": 383, "7_21": 384, "42_47": 385, "28_13": 386, "40_24": 387, "15_9": 388, "13_18": 389, "20_29": 390, "35_36": 391, "46_26": 392, "31_37": 393, "41_15": 394, "36_2": 395, "25_42": 396, "49_25": 397, "11_48": 398, "17_23": 399, "28_37": 400, "51_2": 401, "39_46": 402, "18_27": 403, "46_47": 404, "44_51": 405, "13_12": 406, "48_31": 407, "44_28": 408, "47_2": 409, "19_36": 410, "4_17": 411, "21_32": 412, "37_19": 413, "14_44": 414, "18_36": 415, "41_36": 416, "34_51": 417, "27_27": 418, "9_9": 419, "37_25": 420, "22_18": 421, "39_24": 422, "19_34": 423, "19_31": 424, "4_14": 425, "50_20": 426, "26_7": 427, "47_34": 428, "42_46": 429, "21_43": 430, "22_27": 431, "12_23": 432, "18_9": 433, "25_12": 434, "9_30": 435, "23_4": 436, "37_7": 437, "15_29": 438, "18_25": 439, "25_28": 440, "7_26": 441, "3_37": 442, "10_19": 443, "8_36": 444, "43_26": 445, "8_38": 446, "46_12": 447, "8_45": 448, "3_5": 449, "26_14": 450, "10_36": 451, "36_21": 452, "41_4": 453, "10_45": 454, "21_29": 455, "25_9": 456, "15_42": 457, "8_39": 458, "28_34": 459, "8_21": 460, "20_36": 461, "39_39": 462, "8_46": 463, "5_19": 464, "23_20": 465, "44_27": 466, "27_36": 467, "31_19": 468, "36_16": 469, "39_8": 470, "51_18": 471, "22_37": 472, "21_41": 473, "27_4": 474, "18_28": 475, "8_28": 476, "46_2": 477, "47_45": 478, "37_39": 479, "2_11": 480, "31_12": 481, "3_47": 482, "51_7": 483, "28_23": 484, "17_17": 485, "7_18": 486, "14_41": 487, "35_8": 488, "45_6": 489, "15_41": 490, "21_18": 491, "22_8": 492, "12_51": 493, "30_41": 494, "8_7": 495, "31_40": 496, "22_23": 497, "45_49": 498, "5_12": 499, "8_2": 500, "25_47": 501, "13_30": 502, "41_45": 503, "22_39": 504, "26_32": 505, "12_28": 506, "28_51": 507, "8_5": 508, "42_26": 509, "26_46": 510, "36_3": 511, "49_30": 512, "4_3": 513, "13_41": 514, "20_8": 515, "7_7": 516, "4_30": 517, "4_2": 518, "39_12": 519, "46_29": 520, "3_31": 521, "39_36": 522, "22_30": 523, "20_18": 524, "12_2": 525, "36_26": 526, "34_25": 527, "41_19": 528, "4_36": 529, "30_2": 530, "22_44": 531, "39_47": 532, "44_14": 533, "18_17": 534, "23_23": 535, "20_19": 536, "25_8": 537, "45_30": 538, "13_29": 539, "41_6": 540, "18_2": 541, "29_29": 542, "35_34": 543, "13_28": 544, "7_24": 545, "27_26": 546, "8_42": 547, "28_28": 548, "15_6": 549, "31_5": 550, "2_40": 551, "19_47": 552, "26_42": 553, "46_8": 554, "50_28": 555, "13_14": 556, "18_30": 557, "37_45": 558, "21_34": 559, "50_27": 560, "49_36": 561, "37_51": 562, "13_8": 563, "34_24": 564, "41_24": 565, "11_39": 566, "37_13": 567, "12_20": 568, "4_18": 569, "44_12": 570, "24_7": 571, "11_8": 572, "29_3": 573, "30_17": 574, "7_30": 575, "21_19": 576, "41_37": 577, "47_19": 578, "28_8": 579, "26_24": 580, "21_5": 581, "34_44": 582, "46_25": 583, "47_31": 584, "5_20": 585, "13_48": 586, "26_45": 587, "18_41": 588, "35_45": 589, "35_29": 590, "48_47": 591, "36_34": 592, "28_36": 593, "35_19": 594, "2_13": 595, "36_22": 596, "45_26": 597, "36_14": 598, "12_48": 599, "44_42": 600, "13_34": 601, "4_49": 602, "41_35": 603, "2_36": 604, "36_15": 605, "6_10": 606, "37_8": 607, "45_2": 608, "34_26": 609, "34_19": 610, "51_48": 611, "47_36": 612, "18_42": 613, "32_26": 614, "11_31": 615, "5_41": 616, "17_34": 617, "33_8": 618, "49_27": 619, "19_11": 620, "51_42": 621, "18_11": 622, "21_12": 623, "47_5": 624, "31_16": 625, "17_35": 626, "5_51": 627, "15_51": 628, "40_31": 629, "25_15": 630, "31_36": 631, "10_4": 632, "5_29": 633, "7_8": 634, "41_26": 635, "35_23": 636, "21_47": 637, "10_20": 638, "49_45": 639, "28_26": 640, "3_36": 641, "26_19": 642, "24_24": 643, "49_28": 644, "45_46": 645, "6_47": 646, "27_7": 647, "15_2": 648, "22_7": 649, "31_50": 650, "14_36": 651, "22_13": 652, "36_31": 653, "18_21": 654, "18_24": 655, "26_27": 656, "49_35": 657, "15_19": 658, "2_8": 659, "12_7": 660, "2_34": 661, "43_24": 662, "22_26": 663, "30_40": 664, "42_37": 665, "20_20": 666, "12_3": 667, "41_13": 668, "11_6": 669, "34_5": 670, "45_11": 671, "23_14": 672, "45_35": 673, "42_4": 674, "11_26": 675, "22_24": 676, "44_20": 677, "45_19": 678, "30_4": 679, "30_42": 680, "12_26": 681, "28_39": 682, "18_51": 683, "20_48": 684, "4_51": 685, "26_48": 686, "48_34": 687, "12_25": 688, "36_45": 689, "42_29": 690, "6_48": 691, "36_47": 692, "49_8": 693, "6_38": 694, "3_4": 695, "34_15": 696, "47_4": 697, "13_37": 698, "10_16": 699, "42_12": 700, "8_19": 701, "36_28": 702, "45_36": 703, "17_48": 704, "15_46": 705, "46_21": 706, "12_34": 707, "5_11": 708, "51_37": 709, "8_37": 710, "14_26": 711, "23_18": 712, "27_35": 713, "35_20": 714, "37_12": 715, "31_8": 716, "21_17": 717, "51_15": 718, "13_21": 719, "34_36": 720, "25_4": 721, "46_9": 722, "4_19": 723, "37_27": 724, "31_2": 725, "36_19": 726, "35_26": 727, "12_42": 728, "31_13": 729, "19_2": 730, "13_51": 731, "5_6": 732, "20_30": 733, "14_18": 734, "9_18": 735, "2_24": 736, "34_18": 737, "28_24": 738, "29_44": 739, "5_30": 740, "25_37": 741, "41_7": 742, "5_26": 743, "37_11": 744, "30_19": 745, "48_36": 746, "31_46": 747, "18_8": 748, "12_47": 749, "23_35": 750, "37_49": 751, "44_41": 752, "5_7": 753, "37_21": 754, "36_10": 755, "28_19": 756, "14_25": 757, "8_12": 758, "32_12": 759, "30_45": 760, "6_29": 761, "15_24": 762, "13_7": 763, "5_46": 764, "36_44": 765, "18_14": 766, "39_37": 767, "23_27": 768, "46_49": 769, "28_10": 770, "28_44": 771, "8_40": 772, "27_46": 773, "13_42": 774, "20_25": 775, "46_40": 776, "30_46": 777, "41_8": 778, "30_21": 779, "31_21": 780, "27_11": 781, "37_26": 782, "25_36": 783, "35_41": 784, "6_21": 785, "51_34": 786, "19_24": 787, "17_5": 788, "45_44": 789, "3_21": 790, "12_19": 791, "45_25": 792, "16_24": 793, "23_48": 794, "15_35": 795, "13_3": 796, "27_23": 797, "26_28": 798, "21_25": 799, "9_25": 800, "26_30": 801, "11_28": 802, "21_49": 803, "36_50": 804, "18_23": 805, "8_43": 806, "36_7": 807, "23_37": 808, "12_29": 809, "26_37": 810, "34_8": 811, "14_11": 812, "45_51": 813, "10_41": 814, "15_34": 815, "50_12": 816, "51_9": 817, "42_25": 818, "9_24": 819, "16_10": 820, "10_28": 821, "35_6": 822, "36_6": 823, "33_4": 824, "46_37": 825, "25_27": 826, "10_15": 827, "49_21": 828, "27_19": 829, "37_9": 830, "9_31": 831, "31_30": 832, "49_40": 833, "5_34": 834, "15_31": 835, "15_37": 836, "34_2": 837, "36_29": 838, "31_18": 839, "5_39": 840, "21_26": 841, "12_30": 842, "29_6": 843, "4_23": 844, "4_28": 845, "30_36": 846, "17_24": 847, "46_28": 848, "8_32": 849, "15_16": 850, "36_11": 851, "26_43": 852, "23_30": 853, "49_37": 854, "30_3": 855, "46_41": 856, "28_49": 857, "10_48": 858, "39_21": 859, "49_13": 860, "42_30": 861, "18_44": 862, "13_46": 863, "15_30": 864, "2_47": 865, "22_28": 866, "13_19": 867, "36_30": 868, "49_18": 869, "41_49": 870, "17_19": 871, "31_11": 872, "4_26": 873, "20_49": 874, "13_20": 875, "21_2": 876, "36_5": 877, "47_21": 878, "35_18": 879, "26_49": 880, "13_47": 881, "41_30": 882, "42_36": 883, "17_20": 884, "28_18": 885, "20_34": 886, "36_12": 887, "44_6": 888, "45_20": 889, "5_37": 890, "46_44": 891, "8_20": 892, "22_4": 893, "32_8": 894, "23_8": 895, "42_51": 896, "30_26": 897, "9_51": 898, "46_42": 899, "38_24": 900, "5_21": 901, "34_4": 902, "35_28": 903, "48_16": 904, "27_51": 905, "39_13": 906, "21_4": 907, "9_26": 908, "12_5": 909, "36_4": 910, "34_40": 911, "27_39": 912, "41_28": 913, "51_19": 914, "17_8": 915, "51_26": 916, "27_20": 917, "46_45": 918, "2_21": 919, "42_21": 920, "18_3": 921, "45_24": 922, "15_11": 923, "7_17": 924, "27_48": 925, "34_48": 926, "51_29": 927, "7_27": 928, "51_6": 929, "11_34": 930, "25_29": 931, "23_39": 932, "8_34": 933, "17_21": 934, "18_15": 935, "46_51": 936, "37_34": 937, "44_48": 938, "51_45": 939, "31_47": 940, "8_4": 941, "36_37": 942, "39_4": 943, "39_23": 944, "8_24": 945, "29_12": 946, "49_24": 947, "23_29": 948, "48_11": 949, "8_23": 950, "36_42": 951, "3_46": 952, "30_8": 953, "29_13": 954, "27_15": 955, "11_27": 956, "10_11": 957, "33_36": 958, "31_25": 959, "42_6": 960, "23_2": 961, "44_29": 962, "16_38": 963, "15_25": 964, "21_37": 965, "25_6": 966, "25_40": 967, "44_24": 968, "2_2": 969, "18_26": 970, "36_48": 971, "41_48": 972, "21_44": 973, "27_18": 974, "21_45": 975, "4_35": 976, "3_15": 977, "29_25": 978, "47_38": 979, "15_4": 980, "5_28": 981, "8_35": 982, "27_12": 983, "25_51": 984, "37_24": 985, "11_36": 986, "11_18": 987, "29_47": 988, "20_2": 989, "29_51": 990, "35_37": 991, "29_45": 992, "3_25": 993, "47_3": 994, "4_9": 995, "37_35": 996, "24_8": 997, "7_5": 998, "36_49": 999, "37_42": 1000, "8_14": 1001, "22_35": 1002, "30_12": 1003, "25_41": 1004, "47_8": 1005, "27_8": 1006, "22_36": 1007, "16_48": 1008, "47_42": 1009, "12_35": 1010, "21_35": 1011, "24_48": 1012, "25_39": 1013, "24_21": 1014, "39_5": 1015, "9_39": 1016, "5_15": 1017, "31_51": 1018, "23_21": 1019, "12_13": 1020, "33_12": 1021, "21_6": 1022, "30_39": 1023, "37_4": 1024, "8_27": 1025, "31_3": 1026, "45_8": 1027, "15_5": 1028, "30_20": 1029, "26_39": 1030, "11_4": 1031, "17_30": 1032, "3_24": 1033, "46_34": 1034, "37_29": 1035, "42_2": 1036, "15_12": 1037, "6_9": 1038, "21_36": 1039, "46_17": 1040, "41_5": 1041, "49_26": 1042, "17_18": 1043, "25_24": 1044, "41_11": 1045, "6_4": 1046, "30_28": 1047, "34_16": 1048, "42_42": 1049, "25_2": 1050, "26_12": 1051, "41_2": 1052, "24_2": 1053, "39_11": 1054, "17_25": 1055, "17_41": 1056, "7_45": 1057, "26_3": 1058, "23_36": 1059, "19_5": 1060, "21_11": 1061, "40_46": 1062, "30_6": 1063, "25_46": 1064, "9_11": 1065, "9_36": 1066, "45_18": 1067, "28_41": 1068, "28_31": 1069, "11_29": 1070, "4_10": 1071, "23_46": 1072, "33_18": 1073, "45_48": 1074, "3_28": 1075, "6_42": 1076, "4_11": 1077, "22_20": 1078, "21_40": 1079, "18_5": 1080, "30_15": 1081, "21_27": 1082, "2_31": 1083, "20_6": 1084, "5_24": 1085, "6_45": 1086, "44_4": 1087, "15_39": 1088, "21_42": 1089, "6_8": 1090, "2_19": 1091, "31_44": 1092, "21_14": 1093, "37_30": 1094, "47_35": 1095, "35_4": 1096, "2_9": 1097, "51_24": 1098, "36_17": 1099, "12_27": 1100, "46_27": 1101, "31_33": 1102, "51_4": 1103, "17_14": 1104, "8_29": 1105, "20_27": 1106, "30_29": 1107, "28_21": 1108, "20_11": 1109, "28_30": 1110, "33_30": 1111, "26_41": 1112, "13_11": 1113, "20_51": 1114, "26_35": 1115, "21_39": 1116, "46_30": 1117, "34_50": 1118, "5_48": 1119, "11_16": 1120, "29_46": 1121, "6_13": 1122, "26_40": 1123, "35_11": 1124, "32_30": 1125, "18_40": 1126, "35_27": 1127, "51_46": 1128, "6_40": 1129, "44_9": 1130, "29_5": 1131, "17_11": 1132, "51_12": 1133, "49_23": 1134, "18_6": 1135, "23_24": 1136, "29_4": 1137, "3_45": 1138, "37_5": 1139, "18_38": 1140, "22_11": 1141, "45_21": 1142, "28_35": 1143, "7_20": 1144, "50_36": 1145, "11_40": 1146, "49_9": 1147, "5_42": 1148, "37_48": 1149, "8_51": 1150, "31_6": 1151, "14_51": 1152, "20_5": 1153, "30_7": 1154, "11_15": 1155, "32_51": 1156, "13_26": 1157, "47_20": 1158, "46_15": 1159, "14_24": 1160, "36_20": 1161, "20_24": 1162, "46_14": 1163, "11_42": 1164, "42_27": 1165, "3_12": 1166, "3_34": 1167, "39_35": 1168, "28_12": 1169, "30_51": 1170, "30_24": 1171, "41_14": 1172, "20_12": 1173, "49_15": 1174, "20_9": 1175, "12_15": 1176, "46_5": 1177, "15_49": 1178, "4_20": 1179, "44_40": 1180, "36_23": 1181, "3_35": 1182, "47_41": 1183, "4_44": 1184, "34_35": 1185, "24_47": 1186, "24_32": 1187, "26_25": 1188, "10_5": 1189, "20_7": 1190, "11_37": 1191, "12_4": 1192, "21_20": 1193, "39_22": 1194, "27_13": 1195, "45_10": 1196, "24_19": 1197, "51_49": 1198, "30_5": 1199, "26_4": 1200, "46_3": 1201, "3_2": 1202, "11_19": 1203, "23_47": 1204, "21_3": 1205, "51_3": 1206, "3_27": 1207, "26_9": 1208, "27_49": 1209, "4_8": 1210, "3_7": 1211, "12_21": 1212, "2_25": 1213, "29_36": 1214, "29_8": 1215, "49_34": 1216, "47_29": 1217, "13_4": 1218, "7_37": 1219, "4_39": 1220, "16_5": 1221, "30_11": 1222, "45_39": 1223, "18_16": 1224, "45_12": 1225, "36_41": 1226, "3_26": 1227, "30_9": 1228, "10_35": 1229, "40_47": 1230, "51_14": 1231, "19_8": 1232, "46_4": 1233, "44_30": 1234, "4_6": 1235, "20_35": 1236, "39_26": 1237, "21_28": 1238, "41_46": 1239, "34_21": 1240, "5_9": 1241, "7_12": 1242, "13_24": 1243, "17_15": 1244, "51_13": 1245, "35_49": 1246, "38_29": 1247, "17_46": 1248, "50_50": 1249, "21_16": 1250, "37_46": 1251, "19_13": 1252, "31_39": 1253, "4_24": 1254, "49_46": 1255, "35_31": 1256, "51_21": 1257, "51_25": 1258, "14_46": 1259, "40_36": 1260, "10_24": 1261, "9_16": 1262, "10_2": 1263, "4_15": 1264, "24_9": 1265, "13_36": 1266, "45_28": 1267, "44_21": 1268, "33_27": 1269, "26_17": 1270, "4_45": 1271, "3_44": 1272, "33_15": 1273, "13_39": 1274, "3_11": 1275, "22_41": 1276, "9_6": 1277, "35_30": 1278, "28_46": 1279, "46_13": 1280, "35_13": 1281, "44_7": 1282, "10_26": 1283, "46_6": 1284, "3_6": 1285, "4_27": 1286, "37_44": 1287, "12_14": 1288, "35_16": 1289, "29_21": 1290, "44_11": 1291, "13_27": 1292, "35_12": 1293, "34_10": 1294, "51_30": 1295, "15_7": 1296, "7_15": 1297, "51_31": 1298, "27_44": 1299, "44_3": 1300, "20_13": 1301, "51_35": 1302, "5_3": 1303, "25_26": 1304, "48_21": 1305, "20_45": 1306, "9_2": 1307, "11_10": 1308, "47_13": 1309, "3_8": 1310, "10_21": 1311, "25_34": 1312, "9_13": 1313, "13_35": 1314, "16_19": 1315, "17_28": 1316, "8_3": 1317, "39_30": 1318, "10_18": 1319, "38_16": 1320, "8_15": 1321, "42_3": 1322, "28_25": 1323, "45_27": 1324, "36_13": 1325, "25_3": 1326, "47_27": 1327, "48_42": 1328, "30_43": 1329, "14_8": 1330, "4_12": 1331, "28_5": 1332, "3_13": 1333, "17_33": 1334, "43_30": 1335, "4_5": 1336, "25_19": 1337, "37_6": 1338, "49_29": 1339, "29_26": 1340, "39_17": 1341, "50_26": 1342, "9_21": 1343, "10_42": 1344, "15_44": 1345, "23_19": 1346, "45_3": 1347, "35_9": 1348, "37_3": 1349, "18_35": 1350, "25_7": 1351, "28_45": 1352, "11_21": 1353, "15_27": 1354, "41_21": 1355, "6_3": 1356, "24_26": 1357, "47_44": 1358, "6_12": 1359, "9_29": 1360, "8_11": 1361, "30_44": 1362, "45_9": 1363, "36_27": 1364, "45_40": 1365, "7_28": 1366, "27_28": 1367, "33_3": 1368, "35_50": 1369, "23_25": 1370, "35_17": 1371, "18_7": 1372, "50_21": 1373, "42_11": 1374, "40_44": 1375, "12_9": 1376, "45_41": 1377, "49_4": 1378, "39_9": 1379, "26_29": 1380, "15_21": 1381, "48_30": 1382, "7_51": 1383, "25_32": 1384, "5_40": 1385, "33_13": 1386, "24_6": 1387, "2_38": 1388, "46_35": 1389, "34_3": 1390, "6_16": 1391, "23_34": 1392, "14_23": 1393, "10_3": 1394, "29_28": 1395, "30_35": 1396, "30_34": 1397, "19_21": 1398, "4_46": 1399, "38_36": 1400, "22_2": 1401, "30_32": 1402, "40_35": 1403, "33_42": 1404, "29_30": 1405, "4_31": 1406, "4_25": 1407, "24_39": 1408, "29_18": 1409, "51_16": 1410, "29_17": 1411, "5_4": 1412, "17_7": 1413, "15_20": 1414, "40_21": 1415, "48_5": 1416, "31_26": 1417, "48_12": 1418, "24_11": 1419, "9_44": 1420, "11_5": 1421, "27_25": 1422, "37_40": 1423, "13_6": 1424, "20_3": 1425, "26_8": 1426, "22_15": 1427, "18_43": 1428, "13_40": 1429, "8_6": 1430, "8_30": 1431, "7_13": 1432, "5_36": 1433, "27_24": 1434, "38_11": 1435, "4_21": 1436, "45_15": 1437, "48_38": 1438, "37_15": 1439, "6_44": 1440, "11_30": 1441, "22_51": 1442, "28_15": 1443, "39_3": 1444, "3_19": 1445, "16_51": 1446, "5_16": 1447, "11_3": 1448, "48_9": 1449, "17_45": 1450, "12_11": 1451, "24_43": 1452, "9_37": 1453, "3_41": 1454, "3_20": 1455, "14_9": 1456, "47_16": 1457, "26_21": 1458, "51_39": 1459, "7_36": 1460, "20_21": 1461, "13_9": 1462, "41_44": 1463, "27_40": 1464, "21_30": 1465, "27_6": 1466, "35_25": 1467, "10_51": 1468, "40_15": 1469, "17_6": 1470, "39_34": 1471, "9_22": 1472, "24_18": 1473, "14_12": 1474, "41_10": 1475, "10_9": 1476, "39_45": 1477, "23_12": 1478, "29_50": 1479, "9_15": 1480, "18_13": 1481, "26_6": 1482, "36_32": 1483, "33_44": 1484, "35_40": 1485, "11_14": 1486, "2_5": 1487, "2_45": 1488, "3_17": 1489, "39_51": 1490, "20_39": 1491, "20_46": 1492, "39_27": 1493, "12_31": 1494, "8_9": 1495, "6_23": 1496, "4_13": 1497, "33_51": 1498, "12_6": 1499, "38_18": 1500, "9_46": 1501, "6_27": 1502, "8_16": 1503, "16_46": 1504, "20_44": 1505, "44_36": 1506, "29_27": 1507, "27_3": 1508, "38_48": 1509, "9_12": 1510, "50_51": 1511, "46_39": 1512, "28_27": 1513, "29_9": 1514, "3_33": 1515, "15_8": 1516, "40_30": 1517, "44_32": 1518, "3_39": 1519, "17_9": 1520, "17_10": 1521, "33_11": 1522, "3_51": 1523, "29_37": 1524, "40_18": 1525, "48_13": 1526, "21_23": 1527, "48_8": 1528, "3_9": 1529, "47_17": 1530, "50_6": 1531, "51_17": 1532, "28_3": 1533, "32_18": 1534, "15_45": 1535, "48_6": 1536, "14_35": 1537, "51_40": 1538, "42_9": 1539, "17_27": 1540, "24_34": 1541, "32_13": 1542, "10_38": 1543, "49_51": 1544, "9_4": 1545, "24_28": 1546, "25_48": 1547, "11_51": 1548, "44_35": 1549, "39_10": 1550, "10_40": 1551, "13_32": 1552, "7_25": 1553, "14_3": 1554, "12_40": 1555, "35_5": 1556, "28_9": 1557, "22_22": 1558, "14_39": 1559, "9_45": 1560, "8_26": 1561, "6_19": 1562, "50_46": 1563, "35_38": 1564, "34_43": 1565, "12_43": 1566, "15_13": 1567, "35_51": 1568, "23_3": 1569, "23_26": 1570, "39_28": 1571, "7_44": 1572, "41_51": 1573, "14_21": 1574, "9_49": 1575, "47_39": 1576, "33_5": 1577, "33_45": 1578, "11_2": 1579, "42_19": 1580, "26_34": 1581, "25_21": 1582, "39_41": 1583, "38_47": 1584, "26_15": 1585, "19_44": 1586, "15_28": 1587, "38_9": 1588, "44_15": 1589, "6_15": 1590, "9_50": 1591, "35_14": 1592, "51_27": 1593, "14_50": 1594, "31_10": 1595, "6_24": 1596, "40_9": 1597, "10_44": 1598, "51_32": 1599, "45_7": 1600, "11_13": 1601, "28_48": 1602, "30_31": 1603, "11_25": 1604, "5_23": 1605, "19_25": 1606, "9_40": 1607, "9_14": 1608, "46_20": 1609, "41_25": 1610, "47_12": 1611, "20_40": 1612, "50_29": 1613, "26_5": 1614, "35_10": 1615, "27_9": 1616, "46_16": 1617, "23_50": 1618, "24_37": 1619, "3_49": 1620, "11_33": 1621, "47_25": 1622, "9_28": 1623, "16_2": 1624, "34_39": 1625, "4_48": 1626, "15_26": 1627, "5_35": 1628, "20_41": 1629, "30_13": 1630, "10_30": 1631, "6_5": 1632, "7_11": 1633, "37_32": 1634, "9_27": 1635, "15_17": 1636, "29_11": 1637, "50_3": 1638, "16_30": 1639, "16_47": 1640, "32_15": 1641, "11_7": 1642, "38_35": 1643, "33_20": 1644, "9_32": 1645, "2_18": 1646, "39_2": 1647, "28_7": 1648, "29_39": 1649, "2_6": 1650, "11_17": 1651, "23_11": 1652, "43_11": 1653, "26_44": 1654, "44_16": 1655, "48_51": 1656, "3_30": 1657, "2_10": 1658, "28_20": 1659, "40_3": 1660, "42_39": 1661, "9_5": 1662, "11_32": 1663, "2_27": 1664, "33_41": 1665, "9_8": 1666, "19_10": 1667, "17_12": 1668, "4_38": 1669, "51_28": 1670, "48_18": 1671, "4_33": 1672, "41_3": 1673, "15_3": 1674, "44_23": 1675, "50_30": 1676, "43_12": 1677, "24_14": 1678, "33_25": 1679, "39_20": 1680, "35_3": 1681, "51_20": 1682, "44_26": 1683, "43_8": 1684, "11_9": 1685, "8_31": 1686, "5_32": 1687, "7_3": 1688, "43_37": 1689, "13_43": 1690, "10_39": 1691, "20_28": 1692, "27_10": 1693, "31_35": 1694, "22_9": 1695, "4_41": 1696, "23_13": 1697, "40_25": 1698, "43_3": 1699, "17_3": 1700, "22_3": 1701, "24_12": 1702, "9_20": 1703, "19_38": 1704, "23_40": 1705, "19_41": 1706, "48_46": 1707, "40_12": 1708, "11_35": 1709, "50_44": 1710, "43_13": 1711, "23_5": 1712, "10_12": 1713, "34_42": 1714, "24_17": 1715, "47_46": 1716, "40_8": 1717, "16_18": 1718, "2_46": 1719, "24_30": 1720, "41_20": 1721, "6_2": 1722, "40_26": 1723, "41_39": 1724, "9_34": 1725, "42_45": 1726, "47_18": 1727, "41_9": 1728, "2_12": 1729, "24_36": 1730, "28_40": 1731, "49_11": 1732, "34_23": 1733, "10_50": 1734, "42_24": 1735, "7_4": 1736, "31_32": 1737, "27_21": 1738, "38_2": 1739, "41_27": 1740, "42_48": 1741, "32_44": 1742, "25_35": 1743, "48_26": 1744, "4_7": 1745, "39_15": 1746, "3_48": 1747, "40_5": 1748, "34_33": 1749, "17_40": 1750, "19_12": 1751, "11_20": 1752, "18_32": 1753, "9_42": 1754, "23_9": 1755, "26_13": 1756, "29_41": 1757, "49_7": 1758, "6_17": 1759, "29_34": 1760, "24_25": 1761, "32_11": 1762, "24_31": 1763, "45_31": 1764, "27_45": 1765, "13_23": 1766, "27_31": 1767, "29_20": 1768, "39_19": 1769, "9_3": 1770, "16_29": 1771, "50_25": 1772, "40_38": 1773, "12_16": 1774, "10_13": 1775, "31_4": 1776, "39_14": 1777, "43_18": 1778, "21_15": 1779, "49_31": 1780, "43_15": 1781, "16_26": 1782, "51_50": 1783, "9_17": 1784, "50_37": 1785, "15_23": 1786, "48_15": 1787, "11_12": 1788, "40_29": 1789, "7_50": 1790, "49_50": 1791, "51_41": 1792, "19_3": 1793, "26_31": 1794, "39_40": 1795, "44_43": 1796, "6_18": 1797, "10_46": 1798, "19_45": 1799, "9_41": 1800, "22_14": 1801, "46_33": 1802, "21_22": 1803, "2_44": 1804, "2_37": 1805, "29_14": 1806, "24_33": 1807, "24_35": 1808, "25_22": 1809, "19_18": 1810, "46_22": 1811, "48_35": 1812, "47_51": 1813, "26_33": 1814, "47_37": 1815, "2_26": 1816, "21_33": 1817, "2_35": 1818, "45_22": 1819, "47_30": 1820, "2_17": 1821, "19_46": 1822, "29_31": 1823, "47_26": 1824, "2_28": 1825, "3_32": 1826, "8_10": 1827, "31_38": 1828, "22_49": 1829, "47_15": 1830, "6_28": 1831, "34_27": 1832, "12_22": 1833, "34_6": 1834, "34_41": 1835, "17_22": 1836, "34_45": 1837, "5_22": 1838, "24_40": 1839, "37_31": 1840, "2_51": 1841, "51_44": 1842, "19_37": 1843, "18_22": 1844, "27_22": 1845, "38_8": 1846, "34_28": 1847, "37_22": 1848, "8_22": 1849, "23_22": 1850, "2_4": 1851, "30_22": 1852, "2_30": 1853, "44_22": 1854, "19_20": 1855, "6_41": 1856, "5_31": 1857, "24_41": 1858, "29_35": 1859, "19_35": 1860, "34_17": 1861, "8_33": 1862, "51_5": 1863, "20_10": 1864, "19_26": 1865, "2_15": 1866, "50_31": 1867, "13_22": 1868, "19_15": 1869, "26_22": 1870, "4_42": 1871, "24_22": 1872, "48_20": 1873, "29_42": 1874, "38_6": 1875, "48_17": 1876, "19_4": 1877, "13_31": 1878, "19_30": 1879, "46_31": 1880, "19_28": 1881, "24_15": 1882, "21_31": 1883, "24_16": 1884, "48_23": 1885, "35_15": 1886, "12_50": 1887, "15_10": 1888, "19_27": 1889, "40_49": 1890, "18_31": 1891, "16_15": 1892, "48_10": 1893, "28_22": 1894, "19_17": 1895, "34_20": 1896, "4_22": 1897, "24_38": 1898, "19_51": 1899, "24_45": 1900, "48_27": 1901, "6_51": 1902, "34_11": 1903, "48_44": 1904, "24_49": 1905, "29_23": 1906, "25_31": 1907, "2_23": 1908, "24_44": 1909, "48_41": 1910, "2_20": 1911, "35_22": 1912, "12_33": 1913, "24_3": 1914, "11_41": 1915, "2_41": 1916, "6_30": 1917, "31_28": 1918, "46_23": 1919, "18_33": 1920, "48_45": 1921, "20_22": 1922, "6_20": 1923, "24_5": 1924, "44_31": 1925, "24_51": 1926, "33_31": 1927, "30_33": 1928, "50_34": 1929, "16_11": 1930, "24_23": 1931, "11_22": 1932, "48_37": 1933, "51_8": 1934, "24_20": 1935, "27_42": 1936, "47_24": 1937, "5_10": 1938, "2_3": 1939, "47_23": 1940, "34_49": 1941, "24_13": 1942, "29_38": 1943, "16_21": 1944, "39_31": 1945, "24_4": 1946, "24_10": 1947, "16_9": 1948, "27_33": 1949, "15_33": 1950, "41_22": 1951, "26_10": 1952, "6_46": 1953, "16_35": 1954, "11_44": 1955, "10_34": 1956, "21_10": 1957, "18_10": 1958, "33_17": 1959, "6_37": 1960, "29_49": 1961, "17_39": 1962, "26_50": 1963, "42_10": 1964, "19_23": 1965, "9_35": 1966, "40_45": 1967, "50_35": 1968, "25_23": 1969, "21_50": 1970, "32_25": 1971, "13_33": 1972, "16_6": 1973, "3_10": 1974, "2_22": 1975, "42_33": 1976, "20_15": 1977, "40_37": 1978, "15_22": 1979, "40_13": 1980, "24_27": 1981, "51_22": 1982, "9_48": 1983, "40_27": 1984, "51_10": 1985, "9_10": 1986, "6_26": 1987, "32_36": 1988, "44_33": 1989, "23_6": 1990, "51_33": 1991, "16_8": 1992, "6_50": 1993, "40_51": 1994, "48_25": 1995, "35_44": 1996, "40_10": 1997, "46_50": 1998, "43_34": 1999, "13_15": 2000, "3_23": 2001, "26_23": 2002, "5_33": 2003, "45_33": 2004, "50_9": 2005, "50_14": 2006, "10_31": 2007, "44_10": 2008, "48_28": 2009, "40_20": 2010, "50_23": 2011, "49_3": 2012, "48_4": 2013, "30_10": 2014, "32_37": 2015, "30_16": 2016, "15_32": 2017, "20_33": 2018, "32_9": 2019, "2_39": 2020, "11_23": 2021, "11_43": 2022, "16_44": 2023, "3_40": 2024, "39_42": 2025, "41_33": 2026, "38_4": 2027, "23_44": 2028, "30_50": 2029, "25_33": 2030, "32_5": 2031, "37_43": 2032, "3_43": 2033, "3_22": 2034, "38_19": 2035, "40_23": 2036, "44_50": 2037, "12_10": 2038, "42_34": 2039, "45_42": 2040, "40_28": 2041, "11_49": 2042, "50_10": 2043, "24_42": 2044, "32_31": 2045, "27_41": 2046, "48_3": 2047, "33_34": 2048, "40_17": 2049, "9_23": 2050, "7_49": 2051, "31_45": 2052, "31_27": 2053, "19_39": 2054, "29_16": 2055, "25_50": 2056, "38_40": 2057, "16_12": 2058, "13_10": 2059, "0_0": 2060, "1_1": 2061, "14_14": 2062, "49_49": 2063}