{"PAD": 0, "DUMMY_START_RELATION": 1, "NO_OP": 2, "UNK": 3, "/location/country/form_of_government": 4, "/tv/tv_program/regular_cast./tv/regular_tv_appearance/actor": 5, "/media_common/netflix_genre/titles": 6, "/award/award_winner/awards_won./award/award_honor/award_winner": 7, "/soccer/football_team/current_roster./sports/sports_team_roster/position": 8, "/soccer/football_team/current_roster./soccer/football_roster_position/position": 9, "/film/actor/film./film/performance/film": 10, "/award/award_category/nominees./award/award_nomination/nominated_for": 11, "/award/award_nominee/award_nominations./award/award_nomination/award_nominee": 12, "/music/performance_role/regular_performances./music/group_membership/role": 13, "/award/award_category/winners./award/award_honor/ceremony": 14, "/film/film/release_date_s./film/film_regional_release_date/film_release_distribution_medium": 15, "/award/award_winning_work/awards_won./award/award_honor/award_winner": 16, "/film/film/release_date_s./film/film_regional_release_date/film_release_region": 17, "/film/film/language": 18, "/location/location/contains": 19, "/organization/organization/headquarters./location/mailing_address/country": 20, "/people/person/profession": 21, "/location/statistical_region/religions./location/religion_percentage/religion": 22, "/award/award_nominee/award_nominations./award/award_nomination/award": 23, "/music/genre/artists": 24, "/influence/influence_node/influenced_by": 25, "/education/educational_institution/students_graduates./education/education/student": 26, "/organization/organization_member/member_of./organization/organization_membership/organization": 27, "/people/person/place_of_birth": 28, "/common/topic/webpage./common/webpage/category": 29, "/film/film/other_crew./film/film_crew_gig/film_crew_role": 30, "/award/award_ceremony/awards_presented./award/award_honor/award_winner": 31, "/film/film/country": 32, "/olympics/olympic_sport/athletes./olympics/olympic_athlete_affiliation/country": 33, "/award/award_winning_work/awards_won./award/award_honor/award": 34, "/film/film/genre": 35, "/film/film_distributor/films_distributed./film/film_film_distributor_relationship/film": 36, "/location/statistical_region/rent50_2./measurement_unit/dated_money_value/currency": 37, "/film/film/estimated_budget./measurement_unit/dated_money_value/currency": 38, "/government/legislative_session/members./government/government_position_held/district_represented": 39, "/sports/sports_team/roster./american_football/football_historical_roster_position/position_s": 40, "/government/government_office_category/officeholders./government/government_position_held/jurisdiction_of_office": 41, "/award/award_nominee/award_nominations./award/award_nomination/nominated_for": 42, "/people/deceased_person/place_of_death": 43, "/sports/pro_athlete/teams./sports/sports_team_roster/team": 44, "/music/artist/track_contributions./music/track_contribution/role": 45, "/music/instrument/instrumentalists": 46, "/people/person/gender": 47, "/business/job_title/people_with_this_title./business/employment_tenure/company": 48, "/base/popstra/celebrity/friendship./base/popstra/friendship/participant": 49, "/business/business_operation/industry": 50, "/award/award_category/winners./award/award_honor/award_winner": 51, "/people/person/nationality": 52, "/sports/sports_team/roster./baseball/baseball_roster_position/position": 53, "/people/cause_of_death/people": 54, "/tv/tv_program/languages": 55, "/music/genre/parent_genre": 56, "/base/popstra/celebrity/breakup./base/popstra/breakup/participant": 57, "/location/country/capital": 58, "/film/special_film_performance_type/film_performance_type./film/performance/film": 59, "/location/hud_county_place/place": 60, "/music/performance_role/guest_performances./music/recording_contribution/performance_role": 61, "/location/location/adjoin_s./location/adjoining_relationship/adjoins": 62, "/film/film_subject/films": 63, "/base/schemastaging/person_extra/net_worth./measurement_unit/dated_money_value/currency": 64, "/education/educational_institution/colors": 65, "/base/aareas/schema/administrative_area/administrative_parent": 66, "/organization/role/leaders./organization/leadership/organization": 67, "/government/legislative_session/members./government/government_position_held/legislative_sessions": 68, "/olympics/olympic_games/sports": 69, "/people/person/places_lived./people/place_lived/location": 70, "/award/award_category/disciplines_or_subjects": 71, "/sports/professional_sports_team/draft_picks./sports/sports_league_draft_pick/school": 72, "/olympics/olympic_participating_country/medals_won./olympics/olympic_medal_honor/olympics": 73, "/language/human_language/countries_spoken_in": 74, "/people/ethnicity/people": 75, "/olympics/olympic_participating_country/athletes./olympics/olympic_athlete_affiliation/olympics": 76, "/olympics/olympic_participating_country/medals_won./olympics/olympic_medal_honor/medal": 77, "/film/film/other_crew./film/film_crew_gig/crewmember": 78, "/music/performance_role/track_performances./music/track_contribution/role": 79, "/music/record_label/artist": 80, "/base/popstra/celebrity/dated./base/popstra/dated/participant": 81, "/base/locations/continents/countries_within": 82, "/sports/sports_league_draft/picks./sports/sports_league_draft_pick/school": 83, "/sports/sports_team/sport": 84, "/education/educational_institution_campus/educational_institution": 85, "/people/person/religion": 86, "/organization/organization/headquarters./location/mailing_address/citytown": 87, "/film/film/produced_by": 88, "/people/person/spouse_s./people/marriage/type_of_union": 89, "/film/film/production_companies": 90, "/location/country/second_level_divisions": 91, "/base/culturalevent/event/entity_involved": 92, "/education/educational_degree/people_with_this_degree./education/education/institution": 93, "/film/film/distributors./film/film_film_distributor_relationship/film_distribution_medium": 94, "/tv/tv_program/tv_producer./tv/tv_producer_term/producer_type": 95, "/music/performance_role/regular_performances./music/group_membership/group": 96, "/government/politician/government_positions_held./government/government_position_held/legislative_sessions": 97, "/sports/sports_team_location/teams": 98, "/sports/sports_team/colors": 99, "/sports/professional_sports_team/draft_picks./sports/sports_league_draft_pick/draft": 100, "/award/award_nominated_work/award_nominations./award/award_nomination/nominated_for": 101, "/baseball/baseball_team/team_stats./baseball/baseball_team_stats/season": 102, "/user/alexander/philosophy/philosopher/interests": 103, "/people/person/languages": 104, "/education/educational_institution/students_graduates./education/education/major_field_of_study": 105, "/film/director/film": 106, "/award/award_ceremony/awards_presented./award/award_honor/honored_for": 107, "/olympics/olympic_sport/athletes./olympics/olympic_athlete_affiliation/olympics": 108, "/film/film/costume_design_by": 109, "/film/film/featured_film_locations": 110, "/tv/tv_program/genre": 111, "/organization/endowed_organization/endowment./measurement_unit/dated_money_value/currency": 112, "/film/film/written_by": 113, "/tv/tv_producer/programs_produced./tv/tv_producer_term/producer_type": 114, "/location/hud_county_place/county": 115, "/education/educational_degree/people_with_this_degree./education/education/major_field_of_study": 116, "/base/schemastaging/organization_extra/phone_number./base/schemastaging/phone_sandbox/contact_category": 117, "/base/saturdaynightlive/snl_cast_member/seasons./base/saturdaynightlive/snl_season_tenure/cast_members": 118, "/film/film/film_format": 119, "/film/film/music": 120, "/sports/sports_team/roster./american_football/football_roster_position/position": 121, "/user/tsegaran/random/taxonomy_subject/entry./user/tsegaran/random/taxonomy_entry/taxonomy": 122, "/celebrities/celebrity/celebrity_friends./celebrities/friendship/friend": 123, "/location/hud_foreclosure_area/estimated_number_of_mortgages./measurement_unit/dated_integer/source": 124, "/base/x2010fifaworldcupsouthafrica/world_cup_squad/current_world_cup_squad./base/x2010fifaworldcupsouthafrica/current_world_cup_squad/current_club": 125, "/base/popstra/location/vacationers./base/popstra/vacation_choice/vacationer": 126, "/base/popstra/celebrity/canoodled./base/popstra/canoodled/participant": 127, "/education/educational_institution/school_type": 128, "/sports/sport/pro_athletes./sports/pro_sports_played/athlete": 129, "/award/hall_of_fame/inductees./award/hall_of_fame_induction/inductee": 130, "/base/biblioness/bibs_location/state": 131, "/education/university/local_tuition./measurement_unit/dated_money_value/currency": 132, "/business/business_operation/revenue./measurement_unit/dated_money_value/currency": 133, "/sports/sports_position/players./sports/sports_team_roster/team": 134, "/military/military_conflict/combatants./military/military_combatant_group/combatants": 135, "/sports/sports_league/teams./sports/sports_league_participation/team": 136, "/base/biblioness/bibs_location/country": 137, "/music/group_member/membership./music/group_membership/role": 138, "/location/administrative_division/country": 139, "/film/film/executive_produced_by": 140, "/food/food/nutrients./food/nutrition_fact/nutrient": 141, "/music/group_member/membership./music/group_membership/group": 142, "/location/statistical_region/gdp_nominal_per_capita./measurement_unit/dated_money_value/currency": 143, "/education/field_of_study/students_majoring./education/education/student": 144, "/award/award_winning_work/awards_won./award/award_honor/honored_for": 145, "/sports/sports_team/roster./basketball/basketball_roster_position/position": 146, "/organization/organization/headquarters./location/mailing_address/state_province_region": 147, "/base/aareas/schema/administrative_area/capital": 148, "/tv/tv_producer/programs_produced./tv/tv_producer_term/program": 149, "/education/educational_institution/campuses": 150, "/film/film/distributors./film/film_film_distributor_relationship/region": 151, "/travel/travel_destination/climate./travel/travel_destination_monthly_climate/month": 152, "/medicine/disease/notable_people_with_this_condition": 153, "/base/schemastaging/organization_extra/phone_number./base/schemastaging/phone_sandbox/service_location": 154, "/people/ethnicity/geographic_distribution": 155, "/military/military_combatant/military_conflicts./military/military_combatant_group/combatants": 156, "/film/film/personal_appearances./film/personal_film_appearance/person": 157, "/location/location/time_zones": 158, "/film/film/story_by": 159, "/base/petbreeds/city_with_dogs/top_breeds./base/petbreeds/dog_city_relationship/dog_breed": 160, "/olympics/olympic_games/participating_countries": 161, "/tv/tv_network/programs./tv/tv_network_duration/program": 162, "/people/person/employment_history./business/employment_tenure/company": 163, "/music/artist/origin": 164, "/people/marriage_union_type/unions_of_this_type./people/marriage/location_of_ceremony": 165, "/tv/tv_writer/tv_programs./tv/tv_program_writer_relationship/tv_program": 166, "/time/event/locations": 167, "/celebrities/celebrity/sexual_relationships./celebrities/romantic_relationship/celebrity": 168, "/government/political_party/politicians_in_this_party./government/political_party_tenure/politician": 169, "/education/university/domestic_tuition./measurement_unit/dated_money_value/currency": 170, "/organization/non_profit_organization/registered_with./organization/non_profit_registration/registering_agency": 171, "/user/ktrueman/default_domain/international_organization/member_states": 172, "/american_football/football_team/current_roster./sports/sports_team_roster/position": 173, "/soccer/football_player/current_team./sports/sports_team_roster/team": 174, "/olympics/olympic_games/medals_awarded./olympics/olympic_medal_honor/medal": 175, "/award/ranked_item/appears_in_ranked_lists./award/ranking/list": 176, "/film/film_set_designer/film_sets_designed": 177, "/user/jg/default_domain/olympic_games/sports": 178, "/people/person/sibling_s./people/sibling_relationship/sibling": 179, "/base/marchmadness/ncaa_basketball_tournament/seeds./base/marchmadness/ncaa_tournament_seed/team": 180, "/music/artist/contribution./music/recording_contribution/performance_role": 181, "/sports/sports_position/players./sports/sports_team_roster/position": 182, "/government/politician/government_positions_held./government/government_position_held/basic_title": 183, "/sports/sports_position/players./american_football/football_historical_roster_position/position_s": 184, "/people/profession/specialization_of": 185, "/award/award_category/category_of": 186, "/film/film/cinematography": 187, "/film/film/film_production_design_by": 188, "/tv/tv_program/country_of_origin": 189, "/film/film/edited_by": 190, "/tv/tv_personality/tv_regular_appearances./tv/tv_regular_personal_appearance/program": 191, "/education/field_of_study/students_majoring./education/education/major_field_of_study": 192, "/education/educational_degree/people_with_this_degree./education/education/student": 193, "/location/us_county/county_seat": 194, "/film/film/film_festivals": 195, "/people/person/spouse_s./people/marriage/spouse": 196, "/film/film/runtime./film/film_cut/film_release_region": 197, "/location/capital_of_administrative_division/capital_of./location/administrative_division_capital_relationship/administrative_division": 198, "/base/aareas/schema/administrative_area/administrative_area_type": 199, "/influence/influence_node/peers./influence/peer_relationship/peers": 200, "/government/governmental_body/members./government/government_position_held/legislative_sessions": 201, "/base/schemastaging/organization_extra/phone_number./base/schemastaging/phone_sandbox/service_language": 202, "/organization/organization/place_founded": 203, "/base/eating/practicer_of_diet/diet": 204, "/tv/tv_program/program_creator": 205, "/people/deceased_person/place_of_burial": 206, "/film/film/release_date_s./film/film_regional_release_date/film_regional_debut_venue": 207, "/ice_hockey/hockey_team/current_roster./sports/sports_team_roster/position": 208, "/location/administrative_division/first_level_division_of": 209, "/location/statistical_region/gdp_real./measurement_unit/adjusted_money_value/adjustment_currency": 210, "/organization/organization/child./organization/organization_relationship/child": 211, "/business/business_operation/assets./measurement_unit/dated_money_value/currency": 212, "/film/person_or_entity_appearing_in_film/films./film/personal_film_appearance/type_of_appearance": 213, "/time/event/instance_of_recurring_event": 214, "/tv/non_character_role/tv_regular_personal_appearances./tv/tv_regular_personal_appearance/person": 215, "/film/actor/film./film/performance/special_performance_type": 216, "/business/business_operation/operating_income./measurement_unit/dated_money_value/currency": 217, "/people/ethnicity/languages_spoken": 218, "/base/americancomedy/celebrity_impressionist/celebrities_impersonated": 219, "/medicine/symptom/symptom_of": 220, "/education/university/fraternities_and_sororities": 221, "/location/statistical_region/places_exported_to./location/imports_and_exports/exported_to": 222, "/location/statistical_region/gdp_nominal./measurement_unit/dated_money_value/currency": 223, "/travel/travel_destination/how_to_get_here./travel/transportation/mode_of_transportation": 224, "/location/country/official_language": 225, "/location/location/partially_contains": 226, "/film/film/film_art_direction_by": 227, "/people/person/spouse_s./people/marriage/location_of_ceremony": 228, "/education/university/international_tuition./measurement_unit/dated_money_value/currency": 229, "/organization/organization_founder/organizations_founded": 230, "/film/film/dubbing_performances./film/dubbing_performance/actor": 231, "/dataworld/gardening_hint/split_to": 232, "/medicine/disease/risk_factors": 233, "/film/film/prequel": 234, "/base/localfood/seasonal_month/produce_available./base/localfood/produce_availability/seasonal_months": 235, "/film/actor/dubbing_performances./film/dubbing_performance/language": 236, "/broadcast/content/artist": 237, "/location/statistical_region/gni_per_capita_in_ppp_dollars./measurement_unit/dated_money_value/currency": 238, "/music/instrument/family": 239, "/government/politician/government_positions_held./government/government_position_held/jurisdiction_of_office": 240, "_/location/country/form_of_government": 241, "_/tv/tv_program/regular_cast./tv/regular_tv_appearance/actor": 242, "_/media_common/netflix_genre/titles": 243, "_/award/award_winner/awards_won./award/award_honor/award_winner": 244, "_/soccer/football_team/current_roster./sports/sports_team_roster/position": 245, "_/soccer/football_team/current_roster./soccer/football_roster_position/position": 246, "_/film/actor/film./film/performance/film": 247, "_/award/award_category/nominees./award/award_nomination/nominated_for": 248, "_/award/award_nominee/award_nominations./award/award_nomination/award_nominee": 249, "_/music/performance_role/regular_performances./music/group_membership/role": 250, "_/award/award_category/winners./award/award_honor/ceremony": 251, "_/film/film/release_date_s./film/film_regional_release_date/film_release_distribution_medium": 252, "_/award/award_winning_work/awards_won./award/award_honor/award_winner": 253, "_/film/film/release_date_s./film/film_regional_release_date/film_release_region": 254, "_/film/film/language": 255, "_/location/location/contains": 256, "_/organization/organization/headquarters./location/mailing_address/country": 257, "_/people/person/profession": 258, "_/location/statistical_region/religions./location/religion_percentage/religion": 259, "_/award/award_nominee/award_nominations./award/award_nomination/award": 260, "_/music/genre/artists": 261, "_/influence/influence_node/influenced_by": 262, "_/education/educational_institution/students_graduates./education/education/student": 263, "_/organization/organization_member/member_of./organization/organization_membership/organization": 264, "_/people/person/place_of_birth": 265, "_/common/topic/webpage./common/webpage/category": 266, "_/film/film/other_crew./film/film_crew_gig/film_crew_role": 267, "_/award/award_ceremony/awards_presented./award/award_honor/award_winner": 268, "_/film/film/country": 269, "_/olympics/olympic_sport/athletes./olympics/olympic_athlete_affiliation/country": 270, "_/award/award_winning_work/awards_won./award/award_honor/award": 271, "_/film/film/genre": 272, "_/film/film_distributor/films_distributed./film/film_film_distributor_relationship/film": 273, "_/location/statistical_region/rent50_2./measurement_unit/dated_money_value/currency": 274, "_/film/film/estimated_budget./measurement_unit/dated_money_value/currency": 275, "_/government/legislative_session/members./government/government_position_held/district_represented": 276, "_/sports/sports_team/roster./american_football/football_historical_roster_position/position_s": 277, "_/government/government_office_category/officeholders./government/government_position_held/jurisdiction_of_office": 278, "_/award/award_nominee/award_nominations./award/award_nomination/nominated_for": 279, "_/people/deceased_person/place_of_death": 280, "_/sports/pro_athlete/teams./sports/sports_team_roster/team": 281, "_/music/artist/track_contributions./music/track_contribution/role": 282, "_/music/instrument/instrumentalists": 283, "_/people/person/gender": 284, "_/business/job_title/people_with_this_title./business/employment_tenure/company": 285, "_/base/popstra/celebrity/friendship./base/popstra/friendship/participant": 286, "_/business/business_operation/industry": 287, "_/award/award_category/winners./award/award_honor/award_winner": 288, "_/people/person/nationality": 289, "_/sports/sports_team/roster./baseball/baseball_roster_position/position": 290, "_/people/cause_of_death/people": 291, "_/tv/tv_program/languages": 292, "_/music/genre/parent_genre": 293, "_/base/popstra/celebrity/breakup./base/popstra/breakup/participant": 294, "_/location/country/capital": 295, "_/film/special_film_performance_type/film_performance_type./film/performance/film": 296, "_/location/hud_county_place/place": 297, "_/music/performance_role/guest_performances./music/recording_contribution/performance_role": 298, "_/location/location/adjoin_s./location/adjoining_relationship/adjoins": 299, "_/film/film_subject/films": 300, "_/base/schemastaging/person_extra/net_worth./measurement_unit/dated_money_value/currency": 301, "_/education/educational_institution/colors": 302, "_/base/aareas/schema/administrative_area/administrative_parent": 303, "_/organization/role/leaders./organization/leadership/organization": 304, "_/government/legislative_session/members./government/government_position_held/legislative_sessions": 305, "_/olympics/olympic_games/sports": 306, "_/people/person/places_lived./people/place_lived/location": 307, "_/award/award_category/disciplines_or_subjects": 308, "_/sports/professional_sports_team/draft_picks./sports/sports_league_draft_pick/school": 309, "_/olympics/olympic_participating_country/medals_won./olympics/olympic_medal_honor/olympics": 310, "_/language/human_language/countries_spoken_in": 311, "_/people/ethnicity/people": 312, "_/olympics/olympic_participating_country/athletes./olympics/olympic_athlete_affiliation/olympics": 313, "_/olympics/olympic_participating_country/medals_won./olympics/olympic_medal_honor/medal": 314, "_/film/film/other_crew./film/film_crew_gig/crewmember": 315, "_/music/performance_role/track_performances./music/track_contribution/role": 316, "_/music/record_label/artist": 317, "_/base/popstra/celebrity/dated./base/popstra/dated/participant": 318, "_/base/locations/continents/countries_within": 319, "_/sports/sports_league_draft/picks./sports/sports_league_draft_pick/school": 320, "_/sports/sports_team/sport": 321, "_/education/educational_institution_campus/educational_institution": 322, "_/people/person/religion": 323, "_/organization/organization/headquarters./location/mailing_address/citytown": 324, "_/film/film/produced_by": 325, "_/people/person/spouse_s./people/marriage/type_of_union": 326, "_/film/film/production_companies": 327, "_/location/country/second_level_divisions": 328, "_/base/culturalevent/event/entity_involved": 329, "_/education/educational_degree/people_with_this_degree./education/education/institution": 330, "_/film/film/distributors./film/film_film_distributor_relationship/film_distribution_medium": 331, "_/tv/tv_program/tv_producer./tv/tv_producer_term/producer_type": 332, "_/music/performance_role/regular_performances./music/group_membership/group": 333, "_/government/politician/government_positions_held./government/government_position_held/legislative_sessions": 334, "_/sports/sports_team_location/teams": 335, "_/sports/sports_team/colors": 336, "_/sports/professional_sports_team/draft_picks./sports/sports_league_draft_pick/draft": 337, "_/award/award_nominated_work/award_nominations./award/award_nomination/nominated_for": 338, "_/baseball/baseball_team/team_stats./baseball/baseball_team_stats/season": 339, "_/user/alexander/philosophy/philosopher/interests": 340, "_/people/person/languages": 341, "_/education/educational_institution/students_graduates./education/education/major_field_of_study": 342, "_/film/director/film": 343, "_/award/award_ceremony/awards_presented./award/award_honor/honored_for": 344, "_/olympics/olympic_sport/athletes./olympics/olympic_athlete_affiliation/olympics": 345, "_/film/film/costume_design_by": 346, "_/film/film/featured_film_locations": 347, "_/tv/tv_program/genre": 348, "_/organization/endowed_organization/endowment./measurement_unit/dated_money_value/currency": 349, "_/film/film/written_by": 350, "_/tv/tv_producer/programs_produced./tv/tv_producer_term/producer_type": 351, "_/location/hud_county_place/county": 352, "_/education/educational_degree/people_with_this_degree./education/education/major_field_of_study": 353, "_/base/schemastaging/organization_extra/phone_number./base/schemastaging/phone_sandbox/contact_category": 354, "_/base/saturdaynightlive/snl_cast_member/seasons./base/saturdaynightlive/snl_season_tenure/cast_members": 355, "_/film/film/film_format": 356, "_/film/film/music": 357, "_/sports/sports_team/roster./american_football/football_roster_position/position": 358, "_/user/tsegaran/random/taxonomy_subject/entry./user/tsegaran/random/taxonomy_entry/taxonomy": 359, "_/celebrities/celebrity/celebrity_friends./celebrities/friendship/friend": 360, "_/location/hud_foreclosure_area/estimated_number_of_mortgages./measurement_unit/dated_integer/source": 361, "_/base/x2010fifaworldcupsouthafrica/world_cup_squad/current_world_cup_squad./base/x2010fifaworldcupsouthafrica/current_world_cup_squad/current_club": 362, "_/base/popstra/location/vacationers./base/popstra/vacation_choice/vacationer": 363, "_/base/popstra/celebrity/canoodled./base/popstra/canoodled/participant": 364, "_/education/educational_institution/school_type": 365, "_/sports/sport/pro_athletes./sports/pro_sports_played/athlete": 366, "_/award/hall_of_fame/inductees./award/hall_of_fame_induction/inductee": 367, "_/base/biblioness/bibs_location/state": 368, "_/education/university/local_tuition./measurement_unit/dated_money_value/currency": 369, "_/business/business_operation/revenue./measurement_unit/dated_money_value/currency": 370, "_/sports/sports_position/players./sports/sports_team_roster/team": 371, "_/military/military_conflict/combatants./military/military_combatant_group/combatants": 372, "_/sports/sports_league/teams./sports/sports_league_participation/team": 373, "_/base/biblioness/bibs_location/country": 374, "_/music/group_member/membership./music/group_membership/role": 375, "_/location/administrative_division/country": 376, "_/film/film/executive_produced_by": 377, "_/food/food/nutrients./food/nutrition_fact/nutrient": 378, "_/music/group_member/membership./music/group_membership/group": 379, "_/location/statistical_region/gdp_nominal_per_capita./measurement_unit/dated_money_value/currency": 380, "_/education/field_of_study/students_majoring./education/education/student": 381, "_/award/award_winning_work/awards_won./award/award_honor/honored_for": 382, "_/sports/sports_team/roster./basketball/basketball_roster_position/position": 383, "_/organization/organization/headquarters./location/mailing_address/state_province_region": 384, "_/base/aareas/schema/administrative_area/capital": 385, "_/tv/tv_producer/programs_produced./tv/tv_producer_term/program": 386, "_/education/educational_institution/campuses": 387, "_/film/film/distributors./film/film_film_distributor_relationship/region": 388, "_/travel/travel_destination/climate./travel/travel_destination_monthly_climate/month": 389, "_/medicine/disease/notable_people_with_this_condition": 390, "_/base/schemastaging/organization_extra/phone_number./base/schemastaging/phone_sandbox/service_location": 391, "_/people/ethnicity/geographic_distribution": 392, "_/military/military_combatant/military_conflicts./military/military_combatant_group/combatants": 393, "_/film/film/personal_appearances./film/personal_film_appearance/person": 394, "_/location/location/time_zones": 395, "_/film/film/story_by": 396, "_/base/petbreeds/city_with_dogs/top_breeds./base/petbreeds/dog_city_relationship/dog_breed": 397, "_/olympics/olympic_games/participating_countries": 398, "_/tv/tv_network/programs./tv/tv_network_duration/program": 399, "_/people/person/employment_history./business/employment_tenure/company": 400, "_/music/artist/origin": 401, "_/people/marriage_union_type/unions_of_this_type./people/marriage/location_of_ceremony": 402, "_/tv/tv_writer/tv_programs./tv/tv_program_writer_relationship/tv_program": 403, "_/time/event/locations": 404, "_/celebrities/celebrity/sexual_relationships./celebrities/romantic_relationship/celebrity": 405, "_/government/political_party/politicians_in_this_party./government/political_party_tenure/politician": 406, "_/education/university/domestic_tuition./measurement_unit/dated_money_value/currency": 407, "_/organization/non_profit_organization/registered_with./organization/non_profit_registration/registering_agency": 408, "_/user/ktrueman/default_domain/international_organization/member_states": 409, "_/american_football/football_team/current_roster./sports/sports_team_roster/position": 410, "_/soccer/football_player/current_team./sports/sports_team_roster/team": 411, "_/olympics/olympic_games/medals_awarded./olympics/olympic_medal_honor/medal": 412, "_/award/ranked_item/appears_in_ranked_lists./award/ranking/list": 413, "_/film/film_set_designer/film_sets_designed": 414, "_/user/jg/default_domain/olympic_games/sports": 415, "_/people/person/sibling_s./people/sibling_relationship/sibling": 416, "_/base/marchmadness/ncaa_basketball_tournament/seeds./base/marchmadness/ncaa_tournament_seed/team": 417, "_/music/artist/contribution./music/recording_contribution/performance_role": 418, "_/sports/sports_position/players./sports/sports_team_roster/position": 419, "_/government/politician/government_positions_held./government/government_position_held/basic_title": 420, "_/sports/sports_position/players./american_football/football_historical_roster_position/position_s": 421, "_/people/profession/specialization_of": 422, "_/award/award_category/category_of": 423, "_/film/film/cinematography": 424, "_/film/film/film_production_design_by": 425, "_/tv/tv_program/country_of_origin": 426, "_/film/film/edited_by": 427, "_/tv/tv_personality/tv_regular_appearances./tv/tv_regular_personal_appearance/program": 428, "_/education/field_of_study/students_majoring./education/education/major_field_of_study": 429, "_/education/educational_degree/people_with_this_degree./education/education/student": 430, "_/location/us_county/county_seat": 431, "_/film/film/film_festivals": 432, "_/people/person/spouse_s./people/marriage/spouse": 433, "_/film/film/runtime./film/film_cut/film_release_region": 434, "_/location/capital_of_administrative_division/capital_of./location/administrative_division_capital_relationship/administrative_division": 435, "_/base/aareas/schema/administrative_area/administrative_area_type": 436, "_/influence/influence_node/peers./influence/peer_relationship/peers": 437, "_/government/governmental_body/members./government/government_position_held/legislative_sessions": 438, "_/base/schemastaging/organization_extra/phone_number./base/schemastaging/phone_sandbox/service_language": 439, "_/organization/organization/place_founded": 440, "_/base/eating/practicer_of_diet/diet": 441, "_/tv/tv_program/program_creator": 442, "_/people/deceased_person/place_of_burial": 443, "_/film/film/release_date_s./film/film_regional_release_date/film_regional_debut_venue": 444, "_/ice_hockey/hockey_team/current_roster./sports/sports_team_roster/position": 445, "_/location/administrative_division/first_level_division_of": 446, "_/location/statistical_region/gdp_real./measurement_unit/adjusted_money_value/adjustment_currency": 447, "_/organization/organization/child./organization/organization_relationship/child": 448, "_/business/business_operation/assets./measurement_unit/dated_money_value/currency": 449, "_/film/person_or_entity_appearing_in_film/films./film/personal_film_appearance/type_of_appearance": 450, "_/time/event/instance_of_recurring_event": 451, "_/tv/non_character_role/tv_regular_personal_appearances./tv/tv_regular_personal_appearance/person": 452, "_/film/actor/film./film/performance/special_performance_type": 453, "_/business/business_operation/operating_income./measurement_unit/dated_money_value/currency": 454, "_/people/ethnicity/languages_spoken": 455, "_/base/americancomedy/celebrity_impressionist/celebrities_impersonated": 456, "_/medicine/symptom/symptom_of": 457, "_/education/university/fraternities_and_sororities": 458, "_/location/statistical_region/places_exported_to./location/imports_and_exports/exported_to": 459, "_/location/statistical_region/gdp_nominal./measurement_unit/dated_money_value/currency": 460, "_/travel/travel_destination/how_to_get_here./travel/transportation/mode_of_transportation": 461, "_/location/country/official_language": 462, "_/location/location/partially_contains": 463, "_/film/film/film_art_direction_by": 464, "_/people/person/spouse_s./people/marriage/location_of_ceremony": 465, "_/education/university/international_tuition./measurement_unit/dated_money_value/currency": 466, "_/organization/organization_founder/organizations_founded": 467, "_/film/film/dubbing_performances./film/dubbing_performance/actor": 468, "_/dataworld/gardening_hint/split_to": 469, "_/medicine/disease/risk_factors": 470, "_/film/film/prequel": 471, "_/base/localfood/seasonal_month/produce_available./base/localfood/produce_availability/seasonal_months": 472, "_/film/actor/dubbing_performances./film/dubbing_performance/language": 473, "_/broadcast/content/artist": 474, "_/location/statistical_region/gni_per_capita_in_ppp_dollars./measurement_unit/dated_money_value/currency": 475, "_/music/instrument/family": 476, "_/government/politician/government_positions_held./government/government_position_held/jurisdiction_of_office": 477}