{"PAD": 0, "DUMMY_START_RELATION": 1, "UNK": 2, "13_12": 3, "24_12": 4, "15_12": 5, "6_12": 6, "49_12": 7, "13_28": 8, "4_12": 9, "8_12": 10, "29_71": 11, "3_12": 12, "29_32": 13, "48_12": 14, "59_12": 15, "29_51": 16, "29_12": 17, "6_71": 18, "66_12": 19, "24_71": 20, "47_12": 21, "71_71": 22, "34_12": 23, "30_12": 24, "32_12": 25, "13_71": 26, "33_12": 27, "58_12": 28, "4_31": 29, "31_4": 30, "69_65": 31, "65_69": 32, "8_8": 33, "70_39": 34, "39_70": 35, "26_53": 36, "53_26": 37, "33_68": 38, "68_33": 39, "40_40": 40, "69_69": 41, "58_73": 42, "73_58": 43, "58_16": 44, "16_58": 45, "31_69": 46, "69_31": 47, "31_10": 48, "10_31": 49, "52_61": 50, "61_52": 51, "66_76": 52, "76_66": 53, "33_73": 54, "73_33": 55, "38_10": 56, "10_38": 57, "38_65": 58, "65_38": 59, "47_35": 60, "35_47": 61, "50_50": 62, "50_57": 63, "57_50": 64, "58_68": 65, "68_58": 66, "4_32": 67, "32_4": 68, "4_70": 69, "70_4": 70, "30_4": 71, "4_30": 72, "71_70": 73, "70_71": 74, "26_26": 75, "31_26": 76, "26_31": 77, "31_31": 78, "47_31": 79, "31_47": 80, "33_16": 81, "16_33": 82, "65_53": 83, "53_65": 84, "65_65": 85, "10_37": 86, "37_10": 87, "64_64": 88, "64_27": 89, "27_64": 90, "64_66": 91, "66_64": 92, "52_45": 93, "45_52": 94, "39_39": 95, "70_70": 96, "65_70": 97, "70_65": 98, "30_16": 99, "16_30": 100, "52_59": 101, "59_52": 102, "52_57": 103, "57_52": 104, "52_52": 105, "48_69": 106, "69_48": 107, "50_54": 108, "54_50": 109, "60_60": 110, "52_27": 111, "27_52": 112, "3_47": 113, "47_3": 114, "30_73": 115, "73_30": 116, "30_68": 117, "68_30": 118, "72_53": 119, "53_72": 120, "72_26": 121, "26_72": 122, "72_65": 123, "65_72": 124, "72_5": 125, "5_72": 126, "10_12": 127, "12_10": 128, "24_9": 129, "9_24": 130, "42_24": 131, "24_42": 132, "10_10": 133, "24_24": 134, "52_70": 135, "70_52": 136, "49_4": 137, "4_49": 138, "12_3": 139, "3_9": 140, "9_3": 141, "3_10": 142, "10_3": 143, "3_56": 144, "56_3": 145, "35_65": 146, "65_35": 147, "52_15": 148, "15_52": 149, "45_10": 150, "10_45": 151, "63_10": 152, "10_63": 153, "63_28": 154, "28_63": 155, "63_50": 156, "50_63": 157, "29_70": 158, "70_29": 159, "26_65": 160, "65_26": 161, "26_5": 162, "5_26": 163, "48_8": 164, "8_48": 165, "48_68": 166, "68_48": 167, "64_40": 168, "40_64": 169, "32_24": 170, "24_32": 171, "33_21": 172, "21_33": 173, "59_4": 174, "4_59": 175, "65_5": 176, "5_65": 177, "70_26": 178, "26_70": 179, "70_38": 180, "38_70": 181, "38_53": 182, "53_38": 183, "35_34": 184, "34_35": 185, "4_67": 186, "67_4": 187, "64_50": 188, "50_64": 189, "64_4": 190, "4_64": 191, "24_49": 192, "49_24": 193, "55_31": 194, "31_55": 195, "41_41": 196, "5_5": 197, "4_50": 198, "50_4": 199, "49_2": 200, "2_49": 201, "49_41": 202, "41_49": 203, "70_10": 204, "10_70": 205, "58_49": 206, "49_58": 207, "66_66": 208, "37_37": 209, "57_31": 210, "31_57": 211, "3_3": 212, "27_48": 213, "48_27": 214, "4_52": 215, "52_4": 216, "4_45": 217, "45_4": 218, "64_65": 219, "65_64": 220, "64_72": 221, "72_64": 222, "45_66": 223, "66_45": 224, "45_15": 225, "15_45": 226, "45_67": 227, "67_45": 228, "41_71": 229, "71_41": 230, "47_47": 231, "54_54": 232, "54_57": 233, "57_54": 234, "47_72": 235, "72_47": 236, "32_10": 237, "10_32": 238, "33_34": 239, "34_33": 240, "24_3": 241, "3_24": 242, "57_44": 243, "44_57": 244, "4_44": 245, "44_4": 246, "29_49": 247, "49_29": 248, "5_53": 249, "53_5": 250, "33_13": 251, "13_33": 252, "75_50": 253, "50_75": 254, "75_3": 255, "3_75": 256, "75_65": 257, "65_75": 258, "35_31": 259, "31_35": 260, "44_32": 261, "32_44": 262, "44_44": 263, "44_64": 264, "64_44": 265, "44_76": 266, "76_44": 267, "10_24": 268, "24_10": 269, "10_51": 270, "51_10": 271, "64_10": 272, "10_64": 273, "49_19": 274, "19_49": 275, "30_53": 276, "53_30": 277, "36_17": 278, "17_36": 279, "29_46": 280, "46_29": 281, "72_50": 282, "50_72": 283, "72_72": 284, "47_4": 285, "4_47": 286, "47_57": 287, "57_47": 288, "47_51": 289, "51_47": 290, "12_4": 291, "26_50": 292, "50_26": 293, "72_70": 294, "70_72": 295, "49_66": 296, "66_49": 297, "24_4": 298, "4_24": 299, "10_9": 300, "9_10": 301, "70_16": 302, "16_70": 303, "45_45": 304, "29_66": 305, "66_29": 306, "71_61": 307, "61_71": 308, "65_46": 309, "46_65": 310, "7_57": 311, "57_7": 312, "24_67": 313, "67_24": 314, "69_5": 315, "5_69": 316, "6_29": 317, "29_6": 318, "49_49": 319, "29_16": 320, "16_29": 321, "33_49": 322, "49_33": 323, "36_15": 324, "15_36": 325, "25_25": 326, "38_60": 327, "60_38": 328, "38_38": 329, "70_66": 330, "66_70": 331, "20_34": 332, "34_20": 333, "3_50": 334, "50_3": 335, "10_59": 336, "59_10": 337, "41_27": 338, "27_41": 339, "41_8": 340, "8_41": 341, "41_47": 342, "47_41": 343, "41_40": 344, "40_41": 345, "41_67": 346, "67_41": 347, "41_50": 348, "50_41": 349, "41_61": 350, "61_41": 351, "18_18": 352, "27_4": 353, "4_27": 354, "45_34": 355, "34_45": 356, "57_26": 357, "26_57": 358, "72_31": 359, "31_72": 360, "50_65": 361, "65_50": 362, "50_5": 363, "5_50": 364, "50_38": 365, "38_50": 366, "50_10": 367, "10_50": 368, "50_40": 369, "40_50": 370, "50_69": 371, "69_50": 372, "50_53": 373, "53_50": 374, "49_15": 375, "15_49": 376, "32_32": 377, "32_46": 378, "46_32": 379, "32_56": 380, "56_32": 381, "29_20": 382, "20_29": 383, "4_4": 384, "32_29": 385, "72_40": 386, "40_72": 387, "67_50": 388, "50_67": 389, "38_59": 390, "59_38": 391, "34_34": 392, "54_32": 393, "32_54": 394, "54_26": 395, "26_54": 396, "41_2": 397, "2_41": 398, "67_53": 399, "53_67": 400, "67_65": 401, "65_67": 402, "67_67": 403, "67_72": 404, "72_67": 405, "4_65": 406, "65_4": 407, "24_28": 408, "28_24": 409, "69_67": 410, "67_69": 411, "49_68": 412, "68_49": 413, "69_10": 414, "10_69": 415, "50_31": 416, "31_50": 417, "32_43": 418, "43_32": 419, "25_66": 420, "66_25": 421, "7_10": 422, "10_7": 423, "72_10": 424, "10_72": 425, "72_44": 426, "44_72": 427, "72_4": 428, "4_72": 429, "7_69": 430, "69_7": 431, "32_31": 432, "31_32": 433, "53_53": 434, "4_51": 435, "51_4": 436, "6_24": 437, "24_6": 438, "6_49": 439, "49_6": 440, "12_12": 441, "12_31": 442, "31_12": 443, "29_3": 444, "3_29": 445, "35_10": 446, "10_35": 447, "3_67": 448, "67_3": 449, "3_31": 450, "31_3": 451, "8_53": 452, "53_8": 453, "32_66": 454, "66_32": 455, "30_70": 456, "70_30": 457, "34_4": 458, "4_34": 459, "52_48": 460, "48_52": 461, "52_39": 462, "39_52": 463, "56_56": 464, "51_51": 465, "58_29": 466, "29_58": 467, "58_57": 468, "57_58": 469, "32_47": 470, "47_32": 471, "9_65": 472, "65_9": 473, "72_22": 474, "22_72": 475, "66_18": 476, "18_66": 477, "54_31": 478, "31_54": 479, "32_52": 480, "52_32": 481, "32_57": 482, "57_32": 483, "15_34": 484, "34_15": 485, "8_66": 486, "66_8": 487, "47_69": 488, "69_47": 489, "3_28": 490, "28_3": 491, "51_31": 492, "31_51": 493, "8_67": 494, "67_8": 495, "8_65": 496, "65_8": 497, "68_29": 498, "29_68": 499, "29_29": 500, "52_54": 501, "54_52": 502, "50_52": 503, "52_50": 504, "50_44": 505, "44_50": 506, "50_27": 507, "27_50": 508, "50_12": 509, "12_50": 510, "50_47": 511, "47_50": 512, "50_9": 513, "9_50": 514, "47_10": 515, "10_47": 516, "69_60": 517, "60_69": 518, "29_59": 519, "59_29": 520, "6_6": 521, "71_6": 522, "10_46": 523, "46_10": 524, "3_72": 525, "72_3": 526, "3_34": 527, "34_3": 528, "24_43": 529, "43_24": 530, "63_56": 531, "56_63": 532, "8_73": 533, "73_8": 534, "8_70": 535, "70_8": 536, "29_4": 537, "4_29": 538, "23_23": 539, "23_28": 540, "28_23": 541, "4_43": 542, "43_4": 543, "24_73": 544, "73_24": 545, "55_55": 546, "45_31": 547, "31_45": 548, "50_59": 549, "59_50": 550, "23_61": 551, "61_23": 552, "37_67": 553, "67_37": 554, "37_56": 555, "56_37": 556, "37_69": 557, "69_37": 558, "37_31": 559, "31_37": 560, "32_39": 561, "39_32": 562, "57_57": 563, "40_27": 564, "27_40": 565, "40_10": 566, "10_40": 567, "33_25": 568, "25_33": 569, "52_49": 570, "49_52": 571, "70_46": 572, "46_70": 573, "12_49": 574, "49_71": 575, "71_49": 576, "71_31": 577, "31_71": 578, "71_66": 579, "66_71": 580, "49_45": 581, "45_49": 582, "30_18": 583, "18_30": 584, "40_47": 585, "47_40": 586, "48_31": 587, "31_48": 588, "14_65": 589, "65_14": 590, "64_38": 591, "38_64": 592, "64_17": 593, "17_64": 594, "40_67": 595, "67_40": 596, "40_4": 597, "4_40": 598, "49_30": 599, "30_49": 600, "49_31": 601, "31_49": 602, "29_28": 603, "28_29": 604, "3_26": 605, "26_3": 606, "3_57": 607, "57_3": 608, "3_32": 609, "32_3": 610, "3_44": 611, "44_3": 612, "36_45": 613, "45_36": 614, "61_50": 615, "50_61": 616, "20_16": 617, "16_20": 618, "40_65": 619, "65_40": 620, "52_66": 621, "66_52": 622, "37_68": 623, "68_37": 624, "69_53": 625, "53_69": 626, "3_65": 627, "65_3": 628, "32_70": 629, "70_32": 630, "18_53": 631, "53_18": 632, "40_8": 633, "8_40": 634, "40_53": 635, "53_40": 636, "23_52": 637, "52_23": 638, "39_72": 639, "72_39": 640, "27_27": 641, "48_10": 642, "10_48": 643, "55_10": 644, "10_55": 645, "13_8": 646, "8_13": 647, "20_20": 648, "54_4": 649, "4_54": 650, "3_64": 651, "64_3": 652, "3_40": 653, "40_3": 654, "69_72": 655, "72_69": 656, "5_39": 657, "39_5": 658, "72_46": 659, "46_72": 660, "15_53": 661, "53_15": 662, "29_26": 663, "26_29": 664, "7_26": 665, "26_7": 666, "65_37": 667, "37_65": 668, "3_21": 669, "21_3": 670, "15_59": 671, "59_15": 672, "34_18": 673, "18_34": 674, "12_13": 675, "24_56": 676, "56_24": 677, "64_8": 678, "8_64": 679, "64_41": 680, "41_64": 681, "64_47": 682, "47_64": 683, "38_26": 684, "26_38": 685, "34_32": 686, "32_34": 687, "6_4": 688, "4_6": 689, "38_5": 690, "5_38": 691, "32_26": 692, "26_32": 693, "65_10": 694, "10_65": 695, "29_8": 696, "8_29": 697, "69_26": 698, "26_69": 699, "22_22": 700, "38_69": 701, "69_38": 702, "29_65": 703, "65_29": 704, "26_67": 705, "67_26": 706, "18_50": 707, "50_18": 708, "18_4": 709, "4_18": 710, "71_2": 711, "2_71": 712, "71_23": 713, "23_71": 714, "71_24": 715, "47_56": 716, "56_47": 717, "29_24": 718, "24_29": 719, "8_72": 720, "72_8": 721, "65_47": 722, "47_65": 723, "40_24": 724, "24_40": 725, "29_53": 726, "53_29": 727, "32_55": 728, "55_32": 729, "3_69": 730, "69_3": 731, "44_40": 732, "40_44": 733, "33_24": 734, "24_33": 735, "38_47": 736, "47_38": 737, "26_22": 738, "22_26": 739, "49_70": 740, "70_49": 741, "48_13": 742, "13_48": 743, "50_45": 744, "45_50": 745, "29_39": 746, "39_29": 747, "49_63": 748, "63_49": 749, "8_49": 750, "49_8": 751, "34_26": 752, "26_34": 753, "18_20": 754, "20_18": 755, "27_65": 756, "65_27": 757, "17_73": 758, "73_17": 759, "24_65": 760, "65_24": 761, "24_13": 762, "13_24": 763, "34_39": 764, "39_34": 765, "16_31": 766, "31_16": 767, "12_47": 768, "64_49": 769, "49_64": 770, "64_32": 771, "32_64": 772, "64_2": 773, "2_64": 774, "42_42": 775, "38_4": 776, "4_38": 777, "14_50": 778, "50_14": 779, "32_45": 780, "45_32": 781, "52_8": 782, "8_52": 783, "52_29": 784, "29_52": 785, "10_4": 786, "4_10": 787, "54_29": 788, "29_54": 789, "35_35": 790, "35_63": 791, "63_35": 792, "75_75": 793, "75_53": 794, "53_75": 795, "41_23": 796, "23_41": 797, "41_11": 798, "11_41": 799, "67_31": 800, "31_67": 801, "9_9": 802, "15_4": 803, "4_15": 804, "15_15": 805, "7_50": 806, "50_7": 807, "10_60": 808, "60_10": 809, "58_70": 810, "70_58": 811, "52_64": 812, "64_52": 813, "50_28": 814, "28_50": 815, "32_6": 816, "6_32": 817, "57_72": 818, "72_57": 819, "32_76": 820, "76_32": 821, "47_60": 822, "60_47": 823, "24_61": 824, "61_24": 825, "21_15": 826, "15_21": 827, "32_68": 828, "68_32": 829, "46_69": 830, "69_46": 831, "46_37": 832, "37_46": 833, "8_24": 834, "24_8": 835, "13_13": 836, "68_46": 837, "46_68": 838, "70_2": 839, "2_70": 840, "15_65": 841, "65_15": 842, "72_27": 843, "27_72": 844, "74_34": 845, "34_74": 846, "3_6": 847, "6_3": 848, "12_48": 849, "17_46": 850, "46_17": 851, "17_38": 852, "38_17": 853, "74_68": 854, "68_74": 855, "20_32": 856, "32_20": 857, "41_19": 858, "19_41": 859, "24_57": 860, "57_24": 861, "55_65": 862, "65_55": 863, "23_25": 864, "25_23": 865, "50_32": 866, "32_50": 867, "50_60": 868, "60_50": 869, "66_65": 870, "65_66": 871, "65_39": 872, "39_65": 873, "41_10": 874, "10_41": 875, "69_27": 876, "27_69": 877, "55_47": 878, "47_55": 879, "55_51": 880, "51_55": 881, "29_57": 882, "57_29": 883, "33_33": 884, "58_3": 885, "3_58": 886, "33_15": 887, "15_33": 888, "30_67": 889, "67_30": 890, "5_46": 891, "46_5": 892, "66_10": 893, "10_66": 894, "4_57": 895, "57_4": 896, "55_50": 897, "50_55": 898, "48_39": 899, "39_48": 900, "38_72": 901, "72_38": 902, "3_49": 903, "49_3": 904, "4_71": 905, "71_4": 906, "6_31": 907, "31_6": 908, "21_4": 909, "4_21": 910, "30_19": 911, "19_30": 912, "66_24": 913, "24_66": 914, "49_23": 915, "23_49": 916, "54_72": 917, "72_54": 918, "45_48": 919, "48_45": 920, "45_8": 921, "8_45": 922, "70_50": 923, "50_70": 924, "28_54": 925, "54_28": 926, "4_33": 927, "33_4": 928, "55_53": 929, "53_55": 930, "55_67": 931, "67_55": 932, "49_73": 933, "73_49": 934, "50_46": 935, "46_50": 936, "43_39": 937, "39_43": 938, "3_61": 939, "61_3": 940, "46_46": 941, "49_55": 942, "55_49": 943, "24_15": 944, "15_24": 945, "12_57": 946, "57_12": 947, "12_51": 948, "51_12": 949, "3_13": 950, "13_3": 951, "70_11": 952, "11_70": 953, "26_46": 954, "46_26": 955, "26_28": 956, "28_26": 957, "10_67": 958, "67_10": 959, "66_67": 960, "67_66": 961, "26_47": 962, "47_26": 963, "22_70": 964, "70_22": 965, "22_65": 966, "65_22": 967, "8_31": 968, "31_8": 969, "31_53": 970, "53_31": 971, "31_63": 972, "63_31": 973, "72_75": 974, "75_72": 975, "4_56": 976, "56_4": 977, "33_8": 978, "8_33": 979, "69_70": 980, "70_69": 981, "43_65": 982, "65_43": 983, "72_73": 984, "73_72": 985, "34_71": 986, "71_34": 987, "51_29": 988, "4_26": 989, "26_4": 990, "24_70": 991, "70_24": 992, "45_64": 993, "64_45": 994, "29_67": 995, "67_29": 996, "25_20": 997, "20_25": 998, "32_49": 999, "49_32": 1000, "30_58": 1001, "58_30": 1002, "27_70": 1003, "70_27": 1004, "50_49": 1005, "49_50": 1006, "10_56": 1007, "56_10": 1008, "10_44": 1009, "44_10": 1010, "10_57": 1011, "57_10": 1012, "10_75": 1013, "75_10": 1014, "10_18": 1015, "18_10": 1016, "64_53": 1017, "53_64": 1018, "43_43": 1019, "10_53": 1020, "53_10": 1021, "32_53": 1022, "53_32": 1023, "12_16": 1024, "16_12": 1025, "8_59": 1026, "59_8": 1027, "25_70": 1028, "70_25": 1029, "25_3": 1030, "3_25": 1031, "25_65": 1032, "65_25": 1033, "45_29": 1034, "29_45": 1035, "35_37": 1036, "37_35": 1037, "35_28": 1038, "28_35": 1039, "21_70": 1040, "70_21": 1041, "38_40": 1042, "40_38": 1043, "57_45": 1044, "45_57": 1045, "29_61": 1046, "61_29": 1047, "24_55": 1048, "55_24": 1049, "75_31": 1050, "31_75": 1051, "75_56": 1052, "56_75": 1053, "49_72": 1054, "72_49": 1055, "70_15": 1056, "15_70": 1057, "51_3": 1058, "3_51": 1059, "18_7": 1060, "7_18": 1061, "42_10": 1062, "10_42": 1063, "37_70": 1064, "70_37": 1065, "7_31": 1066, "31_7": 1067, "4_28": 1068, "28_4": 1069, "48_70": 1070, "70_48": 1071, "34_21": 1072, "21_34": 1073, "69_56": 1074, "56_69": 1075, "70_73": 1076, "73_70": 1077, "63_34": 1078, "34_63": 1079, "70_59": 1080, "59_70": 1081, "64_57": 1082, "57_64": 1083, "70_45": 1084, "45_70": 1085, "45_24": 1086, "24_45": 1087, "45_53": 1088, "53_45": 1089, "50_30": 1090, "30_50": 1091, "23_26": 1092, "26_23": 1093, "12_34": 1094, "12_56": 1095, "56_12": 1096, "22_38": 1097, "38_22": 1098, "47_67": 1099, "67_47": 1100, "29_76": 1101, "76_29": 1102, "70_34": 1103, "34_70": 1104, "4_3": 1105, "3_4": 1106, "49_46": 1107, "46_49": 1108, "7_8": 1109, "8_7": 1110, "30_45": 1111, "45_30": 1112, "23_31": 1113, "31_23": 1114, "74_72": 1115, "72_74": 1116, "24_16": 1117, "16_24": 1118, "71_10": 1119, "10_71": 1120, "73_15": 1121, "15_73": 1122, "69_64": 1123, "64_69": 1124, "23_2": 1125, "2_23": 1126, "54_65": 1127, "65_54": 1128, "5_14": 1129, "14_5": 1130, "48_3": 1131, "3_48": 1132, "46_53": 1133, "53_46": 1134, "15_48": 1135, "48_15": 1136, "36_65": 1137, "65_36": 1138, "45_65": 1139, "65_45": 1140, "48_72": 1141, "72_48": 1142, "65_56": 1143, "56_65": 1144, "3_30": 1145, "30_3": 1146, "30_71": 1147, "71_30": 1148, "12_65": 1149, "65_12": 1150, "29_44": 1151, "44_29": 1152, "66_47": 1153, "47_66": 1154, "40_69": 1155, "69_40": 1156, "21_59": 1157, "59_21": 1158, "13_47": 1159, "47_13": 1160, "13_59": 1161, "59_13": 1162, "63_53": 1163, "53_63": 1164, "63_26": 1165, "26_63": 1166, "63_4": 1167, "4_63": 1168, "7_44": 1169, "44_7": 1170, "26_64": 1171, "64_26": 1172, "66_50": 1173, "50_66": 1174, "9_4": 1175, "4_9": 1176, "48_49": 1177, "49_48": 1178, "49_57": 1179, "57_49": 1180, "18_26": 1181, "26_18": 1182, "48_4": 1183, "4_48": 1184, "34_68": 1185, "68_34": 1186, "4_37": 1187, "37_4": 1188, "44_26": 1189, "26_44": 1190, "5_70": 1191, "70_5": 1192, "69_34": 1193, "34_69": 1194, "28_31": 1195, "31_28": 1196, "26_10": 1197, "10_26": 1198, "66_4": 1199, "4_66": 1200, "42_61": 1201, "61_42": 1202, "28_28": 1203, "26_6": 1204, "6_26": 1205, "10_34": 1206, "34_10": 1207, "43_46": 1208, "46_43": 1209, "9_39": 1210, "39_9": 1211, "24_39": 1212, "39_24": 1213, "54_16": 1214, "16_54": 1215, "40_26": 1216, "26_40": 1217, "64_5": 1218, "5_64": 1219, "22_53": 1220, "53_22": 1221, "27_29": 1222, "29_27": 1223, "40_12": 1224, "12_40": 1225, "34_24": 1226, "24_34": 1227, "3_15": 1228, "15_3": 1229, "27_10": 1230, "10_27": 1231, "46_61": 1232, "61_46": 1233, "18_67": 1234, "67_18": 1235, "34_73": 1236, "73_34": 1237, "52_73": 1238, "73_52": 1239, "50_15": 1240, "15_50": 1241, "30_30": 1242, "70_19": 1243, "19_70": 1244, "70_68": 1245, "68_70": 1246, "70_6": 1247, "6_70": 1248, "70_64": 1249, "64_70": 1250, "60_65": 1251, "65_60": 1252, "44_69": 1253, "69_44": 1254, "44_65": 1255, "65_44": 1256, "44_27": 1257, "27_44": 1258, "72_66": 1259, "66_72": 1260, "72_18": 1261, "18_72": 1262, "49_34": 1263, "34_49": 1264, "23_72": 1265, "72_23": 1266, "23_12": 1267, "12_23": 1268, "19_24": 1269, "24_19": 1270, "8_16": 1271, "16_8": 1272, "60_34": 1273, "34_60": 1274, "37_73": 1275, "73_37": 1276, "29_15": 1277, "15_29": 1278, "74_67": 1279, "67_74": 1280, "52_55": 1281, "55_52": 1282, "32_18": 1283, "18_32": 1284, "32_38": 1285, "38_32": 1286, "64_36": 1287, "36_64": 1288, "49_53": 1289, "53_49": 1290, "48_50": 1291, "50_48": 1292, "48_65": 1293, "65_48": 1294, "34_29": 1295, "29_34": 1296, "41_66": 1297, "66_41": 1298, "41_25": 1299, "25_41": 1300, "4_69": 1301, "69_4": 1302, "41_69": 1303, "69_41": 1304, "41_12": 1305, "12_41": 1306, "8_32": 1307, "32_8": 1308, "39_68": 1309, "68_39": 1310, "64_24": 1311, "24_64": 1312, "47_44": 1313, "44_47": 1314, "10_28": 1315, "28_10": 1316, "67_34": 1317, "34_67": 1318, "32_61": 1319, "61_32": 1320, "27_53": 1321, "53_27": 1322, "65_31": 1323, "31_65": 1324, "17_32": 1325, "32_17": 1326, "4_5": 1327, "5_4": 1328, "52_31": 1329, "31_52": 1330, "6_68": 1331, "68_6": 1332, "47_74": 1333, "74_47": 1334, "75_55": 1335, "55_75": 1336, "32_72": 1337, "72_32": 1338, "26_39": 1339, "39_26": 1340, "57_46": 1341, "46_57": 1342, "3_70": 1343, "70_3": 1344, "53_28": 1345, "28_53": 1346, "24_31": 1347, "31_24": 1348, "71_29": 1349, "12_29": 1350, "45_3": 1351, "3_45": 1352, "45_19": 1353, "19_45": 1354, "43_75": 1355, "75_43": 1356, "7_29": 1357, "29_7": 1358, "52_12": 1359, "12_52": 1360, "57_63": 1361, "63_57": 1362, "30_41": 1363, "41_30": 1364, "57_56": 1365, "56_57": 1366, "29_73": 1367, "73_29": 1368, "49_67": 1369, "67_49": 1370, "21_72": 1371, "72_21": 1372, "12_20": 1373, "20_12": 1374, "24_53": 1375, "53_24": 1376, "42_3": 1377, "3_42": 1378, "33_45": 1379, "45_33": 1380, "33_55": 1381, "55_33": 1382, "61_68": 1383, "68_61": 1384, "34_51": 1385, "51_34": 1386, "35_53": 1387, "53_35": 1388, "48_34": 1389, "34_48": 1390, "49_76": 1391, "76_49": 1392, "32_27": 1393, "27_32": 1394, "52_3": 1395, "3_52": 1396, "35_69": 1397, "69_35": 1398, "24_54": 1399, "54_24": 1400, "43_67": 1401, "67_43": 1402, "35_72": 1403, "72_35": 1404, "7_7": 1405, "32_30": 1406, "30_32": 1407, "38_61": 1408, "61_38": 1409, "34_19": 1410, "19_34": 1411, "10_16": 1412, "16_10": 1413, "5_28": 1414, "28_5": 1415, "5_73": 1416, "73_5": 1417, "5_71": 1418, "71_5": 1419, "5_13": 1420, "13_5": 1421, "33_6": 1422, "6_33": 1423, "3_27": 1424, "27_3": 1425, "3_66": 1426, "66_3": 1427, "68_18": 1428, "18_68": 1429, "36_69": 1430, "69_36": 1431, "12_32": 1432, "30_15": 1433, "15_30": 1434, "38_39": 1435, "39_38": 1436, "70_57": 1437, "57_70": 1438, "18_31": 1439, "31_18": 1440, "70_61": 1441, "61_70": 1442, "4_13": 1443, "13_4": 1444, "70_31": 1445, "31_70": 1446, "48_55": 1447, "55_48": 1448, "21_69": 1449, "69_21": 1450, "66_5": 1451, "5_66": 1452, "66_68": 1453, "68_66": 1454, "21_50": 1455, "50_21": 1456, "37_34": 1457, "34_37": 1458, "58_19": 1459, "19_58": 1460, "48_26": 1461, "26_48": 1462, "71_25": 1463, "25_71": 1464, "71_26": 1465, "26_71": 1466, "49_18": 1467, "18_49": 1468, "73_16": 1469, "16_73": 1470, "33_10": 1471, "10_33": 1472, "48_18": 1473, "18_48": 1474, "52_38": 1475, "38_52": 1476, "57_28": 1477, "28_57": 1478, "71_72": 1479, "72_71": 1480, "56_26": 1481, "26_56": 1482, "56_72": 1483, "72_56": 1484, "56_73": 1485, "73_56": 1486, "56_50": 1487, "50_56": 1488, "40_2": 1489, "2_40": 1490, "58_45": 1491, "45_58": 1492, "34_17": 1493, "17_34": 1494, "57_55": 1495, "55_57": 1496, "23_19": 1497, "19_23": 1498, "66_27": 1499, "27_66": 1500, "32_16": 1501, "16_32": 1502, "5_45": 1503, "45_5": 1504, "43_31": 1505, "31_43": 1506, "31_56": 1507, "56_31": 1508, "44_18": 1509, "18_44": 1510, "43_66": 1511, "66_43": 1512, "33_66": 1513, "66_33": 1514, "34_53": 1515, "53_34": 1516, "58_31": 1517, "31_58": 1518, "52_26": 1519, "26_52": 1520, "18_59": 1521, "59_18": 1522, "38_67": 1523, "67_38": 1524, "30_24": 1525, "24_30": 1526, "42_4": 1527, "4_42": 1528, "51_15": 1529, "15_51": 1530, "65_21": 1531, "21_65": 1532, "52_65": 1533, "65_52": 1534, "12_30": 1535, "52_18": 1536, "18_52": 1537, "28_25": 1538, "25_28": 1539, "18_64": 1540, "64_18": 1541, "26_24": 1542, "24_26": 1543, "66_63": 1544, "63_66": 1545, "34_66": 1546, "66_34": 1547, "57_61": 1548, "61_57": 1549, "57_51": 1550, "51_57": 1551, "57_9": 1552, "9_57": 1553, "4_55": 1554, "55_4": 1555, "51_59": 1556, "59_51": 1557, "6_16": 1558, "16_6": 1559, "70_76": 1560, "76_70": 1561, "28_49": 1562, "49_28": 1563, "31_60": 1564, "60_31": 1565, "43_50": 1566, "50_43": 1567, "67_68": 1568, "68_67": 1569, "23_4": 1570, "4_23": 1571, "75_12": 1572, "12_75": 1573, "6_18": 1574, "18_6": 1575, "49_26": 1576, "26_49": 1577, "64_55": 1578, "55_64": 1579, "26_15": 1580, "15_26": 1581, "38_16": 1582, "16_38": 1583, "52_47": 1584, "47_52": 1585, "32_67": 1586, "67_32": 1587, "42_12": 1588, "12_42": 1589, "64_67": 1590, "67_64": 1591, "69_57": 1592, "57_69": 1593, "69_63": 1594, "63_69": 1595, "69_28": 1596, "28_69": 1597, "69_17": 1598, "17_69": 1599, "70_54": 1600, "54_70": 1601, "49_54": 1602, "54_49": 1603, "47_37": 1604, "37_47": 1605, "28_12": 1606, "12_28": 1607, "49_25": 1608, "25_49": 1609, "43_10": 1610, "10_43": 1611, "55_60": 1612, "60_55": 1613, "40_15": 1614, "15_40": 1615, "40_66": 1616, "66_40": 1617, "18_47": 1618, "47_18": 1619, "33_65": 1620, "65_33": 1621, "19_25": 1622, "25_19": 1623, "8_26": 1624, "26_8": 1625, "74_4": 1626, "4_74": 1627, "34_65": 1628, "65_34": 1629, "40_25": 1630, "25_40": 1631, "29_13": 1632, "13_29": 1633, "25_24": 1634, "24_25": 1635, "50_8": 1636, "8_50": 1637, "50_71": 1638, "71_50": 1639, "52_72": 1640, "72_52": 1641, "70_67": 1642, "67_70": 1643, "5_49": 1644, "49_5": 1645, "72_43": 1646, "43_72": 1647, "74_53": 1648, "53_74": 1649, "34_59": 1650, "59_34": 1651, "43_70": 1652, "70_43": 1653, "43_64": 1654, "64_43": 1655, "67_27": 1656, "27_67": 1657, "3_59": 1658, "59_3": 1659, "3_33": 1660, "33_3": 1661, "43_3": 1662, "3_43": 1663, "6_42": 1664, "42_6": 1665, "47_63": 1666, "63_47": 1667, "52_56": 1668, "56_52": 1669, "27_18": 1670, "18_27": 1671, "15_18": 1672, "18_15": 1673, "29_50": 1674, "50_29": 1675, "10_76": 1676, "76_10": 1677, "23_70": 1678, "70_23": 1679, "47_53": 1680, "53_47": 1681, "64_30": 1682, "30_64": 1683, "12_24": 1684, "48_48": 1685, "32_63": 1686, "63_32": 1687, "66_26": 1688, "26_66": 1689, "21_73": 1690, "73_21": 1691, "52_34": 1692, "34_52": 1693, "50_58": 1694, "58_50": 1695, "50_76": 1696, "76_50": 1697, "48_29": 1698, "29_48": 1699, "25_10": 1700, "10_25": 1701, "21_53": 1702, "53_21": 1703, "30_28": 1704, "28_30": 1705, "8_76": 1706, "76_8": 1707, "54_12": 1708, "12_54": 1709, "7_70": 1710, "70_7": 1711, "50_73": 1712, "73_50": 1713, "48_73": 1714, "73_48": 1715, "39_45": 1716, "45_39": 1717, "6_28": 1718, "28_6": 1719, "52_24": 1720, "24_52": 1721, "12_66": 1722, "64_15": 1723, "15_64": 1724, "57_76": 1725, "76_57": 1726, "37_53": 1727, "53_37": 1728, "43_57": 1729, "57_43": 1730, "29_2": 1731, "2_29": 1732, "61_65": 1733, "65_61": 1734, "37_38": 1735, "38_37": 1736, "44_53": 1737, "53_44": 1738, "54_63": 1739, "63_54": 1740, "40_71": 1741, "71_40": 1742, "48_24": 1743, "24_48": 1744, "73_31": 1745, "31_73": 1746, "73_66": 1747, "66_73": 1748, "38_27": 1749, "27_38": 1750, "32_69": 1751, "69_32": 1752, "21_64": 1753, "64_21": 1754, "52_37": 1755, "37_52": 1756, "30_8": 1757, "8_30": 1758, "3_7": 1759, "7_3": 1760, "75_5": 1761, "5_75": 1762, "75_52": 1763, "52_75": 1764, "57_53": 1765, "53_57": 1766, "72_9": 1767, "9_72": 1768, "58_71": 1769, "71_58": 1770, "36_38": 1771, "38_36": 1772, "8_25": 1773, "25_8": 1774, "43_47": 1775, "47_43": 1776, "41_6": 1777, "6_41": 1778, "9_69": 1779, "69_9": 1780, "54_45": 1781, "45_54": 1782, "12_70": 1783, "70_12": 1784, "12_67": 1785, "67_12": 1786, "72_45": 1787, "45_72": 1788, "57_42": 1789, "42_57": 1790, "57_18": 1791, "18_57": 1792, "57_66": 1793, "66_57": 1794, "12_37": 1795, "37_12": 1796, "71_67": 1797, "67_71": 1798, "6_15": 1799, "15_6": 1800, "50_35": 1801, "35_50": 1802, "6_25": 1803, "25_6": 1804, "50_24": 1805, "24_50": 1806, "66_31": 1807, "31_66": 1808, "40_5": 1809, "5_40": 1810, "64_46": 1811, "46_64": 1812, "64_31": 1813, "31_64": 1814, "16_16": 1815, "8_4": 1816, "4_8": 1817, "12_53": 1818, "53_12": 1819, "12_45": 1820, "45_12": 1821, "12_19": 1822, "19_12": 1823, "72_51": 1824, "51_72": 1825, "24_59": 1826, "59_24": 1827, "10_13": 1828, "13_10": 1829, "51_67": 1830, "67_51": 1831, "51_28": 1832, "28_51": 1833, "51_37": 1834, "37_51": 1835, "51_56": 1836, "56_51": 1837, "51_53": 1838, "53_51": 1839, "29_30": 1840, "30_29": 1841, "70_18": 1842, "18_70": 1843, "66_56": 1844, "56_66": 1845, "26_45": 1846, "45_26": 1847, "44_31": 1848, "31_44": 1849, "8_15": 1850, "15_8": 1851, "7_67": 1852, "67_7": 1853, "3_53": 1854, "53_3": 1855, "20_70": 1856, "70_20": 1857, "6_30": 1858, "30_6": 1859, "53_56": 1860, "56_53": 1861, "73_27": 1862, "27_73": 1863, "4_53": 1864, "53_4": 1865, "6_45": 1866, "45_6": 1867, "27_49": 1868, "49_27": 1869, "21_48": 1870, "48_21": 1871, "54_34": 1872, "34_54": 1873, "49_7": 1874, "7_49": 1875, "64_71": 1876, "71_64": 1877, "15_17": 1878, "17_15": 1879, "13_31": 1880, "31_13": 1881, "35_60": 1882, "60_35": 1883, "2_2": 1884, "23_45": 1885, "45_23": 1886, "49_16": 1887, "16_49": 1888, "40_31": 1889, "31_40": 1890, "68_65": 1891, "65_68": 1892, "12_55": 1893, "55_12": 1894, "28_72": 1895, "72_28": 1896, "49_74": 1897, "74_49": 1898, "76_53": 1899, "53_76": 1900, "38_46": 1901, "46_38": 1902, "3_8": 1903, "8_3": 1904, "12_27": 1905, "27_12": 1906, "12_8": 1907, "64_76": 1908, "76_64": 1909, "64_56": 1910, "56_64": 1911, "44_66": 1912, "66_44": 1913, "18_65": 1914, "65_18": 1915, "45_25": 1916, "25_45": 1917, "58_2": 1918, "2_58": 1919, "35_40": 1920, "40_35": 1921, "24_51": 1922, "51_24": 1923, "70_53": 1924, "53_70": 1925, "30_48": 1926, "48_30": 1927, "30_25": 1928, "25_30": 1929, "54_56": 1930, "56_54": 1931, "20_31": 1932, "31_20": 1933, "54_8": 1934, "8_54": 1935, "28_59": 1936, "59_28": 1937, "66_15": 1938, "15_66": 1939, "3_74": 1940, "74_3": 1941, "20_4": 1942, "4_20": 1943, "10_68": 1944, "68_10": 1945, "16_66": 1946, "66_16": 1947, "26_17": 1948, "17_26": 1949, "51_58": 1950, "58_51": 1951, "51_13": 1952, "13_51": 1953, "74_73": 1954, "73_74": 1955, "67_25": 1956, "25_67": 1957, "58_8": 1958, "8_58": 1959, "57_68": 1960, "68_57": 1961, "3_20": 1962, "20_3": 1963, "57_67": 1964, "67_57": 1965, "5_16": 1966, "16_5": 1967, "53_48": 1968, "48_53": 1969, "53_23": 1970, "23_53": 1971, "53_71": 1972, "71_53": 1973, "6_61": 1974, "61_6": 1975, "29_56": 1976, "56_29": 1977, "64_59": 1978, "59_64": 1979, "54_55": 1980, "55_54": 1981, "35_55": 1982, "55_35": 1983, "44_35": 1984, "35_44": 1985, "7_72": 1986, "72_7": 1987, "15_31": 1988, "31_15": 1989, "24_68": 1990, "68_24": 1991, "52_30": 1992, "30_52": 1993, "9_31": 1994, "31_9": 1995, "58_34": 1996, "34_58": 1997, "8_57": 1998, "57_8": 1999, "29_18": 2000, "18_29": 2001, "42_7": 2002, "7_42": 2003, "42_31": 2004, "31_42": 2005, "68_4": 2006, "4_68": 2007, "64_29": 2008, "29_64": 2009, "64_7": 2010, "7_64": 2011, "14_72": 2012, "72_14": 2013, "49_51": 2014, "51_49": 2015, "60_26": 2016, "26_60": 2017, "4_35": 2018, "35_4": 2019, "40_75": 2020, "75_40": 2021, "8_18": 2022, "18_8": 2023, "29_38": 2024, "38_29": 2025, "32_25": 2026, "25_32": 2027, "74_10": 2028, "10_74": 2029, "3_5": 2030, "5_3": 2031, "19_9": 2032, "9_19": 2033, "45_69": 2034, "69_45": 2035, "17_72": 2036, "72_17": 2037, "48_35": 2038, "35_48": 2039, "18_25": 2040, "25_18": 2041, "46_4": 2042, "4_46": 2043, "64_48": 2044, "48_64": 2045, "42_26": 2046, "26_42": 2047, "10_5": 2048, "5_10": 2049, "51_9": 2050, "9_51": 2051, "37_72": 2052, "72_37": 2053, "19_18": 2054, "18_19": 2055, "59_65": 2056, "65_59": 2057, "72_15": 2058, "15_72": 2059, "7_65": 2060, "65_7": 2061, "8_71": 2062, "71_8": 2063, "30_72": 2064, "72_30": 2065, "12_72": 2066, "72_12": 2067, "28_13": 2068, "17_65": 2069, "65_17": 2070, "52_58": 2071, "58_52": 2072, "49_38": 2073, "38_49": 2074, "30_34": 2075, "34_30": 2076, "19_68": 2077, "68_19": 2078, "74_74": 2079, "13_65": 2080, "65_13": 2081, "10_20": 2082, "20_10": 2083, "61_4": 2084, "4_61": 2085, "49_39": 2086, "39_49": 2087, "23_24": 2088, "24_23": 2089, "32_60": 2090, "60_32": 2091, "18_61": 2092, "61_18": 2093, "75_54": 2094, "54_75": 2095, "33_70": 2096, "70_33": 2097, "41_65": 2098, "65_41": 2099, "43_2": 2100, "2_43": 2101, "8_44": 2102, "44_8": 2103, "32_58": 2104, "58_32": 2105, "40_49": 2106, "49_40": 2107, "35_24": 2108, "24_35": 2109, "36_24": 2110, "24_36": 2111, "7_47": 2112, "47_7": 2113, "7_54": 2114, "54_7": 2115, "7_32": 2116, "32_7": 2117, "23_6": 2118, "6_23": 2119, "74_29": 2120, "29_74": 2121, "5_17": 2122, "17_5": 2123, "58_23": 2124, "23_58": 2125, "25_48": 2126, "48_25": 2127, "3_37": 2128, "37_3": 2129, "54_3": 2130, "3_54": 2131, "10_61": 2132, "61_10": 2133, "3_68": 2134, "68_3": 2135, "21_10": 2136, "10_21": 2137, "49_59": 2138, "59_49": 2139, "32_28": 2140, "28_32": 2141, "42_49": 2142, "49_42": 2143, "44_56": 2144, "56_44": 2145, "48_47": 2146, "47_48": 2147, "48_67": 2148, "67_48": 2149, "57_65": 2150, "65_57": 2151, "27_26": 2152, "26_27": 2153, "27_59": 2154, "59_27": 2155, "58_58": 2156, "26_73": 2157, "73_26": 2158, "43_48": 2159, "48_43": 2160, "52_13": 2161, "13_52": 2162, "6_67": 2163, "67_6": 2164, "59_48": 2165, "48_59": 2166, "38_31": 2167, "31_38": 2168, "38_35": 2169, "35_38": 2170, "18_69": 2171, "69_18": 2172, "69_39": 2173, "39_69": 2174, "3_71": 2175, "71_3": 2176, "34_25": 2177, "25_34": 2178, "27_23": 2179, "23_27": 2180, "65_63": 2181, "63_65": 2182, "10_58": 2183, "58_10": 2184, "47_28": 2185, "28_47": 2186, "48_56": 2187, "56_48": 2188, "48_42": 2189, "42_48": 2190, "3_55": 2191, "55_3": 2192, "8_23": 2193, "23_8": 2194, "29_43": 2195, "43_29": 2196, "29_55": 2197, "55_29": 2198, "20_19": 2199, "19_20": 2200, "55_59": 2201, "59_55": 2202, "64_9": 2203, "9_64": 2204, "58_24": 2205, "24_58": 2206, "38_73": 2207, "73_38": 2208, "38_3": 2209, "3_38": 2210, "43_26": 2211, "26_43": 2212, "36_70": 2213, "70_36": 2214, "36_46": 2215, "46_36": 2216, "36_72": 2217, "72_36": 2218, "29_23": 2219, "23_29": 2220, "3_39": 2221, "39_3": 2222, "19_29": 2223, "29_19": 2224, "62_62": 2225, "52_68": 2226, "68_52": 2227, "35_26": 2228, "26_35": 2229, "29_31": 2230, "31_29": 2231, "15_67": 2232, "67_15": 2233, "55_56": 2234, "56_55": 2235, "25_68": 2236, "68_25": 2237, "41_34": 2238, "34_41": 2239, "3_60": 2240, "60_3": 2241, "50_6": 2242, "6_50": 2243, "50_17": 2244, "17_50": 2245, "24_20": 2246, "20_24": 2247, "33_48": 2248, "48_33": 2249, "59_23": 2250, "23_59": 2251, "54_25": 2252, "25_54": 2253, "71_32": 2254, "32_71": 2255, "39_53": 2256, "53_39": 2257, "66_53": 2258, "53_66": 2259, "54_68": 2260, "68_54": 2261, "58_65": 2262, "65_58": 2263, "6_20": 2264, "20_6": 2265, "34_31": 2266, "31_34": 2267, "13_39": 2268, "39_13": 2269, "29_69": 2270, "69_29": 2271, "45_76": 2272, "76_45": 2273, "17_17": 2274, "55_63": 2275, "63_55": 2276, "66_39": 2277, "39_66": 2278, "15_25": 2279, "25_15": 2280, "37_26": 2281, "26_37": 2282, "39_36": 2283, "36_39": 2284, "35_56": 2285, "56_35": 2286, "40_54": 2287, "54_40": 2288, "52_16": 2289, "16_52": 2290, "34_16": 2291, "16_34": 2292, "67_56": 2293, "56_67": 2294, "67_60": 2295, "60_67": 2296, "67_63": 2297, "63_67": 2298, "45_28": 2299, "28_45": 2300, "8_27": 2301, "27_8": 2302, "6_59": 2303, "59_6": 2304, "5_27": 2305, "27_5": 2306, "14_14": 2307, "43_25": 2308, "25_43": 2309, "34_46": 2310, "46_34": 2311, "42_2": 2312, "2_42": 2313, "34_57": 2314, "57_34": 2315, "51_50": 2316, "50_51": 2317, "68_53": 2318, "53_68": 2319, "49_13": 2320, "13_49": 2321, "66_55": 2322, "55_66": 2323, "29_9": 2324, "9_29": 2325, "50_34": 2326, "34_50": 2327, "5_35": 2328, "35_5": 2329, "21_24": 2330, "24_21": 2331, "21_52": 2332, "52_21": 2333, "21_66": 2334, "66_21": 2335, "21_18": 2336, "18_21": 2337, "15_27": 2338, "27_15": 2339, "3_35": 2340, "35_3": 2341, "40_61": 2342, "61_40": 2343, "49_61": 2344, "61_49": 2345, "40_48": 2346, "48_40": 2347, "68_68": 2348, "54_13": 2349, "13_54": 2350, "57_40": 2351, "40_57": 2352, "8_34": 2353, "34_8": 2354, "45_16": 2355, "16_45": 2356, "66_6": 2357, "6_66": 2358, "29_72": 2359, "72_29": 2360, "59_41": 2361, "41_59": 2362, "8_61": 2363, "61_8": 2364, "72_16": 2365, "16_72": 2366, "28_73": 2367, "73_28": 2368, "63_63": 2369, "63_72": 2370, "72_63": 2371, "63_37": 2372, "37_63": 2373, "63_12": 2374, "12_63": 2375, "63_60": 2376, "60_63": 2377, "69_61": 2378, "61_69": 2379, "14_64": 2380, "64_14": 2381, "21_43": 2382, "43_21": 2383, "48_71": 2384, "71_48": 2385, "26_61": 2386, "61_26": 2387, "67_59": 2388, "59_67": 2389, "75_47": 2390, "47_75": 2391, "75_9": 2392, "9_75": 2393, "75_64": 2394, "64_75": 2395, "59_47": 2396, "47_59": 2397, "34_61": 2398, "61_34": 2399, "11_10": 2400, "10_11": 2401, "11_8": 2402, "8_11": 2403, "30_33": 2404, "33_30": 2405, "41_28": 2406, "28_41": 2407, "46_73": 2408, "73_46": 2409, "42_15": 2410, "15_42": 2411, "37_16": 2412, "16_37": 2413, "35_12": 2414, "12_35": 2415, "35_57": 2416, "57_35": 2417, "10_73": 2418, "73_10": 2419, "67_54": 2420, "54_67": 2421, "52_28": 2422, "28_52": 2423, "55_69": 2424, "69_55": 2425, "18_45": 2426, "45_18": 2427, "43_54": 2428, "54_43": 2429, "15_71": 2430, "71_15": 2431, "15_23": 2432, "23_15": 2433, "20_71": 2434, "71_20": 2435, "42_47": 2436, "47_42": 2437, "52_67": 2438, "67_52": 2439, "58_48": 2440, "48_58": 2441, "45_7": 2442, "7_45": 2443, "45_37": 2444, "37_45": 2445, "45_55": 2446, "55_45": 2447, "61_15": 2448, "15_61": 2449, "58_67": 2450, "67_58": 2451, "16_68": 2452, "68_16": 2453, "30_65": 2454, "65_30": 2455, "43_56": 2456, "56_43": 2457, "6_48": 2458, "48_6": 2459, "9_53": 2460, "53_9": 2461, "3_73": 2462, "73_3": 2463, "76_18": 2464, "18_76": 2465, "76_46": 2466, "46_76": 2467, "7_4": 2468, "4_7": 2469, "37_55": 2470, "55_37": 2471, "45_63": 2472, "63_45": 2473, "45_46": 2474, "46_45": 2475, "48_63": 2476, "63_48": 2477, "24_18": 2478, "18_24": 2479, "4_16": 2480, "16_4": 2481, "72_60": 2482, "60_72": 2483, "21_54": 2484, "54_21": 2485, "67_35": 2486, "35_67": 2487, "10_49": 2488, "49_10": 2489, "10_17": 2490, "17_10": 2491, "10_23": 2492, "23_10": 2493, "60_4": 2494, "4_60": 2495, "18_46": 2496, "46_18": 2497, "45_27": 2498, "27_45": 2499, "66_42": 2500, "42_66": 2501, "13_50": 2502, "50_13": 2503, "30_66": 2504, "66_30": 2505, "46_14": 2506, "14_46": 2507, "59_73": 2508, "73_59": 2509, "52_5": 2510, "5_52": 2511, "19_28": 2512, "28_19": 2513, "18_74": 2514, "74_18": 2515, "5_34": 2516, "34_5": 2517, "36_5": 2518, "5_36": 2519, "37_44": 2520, "44_37": 2521, "37_40": 2522, "40_37": 2523, "37_50": 2524, "50_37": 2525, "70_55": 2526, "55_70": 2527, "54_46": 2528, "46_54": 2529, "8_55": 2530, "55_8": 2531, "74_39": 2532, "39_74": 2533, "54_61": 2534, "61_54": 2535, "61_53": 2536, "53_61": 2537, "23_18": 2538, "18_23": 2539, "21_29": 2540, "29_21": 2541, "18_5": 2542, "5_18": 2543, "68_73": 2544, "73_68": 2545, "66_46": 2546, "46_66": 2547, "6_73": 2548, "73_6": 2549, "32_19": 2550, "19_32": 2551, "45_9": 2552, "9_45": 2553, "33_54": 2554, "54_33": 2555, "15_32": 2556, "32_15": 2557, "43_69": 2558, "69_43": 2559, "30_21": 2560, "21_30": 2561, "54_18": 2562, "18_54": 2563, "41_31": 2564, "31_41": 2565, "6_7": 2566, "7_6": 2567, "49_35": 2568, "35_49": 2569, "21_8": 2570, "8_21": 2571, "21_57": 2572, "57_21": 2573, "54_19": 2574, "19_54": 2575, "57_30": 2576, "30_57": 2577, "6_37": 2578, "37_6": 2579, "3_2": 2580, "2_3": 2581, "49_17": 2582, "17_49": 2583, "29_17": 2584, "17_29": 2585, "74_65": 2586, "65_74": 2587, "58_42": 2588, "42_58": 2589, "73_4": 2590, "4_73": 2591, "27_47": 2592, "47_27": 2593, "32_73": 2594, "73_32": 2595, "57_37": 2596, "37_57": 2597, "32_35": 2598, "35_32": 2599, "38_48": 2600, "48_38": 2601, "57_27": 2602, "27_57": 2603, "57_5": 2604, "5_57": 2605, "57_36": 2606, "36_57": 2607, "18_3": 2608, "3_18": 2609, "39_46": 2610, "46_39": 2611, "43_53": 2612, "53_43": 2613, "65_23": 2614, "23_65": 2615, "52_60": 2616, "60_52": 2617, "59_16": 2618, "16_59": 2619, "15_16": 2620, "16_15": 2621, "32_13": 2622, "13_32": 2623, "43_49": 2624, "49_43": 2625, "19_19": 2626, "59_59": 2627, "9_66": 2628, "66_9": 2629, "52_10": 2630, "10_52": 2631, "28_15": 2632, "15_28": 2633, "48_32": 2634, "32_48": 2635, "48_66": 2636, "66_48": 2637, "58_4": 2638, "4_58": 2639, "49_9": 2640, "9_49": 2641, "50_22": 2642, "22_50": 2643, "33_53": 2644, "53_33": 2645, "29_47": 2646, "47_29": 2647, "44_70": 2648, "70_44": 2649, "4_25": 2650, "25_4": 2651, "29_10": 2652, "10_29": 2653, "34_72": 2654, "72_34": 2655, "36_66": 2656, "66_36": 2657, "57_13": 2658, "13_57": 2659, "5_67": 2660, "67_5": 2661, "28_34": 2662, "34_28": 2663, "8_37": 2664, "37_8": 2665, "6_57": 2666, "57_6": 2667, "23_57": 2668, "57_23": 2669, "15_57": 2670, "57_15": 2671, "30_31": 2672, "31_30": 2673, "49_56": 2674, "56_49": 2675, "54_35": 2676, "35_54": 2677, "48_57": 2678, "57_48": 2679, "71_57": 2680, "57_71": 2681, "59_57": 2682, "57_59": 2683, "59_63": 2684, "63_59": 2685, "73_57": 2686, "57_73": 2687, "54_47": 2688, "47_54": 2689, "54_71": 2690, "71_54": 2691, "20_57": 2692, "57_20": 2693, "54_69": 2694, "69_54": 2695, "42_32": 2696, "32_42": 2697, "25_57": 2698, "57_25": 2699, "34_56": 2700, "56_34": 2701, "6_56": 2702, "56_6": 2703, "54_44": 2704, "44_54": 2705, "74_24": 2706, "24_74": 2707, "74_8": 2708, "8_74": 2709, "15_74": 2710, "74_15": 2711, "10_8": 2712, "8_10": 2713, "74_69": 2714, "69_74": 2715, "55_74": 2716, "74_55": 2717, "74_66": 2718, "66_74": 2719, "74_58": 2720, "58_74": 2721, "74_35": 2722, "35_74": 2723, "74_48": 2724, "48_74": 2725, "74_16": 2726, "16_74": 2727, "74_30": 2728, "30_74": 2729, "74_31": 2730, "31_74": 2731, "74_38": 2732, "38_74": 2733, "74_21": 2734, "21_74": 2735, "34_55": 2736, "55_34": 2737, "19_31": 2738, "31_19": 2739, "24_47": 2740, "47_24": 2741, "66_69": 2742, "69_66": 2743, "58_47": 2744, "47_58": 2745, "42_72": 2746, "72_42": 2747, "24_72": 2748, "72_24": 2749, "30_47": 2750, "47_30": 2751, "33_47": 2752, "47_33": 2753, "9_34": 2754, "34_9": 2755, "9_7": 2756, "7_9": 2757, "9_67": 2758, "67_9": 2759, "18_56": 2760, "56_18": 2761, "9_60": 2762, "60_9": 2763, "9_55": 2764, "55_9": 2765, "21_67": 2766, "67_21": 2767, "9_32": 2768, "32_9": 2769, "61_67": 2770, "67_61": 2771, "67_73": 2772, "73_67": 2773, "58_18": 2774, "18_58": 2775, "67_75": 2776, "75_67": 2777, "55_18": 2778, "18_55": 2779, "67_16": 2780, "16_67": 2781, "33_18": 2782, "18_33": 2783, "43_18": 2784, "18_43": 2785, "42_67": 2786, "67_42": 2787, "23_67": 2788, "67_23": 2789, "60_53": 2790, "53_60": 2791, "56_60": 2792, "60_56": 2793, "70_47": 2794, "47_70": 2795, "8_47": 2796, "47_8": 2797, "49_47": 2798, "47_49": 2799, "23_69": 2800, "69_23": 2801, "25_31": 2802, "31_25": 2803, "42_69": 2804, "69_42": 2805, "42_63": 2806, "63_42": 2807, "42_18": 2808, "18_42": 2809, "23_73": 2810, "73_23": 2811, "42_55": 2812, "55_42": 2813, "25_26": 2814, "26_25": 2815, "6_72": 2816, "72_6": 2817, "58_72": 2818, "72_58": 2819, "70_35": 2820, "35_70": 2821, "42_16": 2822, "16_42": 2823, "42_30": 2824, "30_42": 2825, "42_37": 2826, "37_42": 2827, "42_68": 2828, "68_42": 2829, "42_73": 2830, "73_42": 2831, "30_26": 2832, "26_30": 2833, "58_63": 2834, "63_58": 2835, "23_56": 2836, "56_23": 2837, "42_56": 2838, "56_42": 2839, "42_74": 2840, "74_42": 2841, "20_73": 2842, "73_20": 2843, "33_63": 2844, "63_33": 2845, "59_31": 2846, "31_59": 2847, "33_72": 2848, "72_33": 2849, "48_7": 2850, "7_48": 2851, "47_34": 2852, "34_47": 2853, "48_16": 2854, "16_48": 2855, "30_55": 2856, "55_30": 2857, "48_37": 2858, "37_48": 2859, "28_18": 2860, "18_28": 2861, "28_55": 2862, "55_28": 2863, "28_56": 2864, "56_28": 2865, "58_56": 2866, "56_58": 2867, "28_37": 2868, "37_28": 2869, "28_16": 2870, "16_28": 2871, "28_48": 2872, "48_28": 2873, "28_67": 2874, "67_28": 2875, "28_68": 2876, "68_28": 2877, "33_58": 2878, "58_33": 2879, "28_74": 2880, "74_28": 2881, "68_8": 2882, "8_68": 2883, "21_56": 2884, "56_21": 2885, "6_74": 2886, "74_6": 2887, "56_74": 2888, "74_56": 2889, "60_74": 2890, "74_60": 2891, "35_66": 2892, "66_35": 2893, "26_74": 2894, "74_26": 2895, "37_60": 2896, "60_37": 2897, "70_13": 2898, "13_70": 2899, "57_74": 2900, "74_57": 2901, "18_9": 2902, "9_18": 2903, "63_74": 2904, "74_63": 2905, "18_35": 2906, "35_18": 2907, "61_61": 2908, "55_72": 2909, "72_55": 2910, "59_74": 2911, "74_59": 2912, "70_74": 2913, "74_70": 2914, "37_74": 2915, "74_37": 2916, "32_74": 2917, "74_32": 2918, "56_45": 2919, "45_56": 2920, "33_31": 2921, "31_33": 2922, "63_9": 2923, "9_63": 2924, "45_73": 2925, "73_45": 2926, "47_45": 2927, "45_47": 2928, "18_71": 2929, "71_18": 2930, "43_8": 2931, "8_43": 2932, "72_13": 2933, "13_72": 2934, "21_21": 2935, "6_19": 2936, "19_6": 2937, "54_74": 2938, "74_54": 2939, "20_67": 2940, "67_20": 2941, "18_13": 2942, "13_18": 2943, "50_74": 2944, "74_50": 2945, "56_33": 2946, "33_56": 2947, "18_60": 2948, "60_18": 2949, "63_73": 2950, "73_63": 2951, "47_9": 2952, "9_47": 2953, "43_74": 2954, "74_43": 2955, "49_69": 2956, "69_49": 2957, "49_60": 2958, "60_49": 2959, "34_6": 2960, "6_34": 2961, "33_32": 2962, "32_33": 2963, "71_43": 2964, "43_71": 2965, "67_19": 2966, "19_67": 2967, "32_51": 2968, "51_32": 2969, "12_60": 2970, "60_12": 2971, "12_43": 2972, "43_12": 2973, "8_28": 2974, "28_8": 2975, "12_18": 2976, "18_12": 2977, "8_51": 2978, "51_8": 2979, "66_51": 2980, "51_66": 2981, "8_56": 2982, "56_8": 2983, "16_51": 2984, "51_16": 2985, "30_51": 2986, "51_30": 2987, "66_28": 2988, "28_66": 2989, "12_71": 2990, "71_12": 2991, "12_59": 2992, "70_51": 2993, "51_70": 2994, "68_51": 2995, "51_68": 2996, "12_69": 2997, "69_12": 2998, "12_26": 2999, "26_12": 3000, "70_28": 3001, "28_70": 3002, "51_63": 3003, "63_51": 3004, "68_31": 3005, "31_68": 3006, "12_61": 3007, "61_12": 3008, "12_68": 3009, "68_12": 3010, "17_67": 3011, "67_17": 3012, "6_51": 3013, "51_6": 3014, "54_51": 3015, "51_54": 3016, "33_29": 3017, "29_33": 3018, "23_34": 3019, "34_23": 3020, "21_31": 3021, "31_21": 3022, "30_56": 3023, "56_30": 3024, "13_63": 3025, "63_13": 3026, "23_16": 3027, "16_23": 3028, "8_6": 3029, "6_8": 3030, "8_20": 3031, "20_8": 3032, "13_66": 3033, "66_13": 3034, "21_25": 3035, "25_21": 3036, "25_29": 3037, "29_25": 3038, "43_6": 3039, "6_43": 3040, "25_74": 3041, "74_25": 3042, "9_48": 3043, "48_9": 3044, "21_6": 3045, "6_21": 3046, "21_23": 3047, "23_21": 3048, "32_23": 3049, "23_32": 3050, "25_59": 3051, "59_25": 3052, "42_29": 3053, "29_42": 3054, "42_8": 3055, "8_42": 3056, "42_23": 3057, "23_42": 3058, "67_13": 3059, "13_67": 3060, "13_23": 3061, "23_13": 3062, "12_33": 3063, "12_5": 3064, "5_12": 3065, "38_12": 3066, "12_38": 3067, "68_21": 3068, "21_68": 3069, "32_21": 3070, "21_32": 3071, "59_7": 3072, "7_59": 3073, "59_58": 3074, "58_59": 3075, "25_52": 3076, "52_25": 3077, "42_52": 3078, "52_42": 3079, "59_66": 3080, "66_59": 3081, "6_52": 3082, "52_6": 3083, "58_21": 3084, "21_58": 3085, "16_53": 3086, "53_16": 3087, "72_76": 3088, "76_72": 3089, "76_9": 3090, "9_76": 3091, "76_76": 3092, "76_26": 3093, "26_76": 3094, "46_9": 3095, "9_46": 3096, "76_24": 3097, "24_76": 3098, "26_9": 3099, "9_26": 3100, "76_48": 3101, "48_76": 3102, "76_5": 3103, "5_76": 3104, "76_38": 3105, "38_76": 3106, "76_65": 3107, "65_76": 3108, "76_17": 3109, "17_76": 3110, "76_16": 3111, "16_76": 3112, "76_6": 3113, "6_76": 3114, "24_7": 3115, "7_24": 3116, "76_55": 3117, "55_76": 3118, "76_47": 3119, "47_76": 3120, "8_9": 3121, "9_8": 3122, "76_51": 3123, "51_76": 3124, "34_64": 3125, "64_34": 3126, "76_27": 3127, "27_76": 3128, "21_9": 3129, "9_21": 3130, "9_30": 3131, "30_9": 3132, "42_9": 3133, "9_42": 3134, "58_9": 3135, "9_58": 3136, "70_9": 3137, "9_70": 3138, "51_61": 3139, "61_51": 3140, "25_61": 3141, "61_25": 3142, "8_19": 3143, "19_8": 3144, "66_61": 3145, "61_66": 3146, "8_5": 3147, "5_8": 3148, "8_38": 3149, "38_8": 3150, "25_72": 3151, "72_25": 3152, "12_6": 3153, "12_15": 3154, "66_19": 3155, "19_66": 3156, "30_61": 3157, "61_30": 3158, "43_61": 3159, "61_43": 3160, "59_61": 3161, "61_59": 3162, "34_7": 3163, "7_34": 3164, "73_61": 3165, "61_73": 3166, "48_61": 3167, "61_48": 3168, "19_61": 3169, "61_19": 3170, "19_57": 3171, "57_19": 3172, "19_52": 3173, "52_19": 3174, "19_42": 3175, "42_19": 3176, "19_7": 3177, "7_19": 3178, "19_48": 3179, "48_19": 3180, "19_26": 3181, "26_19": 3182, "19_16": 3183, "16_19": 3184, "11_11": 3185, "71_11": 3186, "11_71": 3187, "11_24": 3188, "24_11": 3189, "11_29": 3190, "29_11": 3191, "11_65": 3192, "65_11": 3193, "23_11": 3194, "11_23": 3195, "48_11": 3196, "11_48": 3197, "32_11": 3198, "11_32": 3199, "49_65": 3200, "65_49": 3201, "11_49": 3202, "49_11": 3203, "11_66": 3204, "66_11": 3205, "11_6": 3206, "6_11": 3207, "59_71": 3208, "71_59": 3209, "11_15": 3210, "15_11": 3211, "11_61": 3212, "61_11": 3213, "33_11": 3214, "11_33": 3215, "11_13": 3216, "13_11": 3217, "11_59": 3218, "59_11": 3219, "11_68": 3220, "68_11": 3221, "11_42": 3222, "42_11": 3223, "11_34": 3224, "34_11": 3225, "11_26": 3226, "26_11": 3227, "11_4": 3228, "4_11": 3229, "54_11": 3230, "11_54": 3231, "41_68": 3232, "68_41": 3233, "41_70": 3234, "70_41": 3235, "41_29": 3236, "29_41": 3237, "32_41": 3238, "41_32": 3239, "43_41": 3240, "41_43": 3241, "48_23": 3242, "23_48": 3243, "48_2": 3244, "2_48": 3245, "41_15": 3246, "15_41": 3247, "41_48": 3248, "48_41": 3249, "41_58": 3250, "58_41": 3251, "43_13": 3252, "13_43": 3253, "4_41": 3254, "41_4": 3255, "41_72": 3256, "72_41": 3257, "41_26": 3258, "26_41": 3259, "41_53": 3260, "53_41": 3261, "41_24": 3262, "24_41": 3263, "2_24": 3264, "24_2": 3265, "32_59": 3266, "59_32": 3267, "2_34": 3268, "34_2": 3269, "2_14": 3270, "14_2": 3271, "42_34": 3272, "34_42": 3273, "42_41": 3274, "41_42": 3275, "6_2": 3276, "2_6": 3277, "41_3": 3278, "3_41": 3279, "28_71": 3280, "71_28": 3281, "20_23": 3282, "23_20": 3283, "20_49": 3284, "49_20": 3285, "38_71": 3286, "71_38": 3287, "71_74": 3288, "74_71": 3289, "33_71": 3290, "71_33": 3291, "14_70": 3292, "70_14": 3293, "19_50": 3294, "50_19": 3295, "14_23": 3296, "23_14": 3297, "14_24": 3298, "24_14": 3299, "14_19": 3300, "19_14": 3301, "38_19": 3302, "19_38": 3303, "14_61": 3304, "61_14": 3305, "19_13": 3306, "13_19": 3307, "14_13": 3308, "13_14": 3309, "19_59": 3310, "59_19": 3311, "14_49": 3312, "49_14": 3313, "58_69": 3314, "69_58": 3315, "15_68": 3316, "68_15": 3317, "33_67": 3318, "67_33": 3319, "13_53": 3320, "53_13": 3321, "44_52": 3322, "52_44": 3323, "50_16": 3324, "16_50": 3325, "48_22": 3326, "22_48": 3327, "66_22": 3328, "22_66": 3329, "49_22": 3330, "22_49": 3331, "8_22": 3332, "22_8": 3333, "15_22": 3334, "22_15": 3335, "58_46": 3336, "46_58": 3337, "22_45": 3338, "45_22": 3339, "24_22": 3340, "22_24": 3341, "72_68": 3342, "68_72": 3343, "22_68": 3344, "68_22": 3345, "22_42": 3346, "42_22": 3347, "22_71": 3348, "71_22": 3349, "22_16": 3350, "16_22": 3351, "23_22": 3352, "22_23": 3353, "22_5": 3354, "5_22": 3355, "34_22": 3356, "22_34": 3357, "4_22": 3358, "22_4": 3359, "43_68": 3360, "68_43": 3361, "22_32": 3362, "32_22": 3363, "22_10": 3364, "10_22": 3365, "22_29": 3366, "29_22": 3367, "62_11": 3368, "11_62": 3369, "48_17": 3370, "17_48": 3371, "36_48": 3372, "48_36": 3373, "30_2": 3374, "2_30": 3375, "71_14": 3376, "14_71": 3377, "2_26": 3378, "26_2": 3379, "62_69": 3380, "69_62": 3381, "62_17": 3382, "17_62": 3383, "36_34": 3384, "34_36": 3385, "36_29": 3386, "29_36": 3387, "64_16": 3388, "16_64": 3389, "2_67": 3390, "67_2": 3391, "2_72": 3392, "72_2": 3393, "2_31": 3394, "31_2": 3395, "2_55": 3396, "55_2": 3397, "2_19": 3398, "19_2": 3399, "2_8": 3400, "8_2": 3401, "2_69": 3402, "69_2": 3403, "2_38": 3404, "38_2": 3405, "2_18": 3406, "18_2": 3407, "2_32": 3408, "32_2": 3409, "2_66": 3410, "66_2": 3411, "13_9": 3412, "9_13": 3413, "60_73": 3414, "73_60": 3415, "2_5": 3416, "5_2": 3417, "71_51": 3418, "51_71": 3419, "71_21": 3420, "21_71": 3421, "62_70": 3422, "70_62": 3423, "36_67": 3424, "67_36": 3425, "36_6": 3426, "6_36": 3427, "23_66": 3428, "66_23": 3429, "2_61": 3430, "61_2": 3431, "2_53": 3432, "53_2": 3433, "2_59": 3434, "59_2": 3435, "2_68": 3436, "68_2": 3437, "71_69": 3438, "69_71": 3439, "46_2": 3440, "2_46": 3441, "71_16": 3442, "16_71": 3443, "71_56": 3444, "56_71": 3445, "36_49": 3446, "49_36": 3447, "71_45": 3448, "45_71": 3449, "2_65": 3450, "65_2": 3451, "2_21": 3452, "21_2": 3453, "2_33": 3454, "33_2": 3455, "2_56": 3456, "56_2": 3457, "2_47": 3458, 