{"PAD": 0, "DUMMY_START_RELATION": 1, "UNK": 2, "102_99": 3, "33_177": 4, "93_177": 5, "59_59": 6, "143_15": 7, "70_177": 8, "198_96": 9, "166_99": 10, "93_99": 11, "166_71": 12, "93_71": 13, "74_75": 14, "84_177": 15, "147_177": 16, "53_177": 17, "166_177": 18, "18_177": 19, "108_177": 20, "27_177": 21, "31_177": 22, "198_177": 23, "166_75": 24, "84_99": 25, "85_177": 26, "130_177": 27, "111_99": 28, "33_99": 29, "102_177": 30, "42_75": 31, "111_177": 32, "98_177": 33, "102_71": 34, "198_15": 35, "15_71": 36, "108_99": 37, "96_177": 38, "131_177": 39, "25_71": 40, "33_75": 41, "127_11": 42, "25_177": 43, "27_99": 44, "147_99": 45, "74_15": 46, "197_177": 47, "108_81": 48, "81_108": 49, "145_82": 50, "82_145": 51, "85_126": 52, "126_85": 53, "172_194": 54, "194_172": 55, "13_157": 56, "157_13": 57, "148_10": 58, "10_148": 59, "176_176": 60, "45_145": 61, "145_45": 62, "45_110": 63, "110_45": 64, "197_119": 65, "119_197": 66, "197_52": 67, "52_197": 68, "167_157": 69, "157_167": 70, "21_38": 71, "38_21": 72, "148_103": 73, "103_148": 74, "152_110": 75, "110_152": 76, "152_152": 77, "97_41": 78, "41_97": 79, "70_63": 80, "63_70": 81, "6_118": 82, "118_6": 83, "39_181": 84, "181_39": 85, "39_82": 86, "82_39": 87, "197_10": 88, "10_197": 89, "82_173": 90, "173_82": 91, "180_180": 92, "180_187": 93, "187_180": 94, "31_10": 95, "10_31": 96, "5_24": 97, "24_5": 98, "5_52": 99, "52_5": 100, "5_70": 101, "70_5": 102, "31_5": 103, "5_31": 104, "104_157": 105, "157_104": 106, "182_26": 107, "26_182": 108, "147_25": 109, "25_147": 110, "75_157": 111, "157_75": 112, "75_81": 113, "81_75": 114, "36_110": 115, "110_36": 116, "87_61": 117, "61_87": 118, "21_52": 119, "52_21": 120, "170_157": 121, "157_170": 122, "170_110": 123, "110_170": 124, "181_110": 125, "110_181": 126, "181_185": 127, "185_181": 128, "62_62": 129, "62_192": 130, "192_62": 131, "62_128": 132, "128_62": 133, "112_112": 134, "40_40": 135, "67_149": 136, "149_67": 137, "82_82": 138, "82_26": 139, "26_82": 140, "148_61": 141, "61_148": 142, "147_61": 143, "61_147": 144, "124_4": 145, "4_124": 146, "124_140": 147, "140_124": 148, "124_124": 149, "124_112": 150, "112_124": 151, "136_136": 152, "136_129": 153, "129_136": 154, "58_58": 155, "147_52": 156, "52_147": 157, "124_200": 158, "200_124": 159, "94_110": 160, "110_94": 161, "6_119": 162, "119_6": 163, "87_10": 164, "10_87": 165, "131_119": 166, "119_131": 167, "142_157": 168, "157_142": 169, "142_104": 170, "104_142": 171, "142_82": 172, "82_142": 173, "142_142": 174, "75_33": 175, "33_71": 176, "71_33": 177, "14_14": 178, "138_198": 179, "198_138": 180, "6_25": 181, "25_6": 182, "181_81": 183, "81_181": 184, "94_75": 185, "75_94": 186, "85_198": 187, "198_85": 188, "74_53": 189, "53_74": 190, "57_5": 191, "5_57": 192, "111_71": 193, "71_111": 194, "111_110": 195, "110_111": 196, "111_180": 197, "180_111": 198, "111_185": 199, "185_111": 200, "173_110": 201, "110_173": 202, "131_25": 203, "25_131": 204, "155_78": 205, "78_155": 206, "155_184": 207, "184_155": 208, "124_125": 209, "125_124": 210, "186_181": 211, "181_186": 212, "186_46": 213, "46_186": 214, "186_140": 215, "140_186": 216, "21_119": 217, "119_21": 218, "57_198": 219, "198_57": 220, "96_85": 221, "85_96": 222, "96_25": 223, "25_96": 224, "31_164": 225, "164_31": 226, "77_77": 227, "77_176": 228, "176_77": 229, "96_5": 230, "5_96": 231, "64_157": 232, "157_64": 233, "64_66": 234, "66_64": 235, "64_82": 236, "82_64": 237, "131_10": 238, "10_131": 239, "5_72": 240, "72_5": 241, "148_164": 242, "164_148": 243, "147_133": 244, "133_147": 245, "127_22": 246, "22_127": 247, "21_10": 248, "10_21": 249, "82_157": 250, "157_82": 251, "82_66": 252, "66_82": 253, "149_149": 254, "149_104": 255, "104_149": 256, "173_151": 257, "151_173": 258, "5_48": 259, "48_5": 260, "140_140": 261, "140_62": 262, "62_140": 263, "140_78": 264, "78_140": 265, "139_110": 266, "110_139": 267, "198_24": 268, "24_198": 269, "198_70": 270, "70_198": 271, "121_110": 272, "110_121": 273, "123_191": 274, "191_123": 275, "123_123": 276, "82_174": 277, "174_82": 278, "87_133": 279, "133_87": 280, "78_78": 281, "104_104": 282, "97_97": 283, "87_118": 284, "118_87": 285, "171_80": 286, "80_171": 287, "195_157": 288, "157_195": 289, "195_104": 290, "104_195": 291, "148_119": 292, "119_148": 293, "197_70": 294, "70_197": 295, "197_25": 296, "25_197": 297, "85_85": 298, "134_134": 299, "187_81": 300, "81_187": 301, "199_142": 302, "142_199": 303, "143_78": 304, "78_143": 305, "200_80": 306, "80_200": 307, "82_110": 308, "110_82": 309, "47_47": 310, "136_124": 311, "124_136": 312, "136_160": 313, "160_136": 314, "140_77": 315, "77_140": 316, "140_200": 317, "200_140": 318, "140_12": 319, "12_140": 320, "175_98": 321, "98_175": 322, "175_128": 323, "128_175": 324, "175_110": 325, "110_175": 326, "87_103": 327, "103_87": 328, "97_174": 329, "174_97": 330, "197_38": 331, "38_197": 332, "36_81": 333, "81_36": 334, "100_100": 335, "100_144": 336, "144_100": 337, "36_36": 338, "2_180": 339, "180_2": 340, "148_96": 341, "96_148": 342, "31_133": 343, "133_31": 344, "6_70": 345, "70_6": 346, "84_94": 347, "94_84": 348, "197_164": 349, "164_197": 350, "158_142": 351, "142_158": 352, "2_162": 353, "162_2": 354, "5_140": 355, "140_5": 356, "95_105": 357, "105_95": 358, "131_164": 359, "164_131": 360, "159_80": 361, "80_159": 362, "159_184": 363, "184_159": 364, "77_62": 365, "62_77": 366, "77_192": 367, "192_77": 368, "186_110": 369, "110_186": 370, "66_66": 371, "162_96": 372, "96_162": 373, "162_116": 374, "116_162": 375, "162_78": 376, "78_162": 377, "162_162": 378, "162_77": 379, "77_162": 380, "162_62": 381, "62_162": 382, "162_140": 383, "140_162": 384, "181_57": 385, "57_181": 386, "181_71": 387, "71_181": 388, "181_180": 389, "180_181": 390, "124_109": 391, "109_124": 392, "77_13": 393, "13_77": 394, "77_80": 395, "80_77": 396, "15_32": 397, "32_15": 398, "147_10": 399, "10_147": 400, "20_76": 401, "76_20": 402, "198_150": 403, "150_198": 404, "195_12": 405, "12_195": 406, "195_142": 407, "142_195": 408, "71_110": 409, "110_71": 410, "71_108": 411, "108_71": 412, "71_180": 413, "180_71": 414, "148_133": 415, "133_148": 416, "177_108": 417, "110_12": 418, "12_110": 419, "87_119": 420, "119_87": 421, "21_25": 422, "25_21": 423, "64_26": 424, "26_64": 425, "64_182": 426, "182_64": 427, "64_149": 428, "149_64": 429, "64_174": 430, "174_64": 431, "6_61": 432, "61_6": 433, "53_128": 434, "128_53": 435, "47_180": 436, "180_47": 437, "189_182": 438, "182_189": 439, "189_174": 440, "174_189": 441, "74_38": 442, "38_74": 443, "147_119": 444, "119_147": 445, "120_120": 446, "120_79": 447, "79_120": 448, "120_5": 449, "5_120": 450, "120_112": 451, "112_120": 452, "16_57": 453, "57_16": 454, "66_157": 455, "157_66": 456, "180_170": 457, "170_180": 458, "182_41": 459, "41_182": 460, "64_104": 461, "104_64": 462, "60_60": 463, "82_150": 464, "150_82": 465, "57_98": 466, "98_57": 467, "198_187": 468, "187_198": 469, "96_153": 470, "153_96": 471, "145_142": 472, "142_145": 473, "87_164": 474, "164_87": 475, "87_131": 476, "131_87": 477, "57_57": 478, "148_25": 479, "25_148": 480, "53_25": 481, "25_53": 482, "143_80": 483, "80_143": 484, "181_181": 485, "99_108": 486, "20_125": 487, "125_20": 488, "20_59": 489, "59_20": 490, "56_56": 491, "6_133": 492, "133_6": 493, "82_75": 494, "75_82": 495, "72_133": 496, "133_72": 497, "21_103": 498, "103_21": 499, "184_110": 500, "110_184": 501, "184_184": 502, "184_82": 503, "82_184": 504, "184_88": 505, "88_184": 506, "172_70": 507, "70_172": 508, "106_190": 509, "190_106": 510, "110_110": 511, "147_38": 512, "38_147": 513, "31_61": 514, "61_31": 515, "78_12": 516, "12_78": 517, "181_4": 518, "4_181": 519, "123_80": 520, "80_123": 521, "123_176": 522, "176_123": 523, "123_41": 524, "41_123": 525, "123_60": 526, "60_123": 527, "123_68": 528, "68_123": 529, "123_182": 530, "182_123": 531, "21_164": 532, "164_21": 533, "5_5": 534, "170_142": 535, "142_170": 536, "170_199": 537, "199_170": 538, "187_104": 539, "104_187": 540, "77_200": 541, "200_77": 542, "77_12": 543, "12_77": 544, "64_110": 545, "110_64": 546, "64_36": 547, "36_64": 548, "96_99": 549, "99_96": 550, "6_103": 551, "103_6": 552, "197_103": 553, "103_197": 554, "12_64": 555, "64_12": 556, "12_170": 557, "170_12": 558, "12_142": 559, "142_12": 560, "12_200": 561, "200_12": 562, "12_184": 563, "184_12": 564, "12_176": 565, "176_12": 566, "12_45": 567, "45_12": 568, "12_12": 569, "12_167": 570, "167_12": 571, "12_145": 572, "145_12": 573, "12_80": 574, "80_12": 575, "12_157": 576, "157_12": 577, "12_104": 578, "104_12": 579, "12_44": 580, "44_12": 581, "15_109": 582, "109_15": 583, "24_24": 584, "24_184": 585, "184_24": 586, "24_185": 587, "185_24": 588, "57_27": 589, "27_57": 590, "147_103": 591, "103_147": 592, "70_106": 593, "106_70": 594, "87_52": 595, "52_87": 596, "190_24": 597, "24_190": 598, "167_176": 599, "176_167": 600, "167_184": 601, "184_167": 602, "153_80": 603, "80_153": 604, "39_200": 605, "200_39": 606, "12_81": 607, "81_12": 608, "151_151": 609, "129_129": 610, "117_187": 611, "187_117": 612, "117_117": 613, "12_82": 614, "82_12": 615, "97_35": 616, "35_97": 617, "12_79": 618, "79_12": 619, "12_144": 620, "144_12": 621, "53_85": 622, "85_53": 623, "149_82": 624, "82_149": 625, "198_72": 626, "72_198": 627, "131_38": 628, "38_131": 629, "93_5": 630, "5_93": 631, "53_38": 632, "38_53": 633, "40_194": 634, "194_40": 635, "165_110": 636, "110_165": 637, "135_135": 638, "78_157": 639, "157_78": 640, "110_140": 641, "140_110": 642, "110_145": 643, "145_110": 644, "124_127": 645, "127_124": 646, "155_157": 647, "157_155": 648, "155_81": 649, "81_155": 650, "162_69": 651, "69_162": 652, "195_66": 653, "66_195": 654, "131_118": 655, "118_131": 656, "23_128": 657, "128_23": 658, "198_181": 659, "181_198": 660, "148_52": 661, "52_148": 662, "12_180": 663, "180_12": 664, "12_116": 665, "116_12": 666, "12_36": 667, "36_12": 668, "78_145": 669, "145_78": 670, "31_103": 671, "103_31": 672, "154_81": 673, "81_154": 674, "108_107": 675, "107_108": 676, "96_110": 677, "110_96": 678, "62_12": 679, "12_62": 680, "62_13": 681, "13_62": 682, "96_109": 683, "109_96": 684, "99_110": 685, "110_99": 686, "99_80": 687, "80_99": 688, "99_11": 689, "11_99": 690, "95_55": 691, "55_95": 692, "78_94": 693, "94_78": 694, "172_182": 695, "182_172": 696, "198_198": 697, "111_143": 698, "143_111": 699, "111_14": 700, "14_111": 701, "111_79": 702, "79_111": 703, "111_55": 704, "55_111": 705, "111_161": 706, "161_111": 707, "193_157": 708, "157_193": 709, "111_75": 710, "75_111": 711, "111_94": 712, "94_111": 713, "24_53": 714, "53_24": 715, "24_85": 716, "85_24": 717, "24_74": 718, "74_24": 719, "11_11": 720, "103_53": 721, "53_103": 722, "147_27": 723, "27_147": 724, "153_79": 725, "79_153": 726, "153_12": 727, "12_153": 728, "153_153": 729, "153_110": 730, "110_153": 731, "155_79": 732, "79_155": 733, "17_185": 734, "185_17": 735, "50_50": 736, "190_125": 737, "125_190": 738, "136_74": 739, "74_136": 740, "136_24": 741, "24_136": 742, "154_36": 743, "36_154": 744, "64_37": 745, "37_64": 746, "64_3": 747, "3_64": 748, "16_16": 749, "117_81": 750, "81_117": 751, "114_198": 752, "198_114": 753, "90_124": 754, "124_90": 755, "154_187": 756, "187_154": 757, "154_185": 758, "185_154": 759, "87_38": 760, "38_87": 761, "195_82": 762, "82_195": 763, "109_74": 764, "74_109": 765, "72_98": 766, "98_72": 767, "75_75": 768, "55_57": 769, "57_55": 770, "50_36": 771, "36_50": 772, "50_180": 773, "180_50": 774, "158_82": 775, "82_158": 776, "55_153": 777, "153_55": 778, "58_110": 779, "110_58": 780, "103_61": 781, "61_103": 782, "55_75": 783, "75_55": 784, "55_79": 785, "79_55": 786, "55_55": 787, "198_95": 788, "95_198": 789, "111_95": 790, "95_111": 791, "78_77": 792, "77_78": 793, "78_195": 794, "195_78": 795, "78_200": 796, "200_78": 797, "78_82": 798, "82_78": 799, "78_39": 800, "39_78": 801, "78_184": 802, "184_78": 803, "78_64": 804, "64_78": 805, "78_65": 806, "65_78": 807, "78_66": 808, "66_78": 809, "78_104": 810, "104_78": 811, "78_176": 812, "176_78": 813, "78_180": 814, "180_78": 815, "78_71": 816, "71_78": 817, "78_110": 818, "110_78": 819, "78_14": 820, "14_78": 821, "78_187": 822, "187_78": 823, "78_161": 824, "161_78": 825, "78_75": 826, "75_78": 827, "78_116": 828, "116_78": 829, "71_36": 830, "36_71": 831, "71_5": 832, "5_71": 833, "190_42": 834, "42_190": 835, "31_25": 836, "25_31": 837, "91_198": 838, "198_91": 839, "91_196": 840, "196_91": 841, "129_81": 842, "81_129": 843, "55_110": 844, "110_55": 845, "55_78": 846, "78_55": 847, "55_12": 848, "12_55": 849, "55_185": 850, "185_55": 851, "130_53": 852, "53_130": 853, "143_149": 854, "149_143": 855, "49_40": 856, "40_49": 857, "49_49": 858, "186_185": 859, "185_186": 860, "148_118": 861, "118_148": 862, "182_70": 863, "70_182": 864, "182_67": 865, "67_182": 866, "182_74": 867, "74_182": 868, "21_133": 869, "133_21": 870, "99_99": 871, "99_177": 872, "177_99": 873, "67_183": 874, "183_67": 875, "184_142": 876, "142_184": 877, "184_170": 878, "170_184": 879, "85_42": 880, "42_85": 881, "85_57": 882, "57_85": 883, "5_103": 884, "103_5": 885, "121_81": 886, "81_121": 887, "121_121": 888, "180_110": 889, "110_180": 890, "180_198": 891, "198_180": 892, "140_127": 893, "127_140": 894, "179_41": 895, "41_179": 896, "110_185": 897, "185_110": 898, "110_134": 899, "134_110": 900, "197_118": 901, "118_197": 902, "94_180": 903, "180_94": 904, "147_164": 905, "164_147": 906, "31_52": 907, "52_31": 908, "79_79": 909, "187_48": 910, "48_187": 911, "187_187": 912, "171_192": 913, "192_171": 914, "69_84": 915, "84_69": 916, "124_70": 917, "70_124": 918, "131_61": 919, "61_131": 920, "48_81": 921, "81_48": 922, "6_52": 923, "52_6": 924, "53_170": 925, "170_53": 926, "155_176": 927, "176_155": 928, "193_99": 929, "99_193": 930, "121_180": 931, "180_121": 932, "24_180": 933, "180_24": 934, "147_118": 935, "118_147": 936, "27_85": 937, "85_27": 938, "182_81": 939, "81_182": 940, "182_196": 941, "196_182": 942, "182_179": 943, "179_182": 944, "171_12": 945, "12_171": 946, "114_112": 947, "112_114": 948, "114_105": 949, "105_114": 950, "114_24": 951, "24_114": 952, "85_113": 953, "113_85": 954, "140_176": 955, "176_140": 956, "140_80": 957, "80_140": 958, "88_146": 959, "146_88": 960, "169_110": 961, "110_169": 962, "75_180": 963, "180_75": 964, "77_180": 965, "180_77": 966, "142_200": 967, "200_142": 968, "176_80": 969, "80_176": 970, "176_180": 971, "180_176": 972, "55_125": 973, "125_55": 974, "55_53": 975, "53_55": 976, "131_32": 977, "32_131": 978, "95_180": 979, "180_95": 980, "78_13": 981, "13_78": 982, "78_24": 983, "24_78": 984, "158_66": 985, "66_158": 986, "108_11": 987, "11_108": 988, "108_166": 989, "166_108": 990, "41_12": 991, "12_41": 992, "106_133": 993, "133_106": 994, "181_12": 995, "12_181": 996, "184_176": 997, "176_184": 998, "184_80": 999, "80_184": 1000, "111_111": 1001, "134_52": 1002, "52_134": 1003, "145_157": 1004, "157_145": 1005, "67_26": 1006, "26_67": 1007, "111_81": 1008, "81_111": 1009, "70_85": 1010, "85_70": 1011, "105_157": 1012, "157_105": 1013, "131_133": 1014, "133_131": 1015, "171_157": 1016, "157_171": 1017, "64_145": 1018, "145_64": 1019, "95_94": 1020, "94_95": 1021, "95_95": 1022, "155_104": 1023, "104_155": 1024, "44_80": 1025, "80_44": 1026, "49_194": 1027, "194_49": 1028, "49_12": 1029, "12_49": 1030, "65_65": 1031, "67_67": 1032, "67_174": 1033, "174_67": 1034, "31_118": 1035, "118_31": 1036, "77_104": 1037, "104_77": 1038, "77_82": 1039, "82_77": 1040, "6_38": 1041, "38_6": 1042, "18_92": 1043, "92_18": 1044, "87_25": 1045, "25_87": 1046, "106_106": 1047, "194_194": 1048, "65_140": 1049, "140_65": 1050, "78_111": 1051, "111_78": 1052, "78_142": 1053, "142_78": 1054, "185_185": 1055, "145_145": 1056, "12_66": 1057, "66_12": 1058, "170_194": 1059, "194_170": 1060, "31_128": 1061, "128_31": 1062, "67_24": 1063, "24_67": 1064, "167_150": 1065, "150_167": 1066, "109_157": 1067, "157_109": 1068, "74_13": 1069, "13_74": 1070, "186_81": 1071, "81_186": 1072, "199_82": 1073, "82_199": 1074, "136_13": 1075, "13_136": 1076, "145_134": 1077, "134_145": 1078, "145_140": 1079, "140_145": 1080, "78_183": 1081, "183_78": 1082, "78_171": 1083, "171_78": 1084, "124_25": 1085, "25_124": 1086, "125_127": 1087, "127_125": 1088, "6_164": 1089, "164_6": 1090, "166_11": 1091, "11_166": 1092, "154_146": 1093, "146_154": 1094, "39_157": 1095, "157_39": 1096, "161_81": 1097, "81_161": 1098, "77_39": 1099, "39_77": 1100, "77_123": 1101, "123_77": 1102, "77_110": 1103, "110_77": 1104, "171_82": 1105, "82_171": 1106, "30_198": 1107, "198_30": 1108, "24_70": 1109, "70_24": 1110, "197_133": 1111, "133_197": 1112, "140_180": 1113, "180_140": 1114, "24_13": 1115, "13_24": 1116, "82_104": 1117, "104_82": 1118, "82_180": 1119, "180_82": 1120, "95_84": 1121, "84_95": 1122, "45_104": 1123, "104_45": 1124, "112_79": 1125, "79_112": 1126, "156_37": 1127, "37_156": 1128, "184_157": 1129, "157_184": 1130, "184_66": 1131, "66_184": 1132, "181_145": 1133, "145_181": 1134, "95_184": 1135, "184_95": 1136, "60_189": 1137, "189_60": 1138, "167_104": 1139, "104_167": 1140, "167_5": 1141, "5_167": 1142, "174_41": 1143, "41_174": 1144, "18_18": 1145, "100_81": 1146, "81_100": 1147, "109_5": 1148, "5_109": 1149, "180_79": 1150, "79_180": 1151, "142_150": 1152, "150_142": 1153, "154_29": 1154, "29_154": 1155, "131_52": 1156, "52_131": 1157, "53_4": 1158, "4_53": 1159, "47_66": 1160, "66_47": 1161, "196_174": 1162, "174_196": 1163, "196_41": 1164, "41_196": 1165, "196_3": 1166, "3_196": 1167, "196_190": 1168, "190_196": 1169, "36_185": 1170, "185_36": 1171, "145_184": 1172, "184_145": 1173, "143_151": 1174, "151_143": 1175, "5_108": 1176, "108_5": 1177, "15_81": 1178, "81_15": 1179, "82_152": 1180, "152_82": 1181, "176_96": 1182, "96_176": 1183, "176_5": 1184, "5_176": 1185, "176_181": 1186, "181_176": 1187, "176_94": 1188, "94_176": 1189, "53_157": 1190, "157_53": 1191, "94_185": 1192, "185_94": 1193, "190_154": 1194, "154_190": 1195, "48_121": 1196, "121_48": 1197, "23_23": 1198, "116_116": 1199, "116_176": 1200, "176_116": 1201, "148_30": 1202, "30_148": 1203, "121_71": 1204, "71_121": 1205, "197_61": 1206, "61_197": 1207, "39_110": 1208, "110_39": 1209, "39_36": 1210, "36_39": 1211, "75_110": 1212, "110_75": 1213, "108_180": 1214, "180_108": 1215, "142_3": 1216, "3_142": 1217, "85_93": 1218, "93_85": 1219, "57_95": 1220, "95_57": 1221, "85_5": 1222, "5_85": 1223, "147_198": 1224, "198_147": 1225, "149_173": 1226, "173_149": 1227, "85_133": 1228, "133_85": 1229, "198_104": 1230, "104_198": 1231, "124_84": 1232, "84_124": 1233, "45_78": 1234, "78_45": 1235, "198_106": 1236, "106_198": 1237, "85_180": 1238, "180_85": 1239, "200_82": 1240, "82_200": 1241, "200_200": 1242, "60_68": 1243, "68_60": 1244, "76_38": 1245, "38_76": 1246, "85_33": 1247, "33_85": 1248, "161_161": 1249, "195_26": 1250, "26_195": 1251, "50_110": 1252, "110_50": 1253, "61_110": 1254, "110_61": 1255, "36_11": 1256, "11_36": 1257, "36_80": 1258, "80_36": 1259, "161_110": 1260, "110_161": 1261, "161_180": 1262, "180_161": 1263, "62_97": 1264, "97_62": 1265, "77_64": 1266, "64_77": 1267, "94_14": 1268, "14_94": 1269, "39_5": 1270, "5_39": 1271, "184_104": 1272, "104_184": 1273, "184_36": 1274, "36_184": 1275, "47_81": 1276, "81_47": 1277, "53_57": 1278, "57_53": 1279, "139_79": 1280, "79_139": 1281, "169_12": 1282, "12_169": 1283, "24_2": 1284, "2_24": 1285, "24_151": 1286, "151_24": 1287, "180_145": 1288, "145_180": 1289, "180_81": 1290, "81_180": 1291, "12_162": 1292, "162_12": 1293, "12_13": 1294, "13_12": 1295, "24_42": 1296, "42_24": 1297, "64_142": 1298, "142_64": 1299, "198_81": 1300, "81_198": 1301, "74_70": 1302, "70_74": 1303, "18_38": 1304, "38_18": 1305, "24_108": 1306, "108_24": 1307, "181_82": 1308, "82_181": 1309, "173_173": 1310, "173_81": 1311, "81_173": 1312, "96_13": 1313, "13_96": 1314, "44_44": 1315, "44_157": 1316, "157_44": 1317, "60_182": 1318, "182_60": 1319, "60_174": 1320, "174_60": 1321, "60_43": 1322, "43_60": 1323, "27_79": 1324, "79_27": 1325, "48_48": 1326, "89_198": 1327, "198_89": 1328, "111_183": 1329, "183_111": 1330, "111_70": 1331, "70_111": 1332, "14_180": 1333, "180_14": 1334, "144_79": 1335, "79_144": 1336, "81_110": 1337, "110_81": 1338, "154_162": 1339, "162_154": 1340, "19_180": 1341, "180_19": 1342, "136_180": 1343, "180_136": 1344, "136_187": 1345, "187_136": 1346, "67_70": 1347, "70_67": 1348, "181_58": 1349, "58_181": 1350, "21_135": 1351, "135_21": 1352, "180_46": 1353, "46_180": 1354, "154_84": 1355, "84_154": 1356, "144_81": 1357, "81_144": 1358, "2_63": 1359, "63_2": 1360, "36_58": 1361, "58_36": 1362, "21_118": 1363, "118_21": 1364, "57_41": 1365, "41_57": 1366, "183_109": 1367, "109_183": 1368, "136_78": 1369, "78_136": 1370, "21_61": 1371, "61_21": 1372, "102_102": 1373, "95_25": 1374, "25_95": 1375, "25_150": 1376, "150_25": 1377, "20_51": 1378, "51_20": 1379, "70_70": 1380, "87_5": 1381, "5_87": 1382, "51_151": 1383, "151_51": 1384, "94_91": 1385, "91_94": 1386, "2_5": 1387, "5_2": 1388, "13_104": 1389, "104_13": 1390, "76_184": 1391, "184_76": 1392, "76_39": 1393, "39_76": 1394, "70_126": 1395, "126_70": 1396, "51_38": 1397, "38_51": 1398, "106_135": 1399, "135_106": 1400, "68_97": 1401, "97_68": 1402, "68_68": 1403, "68_191": 1404, "191_68": 1405, "18_114": 1406, "114_18": 1407, "96_96": 1408, "195_62": 1409, "62_195": 1410, "195_13": 1411, "13_195": 1412, "121_82": 1413, "82_121": 1414, "155_44": 1415, "44_155": 1416, "140_157": 1417, "157_140": 1418, "77_116": 1419, "116_77": 1420, "140_136": 1421, "136_140": 1422, "140_44": 1423, "44_140": 1424, "140_58": 1425, "58_140": 1426, "128_82": 1427, "82_128": 1428, "116_180": 1429, "180_116": 1430, "124_126": 1431, "126_124": 1432, "145_194": 1433, "194_145": 1434, "145_150": 1435, "150_145": 1436, "91_5": 1437, "5_91": 1438, "171_162": 1439, "162_171": 1440, "140_192": 1441, "192_140": 1442, "121_36": 1443, "36_121": 1444, "121_181": 1445, "181_121": 1446, "121_29": 1447, "29_121": 1448, "24_95": 1449, "95_24": 1450, "131_131": 1451, "94_143": 1452, "143_94": 1453, "143_143": 1454, "95_164": 1455, "164_95": 1456, "21_125": 1457, "125_21": 1458, "30_13": 1459, "13_30": 1460, "170_82": 1461, "82_170": 1462, "170_150": 1463, "150_170": 1464, "170_170": 1465, "78_144": 1466, "144_78": 1467, "184_195": 1468, "195_184": 1469, "21_198": 1470, "198_21": 1471, "99_111": 1472, "55_105": 1473, "105_55": 1474, "18_198": 1475, "198_18": 1476, "18_171": 1477, "171_18": 1478, "91_81": 1479, "81_91": 1480, "183_5": 1481, "5_183": 1482, "147_122": 1483, "122_147": 1484, "31_119": 1485, "119_31": 1486, "173_180": 1487, "180_173": 1488, "140_184": 1489, "184_140": 1490, "140_155": 1491, "155_140": 1492, "82_81": 1493, "81_82": 1494, "101_18": 1495, "18_101": 1496, "67_3": 1497, "3_67": 1498, "67_12": 1499, "12_67": 1500, "24_72": 1501, "72_24": 1502, "94_94": 1503, "57_70": 1504, "70_57": 1505, "126_127": 1506, "127_126": 1507, "15_99": 1508, "99_15": 1509, "72_72": 1510, "77_128": 1511, "128_77": 1512, "139_153": 1513, "153_139": 1514, "13_139": 1515, "139_13": 1516, "162_48": 1517, "48_162": 1518, "162_187": 1519, "187_162": 1520, "131_103": 1521, "103_131": 1522, "111_42": 1523, "42_111": 1524, "36_24": 1525, "24_36": 1526, "150_150": 1527, "98_81": 1528, "81_98": 1529, "89_5": 1530, "5_89": 1531, "85_109": 1532, "109_85": 1533, "74_25": 1534, "25_74": 1535, "71_71": 1536, "71_47": 1537, "47_71": 1538, "71_163": 1539, "163_71": 1540, "71_92": 1541, "92_71": 1542, "60_176": 1543, "176_60": 1544, "33_46": 1545, "46_33": 1546, "177_33": 1547, "33_11": 1548, "11_33": 1549, "33_166": 1550, "166_33": 1551, "33_110": 1552, "110_33": 1553, "67_43": 1554, "43_67": 1555, "24_63": 1556, "63_24": 1557, "104_152": 1558, "152_104": 1559, "104_72": 1560, "72_104": 1561, "74_198": 1562, "198_74": 1563, "29_110": 1564, "110_29": 1565, "104_75": 1566, "75_104": 1567, "140_96": 1568, "96_140": 1569, "140_104": 1570, "104_140": 1571, "45_142": 1572, "142_45": 1573, "156_104": 1574, "104_156": 1575, "156_3": 1576, "3_156": 1577, "156_82": 1578, "82_156": 1579, "70_144": 1580, "144_70": 1581, "81_157": 1582, "157_81": 1583, "81_81": 1584, "198_110": 1585, "110_198": 1586, "12_150": 1587, "150_12": 1588, "6_85": 1589, "85_6": 1590, "45_67": 1591, "67_45": 1592, "180_29": 1593, "29_180": 1594, "69_184": 1595, "184_69": 1596, "167_38": 1597, "38_167": 1598, "74_174": 1599, "174_74": 1600, "18_107": 1601, "107_18": 1602, "198_13": 1603, "13_198": 1604, "71_12": 1605, "12_71": 1606, "24_144": 1607, "144_24": 1608, "173_64": 1609, "64_173": 1610, "56_106": 1611, "106_56": 1612, "62_98": 1613, "98_62": 1614, "11_114": 1615, "114_11": 1616, "82_155": 1617, "155_82": 1618, "82_176": 1619, "176_82": 1620, "87_87": 1621, "200_149": 1622, "149_200": 1623, "60_191": 1624, "191_60": 1625, "198_136": 1626, "136_198": 1627, "140_114": 1628, "114_140": 1629, "180_184": 1630, "184_180": 1631, "180_146": 1632, "146_180": 1633, "180_45": 1634, "45_180": 1635, "180_58": 1636, "58_180": 1637, "180_153": 1638, "153_180": 1639, "180_186": 1640, "186_180": 1641, "180_195": 1642, "195_180": 1643, "180_171": 1644, "171_180": 1645, "180_155": 1646, "155_180": 1647, "180_185": 1648, "185_180": 1649, "180_17": 1650, "17_180": 1651, "180_44": 1652, "44_180": 1653, "180_134": 1654, "134_180": 1655, "180_36": 1656, "36_180": 1657, "77_157": 1658, "157_77": 1659, "12_113": 1660, "113_12": 1661, "12_86": 1662, "86_12": 1663, "11_133": 1664, "133_11": 1665, "21_16": 1666, "16_21": 1667, "27_53": 1668, "53_27": 1669, "124_67": 1670, "67_124": 1671, "124_128": 1672, "128_124": 1673, "70_4": 1674, "4_70": 1675, "66_5": 1676, "5_66": 1677, "66_94": 1678, "94_66": 1679, "173_134": 1680, "134_173": 1681, "200_157": 1682, "157_200": 1683, "200_104": 1684, "104_200": 1685, "39_176": 1686, "176_39": 1687, "82_167": 1688, "167_82": 1689, "48_120": 1690, "120_48": 1691, "67_74": 1692, "74_67": 1693, "182_114": 1694, "114_182": 1695, "127_2": 1696, "2_127": 1697, "57_97": 1698, "97_57": 1699, "44_110": 1700, "110_44": 1701, "44_185": 1702, "185_44": 1703, "96_18": 1704, "18_96": 1705, "53_12": 1706, "12_53": 1707, "16_109": 1708, "109_16": 1709, "107_111": 1710, "111_107": 1711, "107_180": 1712, "180_107": 1713, "155_200": 1714, "200_155": 1715, "155_110": 1716, "110_155": 1717, "188_81": 1718, "81_188": 1719, "134_5": 1720, "5_134": 1721, "64_62": 1722, "62_64": 1723, "64_13": 1724, "13_64": 1725, "64_64": 1726, "182_153": 1727, "153_182": 1728, "5_187": 1729, "187_5": 1730, "74_72": 1731, "72_74": 1732, "74_74": 1733, "190_198": 1734, "198_190": 1735, "190_38": 1736, "38_190": 1737, "2_120": 1738, "120_2": 1739, "74_127": 1740, "127_74": 1741, "136_162": 1742, "162_136": 1743, "136_144": 1744, "144_136": 1745, "136_116": 1746, "116_136": 1747, "172_149": 1748, "149_172": 1749, "198_153": 1750, "153_198": 1751, "45_157": 1752, "157_45": 1753, "165_152": 1754, "152_165": 1755, "140_142": 1756, "142_140": 1757, "111_12": 1758, "12_111": 1759, "53_143": 1760, "143_53": 1761, "27_143": 1762, "143_27": 1763, "110_147": 1764, "147_110": 1765, "75_185": 1766, "185_75": 1767, "75_145": 1768, "145_75": 1769, "75_134": 1770, "134_75": 1771, "137_167": 1772, "167_137": 1773, "176_191": 1774, "191_176": 1775, "36_75": 1776, "75_36": 1777, "45_149": 1778, "149_45": 1779, "183_125": 1780, "125_183": 1781, "145_80": 1782, "80_145": 1783, "67_133": 1784, "133_67": 1785, "85_162": 1786, "162_85": 1787, "12_57": 1788, "57_12": 1789, "181_2": 1790, "2_181": 1791, "75_12": 1792, "12_75": 1793, "85_63": 1794, "63_85": 1795, "108_111": 1796, "111_108": 1797, "27_150": 1798, "150_27": 1799, "67_94": 1800, "94_67": 1801, "19_198": 1802, "198_19": 1803, "85_84": 1804, "84_85": 1805, "155_80": 1806, "80_155": 1807, "179_81": 1808, "81_179": 1809, "51_12": 1810, "12_51": 1811, "25_125": 1812, "125_25": 1813, "149_96": 1814, "96_149": 1815, "45_62": 1816, "62_45": 1817, "129_5": 1818, "5_129": 1819, "196_196": 1820, "173_181": 1821, "181_173": 1822, "36_2": 1823, "2_36": 1824, "12_108": 1825, "108_12": 1826, "116_44": 1827, "44_116": 1828, "24_48": 1829, "48_24": 1830, "24_162": 1831, "162_24": 1832, "170_54": 1833, "54_170": 1834, "139_29": 1835, "29_139": 1836, "12_58": 1837, "58_12": 1838, "139_146": 1839, "146_139": 1840, "30_67": 1841, "67_30": 1842, "30_111": 1843, "111_30": 1844, "181_47": 1845, "47_181": 1846, "150_157": 1847, "157_150": 1848, "150_104": 1849, "104_150": 1850, "116_62": 1851, "62_116": 1852, "104_66": 1853, "66_104": 1854, "146_29": 1855, "29_146": 1856, "125_72": 1857, "72_125": 1858, "20_82": 1859, "82_20": 1860, "170_145": 1861, "145_170": 1862, "181_184": 1863, "184_181": 1864, "142_176": 1865, "176_142": 1866, "142_155": 1867, "155_142": 1868, "142_180": 1869, "180_142": 1870, "192_110": 1871, "110_192": 1872, "135_12": 1873, "12_135": 1874, "53_133": 1875, "133_53": 1876, "47_110": 1877, "110_47": 1878, "88_81": 1879, "81_88": 1880, "127_25": 1881, "25_127": 1882, "74_5": 1883, "5_74": 1884, "55_109": 1885, "109_55": 1886, "55_13": 1887, "13_55": 1888, "87_55": 1889, "55_87": 1890, "136_104": 1891, "104_136": 1892, "15_198": 1893, "70_149": 1894, "149_70": 1895, "99_82": 1896, "82_99": 1897, "55_80": 1898, "80_55": 1899, "85_190": 1900, "190_85": 1901, "5_116": 1902, "116_5": 1903, "129_180": 1904, "180_129": 1905, "55_81": 1906, "81_55": 1907, "5_81": 1908, "81_5": 1909, "5_75": 1910, "75_5": 1911, "183_4": 1912, "4_183": 1913, "85_110": 1914, "110_85": 1915, "64_184": 1916, "184_64": 1917, "166_166": 1918, "166_70": 1919, "70_166": 1920, "166_125": 1921, "125_166": 1922, "81_80": 1923, "80_81": 1924, "81_104": 1925, "104_81": 1926, "81_78": 1927, "78_81": 1928, "81_140": 1929, "140_81": 1930, "170_78": 1931, "78_170": 1932, "45_152": 1933, "152_45": 1934, "19_162": 1935, "162_19": 1936, "170_200": 1937, "200_170": 1938, "170_140": 1939, "140_170": 1940, "77_146": 1941, "146_77": 1942, "148_70": 1943, "70_148": 1944, "24_98": 1945, "98_24": 1946, "104_18": 1947, "18_104": 1948, "14_108": 1949, "108_14": 1950, "53_53": 1951, "13_110": 1952, "110_13": 1953, "189_189": 1954, "189_35": 1955, "35_189": 1956, "39_145": 1957, "145_39": 1958, "140_128": 1959, "128_140": 1960, "140_13": 1961, "13_140": 1962, "140_75": 1963, "75_140": 1964, "74_106": 1965, "106_74": 1966, "108_134": 1967, "134_108": 1968, "108_149": 1969, "149_108": 1970, "116_104": 1971, "104_116": 1972, "2_140": 1973, "140_2": 1974, "67_39": 1975, "39_67": 1976, "158_184": 1977, "184_158": 1978, "158_26": 1979, "26_158": 1980, "136_48": 1981, "48_136": 1982, "154_129": 1983, "129_154": 1984, "154_98": 1985, "98_154": 1986, "154_48": 1987, "48_154": 1988, "45_151": 1989, "151_45": 1990, "57_125": 1991, "125_57": 1992, "176_193": 1993, "193_176": 1994, "111_105": 1995, "105_111": 1996, "175_79": 1997, "79_175": 1998, "130_70": 1999, "70_130": 2000, "154_149": 2001, "149_154": 2002, "13_181": 2003, "181_13": 2004, "74_108": 2005, "108_74": 2006, "148_38": 2007, "38_148": 2008, "72_46": 2009, "46_72": 2010, "13_95": 2011, "95_13": 2012, "70_95": 2013, "95_70": 2014, "181_151": 2015, "151_181": 2016, "182_150": 2017, "150_182": 2018, "184_120": 2019, "120_184": 2020, "70_40": 2021, "40_70": 2022, "97_191": 2023, "191_97": 2024, "129_2": 2025, "2_129": 2026, "139_12": 2027, "12_139": 2028, "117_144": 2029, "144_117": 2030, "124_114": 2031, "114_124": 2032, "198_48": 2033, "48_198": 2034, "198_162": 2035, "162_198": 2036, "64_176": 2037, "176_64": 2038, "154_24": 2039, "24_154": 2040, "156_157": 2041, "157_156": 2042, "200_125": 2043, "125_200": 2044, "176_108": 2045, "108_176": 2046, "176_177": 2047, "177_176": 2048, "195_110": 2049, "110_195": 2050, "195_140": 2051, "140_195": 2052, "94_109": 2053, "109_94": 2054, "150_85": 2055, "85_150": 2056, "150_41": 2057, "41_150": 2058, "128_24": 2059, "24_128": 2060, "140_82": 2061, "82_140": 2062, "142_149": 2063, "149_142": 2064, "124_118": 2065, "118_124": 2066, "140_109": 2067, "109_140": 2068, "140_125": 2069, "125_140": 2070, "53_197": 2071, "197_53": 2072, "149_39": 2073, "39_149": 2074, "149_140": 2075, "140_149": 2076, "39_12": 2077, "12_39": 2078, "58_82": 2079, "82_58": 2080, "134_82": 2081, "82_134": 2082, "104_110": 2083, "110_104": 2084, "176_75": 2085, "75_176": 2086, "27_2": 2087, "2_27": 2088, "110_200": 2089, "200_110": 2090, "27_164": 2091, "164_27": 2092, "12_192": 2093, "192_12": 2094, "12_128": 2095, "128_12": 2096, "97_198": 2097, "198_97": 2098, "57_164": 2099, "164_57": 2100, "67_85": 2101, "85_67": 2102, "184_47": 2103, "47_184": 2104, "153_82": 2105, "82_153": 2106, "137_41": 2107, "41_137": 2108, "115_57": 2109, "57_115": 2110, "115_115": 2111, "70_96": 2112, "96_70": 2113, "174_15": 2114, "15_174": 2115, "94_85": 2116, "85_94": 2117, "58_151": 2118, "151_58": 2119, "134_118": 2120, "118_134": 2121, "18_10": 2122, "10_18": 2123, "136_182": 2124, "182_136": 2125, "85_25": 2126, "25_85": 2127, "96_79": 2128, "79_96": 2129, "81_58": 2130, "58_81": 2131, "81_71": 2132, "71_81": 2133, "124_121": 2134, "121_124": 2135, "2_53": 2136, "53_2": 2137, "2_39": 2138, "39_2": 2139, "2_110": 2140, "110_2": 2141, "77_20": 2142, "20_77": 2143, "122_157": 2144, "157_122": 2145, "5_184": 2146, "184_5": 2147, "78_36": 2148, "36_78": 2149, "36_155": 2150, "155_36": 2151, "74_110": 2152, "110_74": 2153, "162_65": 2154, "65_162": 2155, "199_150": 2156, "150_199": 2157, "155_62": 2158, "62_155": 2159, "123_110": 2160, "110_123": 2161, "123_97": 2162, "97_123": 2163, "60_12": 2164, "12_60": 2165, "60_77": 2166, "77_60": 2167, "60_177": 2168, "177_60": 2169, "60_41": 2170, "41_60": 2171, "60_97": 2172, "97_60": 2173, "64_200": 2174, "200_64": 2175, "192_24": 2176, "24_192": 2177, "98_74": 2178, "74_98": 2179, "145_47": 2180, "47_145": 2181, "145_81": 2182, "81_145": 2183, "49_10": 2184, "10_49": 2185, "187_36": 2186, "36_187": 2187, "187_144": 2188, "144_187": 2189, "62_85": 2190, "85_62": 2191, "180_162": 2192, "162_180": 2193, "136_81": 2194, "81_136": 2195, "49_66": 2196, "66_49": 2197, "27_126": 2198, "126_27": 2199, "24_140": 2200, "140_24": 2201, "62_80": 2202, "80_62": 2203, "62_176": 2204, "176_62": 2205, "180_62": 2206, "62_180": 2207, "180_5": 2208, "5_180": 2209, "181_134": 2210, "134_181": 2211, "62_200": 2212, "200_62": 2213, "81_46": 2214, "46_81": 2215, "81_11": 2216, "11_81": 2217, "106_57": 2218, "57_106": 2219, "78_80": 2220, "80_78": 2221, "139_118": 2222, "118_139": 2223, "181_171": 2224, "171_181": 2225, "154_18": 2226, "18_154": 2227, "82_45": 2228, "45_82": 2229, "82_185": 2230, "185_82": 2231, "67_126": 2232, "126_67": 2233, "188_12": 2234, "12_188": 2235, "108_173": 2236, "173_108": 2237, "136_36": 2238, "36_136": 2239, "171_11": 2240, "11_171": 2241, "77_170": 2242, "170_77": 2243, "137_149": 2244, "149_137": 2245, "146_121": 2246, "121_146": 2247, "195_167": 2248, "167_195": 2249, "82_139": 2250, "139_82": 2251, "82_67": 2252, "67_82": 2253, "82_74": 2254, "74_82": 2255, "82_3": 2256, "3_82": 2257, "140_116": 2258, "116_140": 2259, "195_153": 2260, "153_195": 2261, "124_75": 2262, "75_124": 2263, "15_25": 2264, "25_15": 2265, "91_61": 2266, "61_91": 2267, "67_190": 2268, "190_67": 2269, "70_79": 2270, "79_70": 2271, "110_51": 2272, "51_110": 2273, "85_69": 2274, "69_85": 2275, "154_195": 2276, "195_154": 2277, "199_12": 2278, "12_199": 2279, "55_180": 2280, "180_55": 2281, "64_194": 2282, "194_64": 2283, "48_144": 2284, "144_48": 2285, "48_180": 2286, "180_48": 2287, "48_150": 2288, "150_48": 2289, "94_27": 2290, "27_94": 2291, "167_72": 2292, "72_167": 2293, "5_155": 2294, "155_5": 2295, "172_146": 2296, "146_172": 2297, "48_13": 2298, "13_48": 2299, "5_201": 2300, "201_5": 2301, "70_171": 2302, "171_70": 2303, "177_70": 2304, "187_12": 2305, "12_187": 2306, "42_18": 2307, "18_42": 2308, "24_111": 2309, "111_24": 2310, "88_41": 2311, "41_88": 2312, "70_84": 2313, "84_70": 2314, "184_37": 2315, "37_184": 2316, "19_187": 2317, "187_19": 2318, "19_136": 2319, "136_19": 2320, "124_15": 2321, "15_124": 2322, "155_12": 2323, "12_155": 2324, "162_17": 2325, "17_162": 2326, "79_110": 2327, "110_79": 2328, "94_81": 2329, "81_94": 2330, "180_80": 2331, "80_180": 2332, "180_157": 2333, "157_180": 2334, "105_79": 2335, "79_105": 2336, "44_184": 2337, "184_44": 2338, "44_36": 2339, "36_44": 2340, "177_36": 2341, "36_177": 2342, "177_177": 2343, "177_181": 2344, "181_177": 2345, "177_11": 2346, "11_177": 2347, "177_15": 2348, "15_177": 2349, "176_200": 2350, "200_176": 2351, "96_157": 2352, "157_96": 2353, "3_149": 2354, "149_3": 2355, "84_174": 2356, "174_84": 2357, "147_72": 2358, "72_147": 2359, "149_110": 2360, "110_149": 2361, "115_106": 2362, "106_115": 2363, "21_36": 2364, "36_21": 2365, "119_103": 2366, "103_119": 2367, "85_163": 2368, "163_85": 2369, "161_74": 2370, "74_161": 2371, "173_157": 2372, "157_173": 2373, "70_151": 2374, "151_70": 2375, "40_142": 2376, "142_40": 2377, "63_63": 2378, "184_26": 2379, "26_184": 2380, "24_200": 2381, "200_24": 2382, "4_82": 2383, "82_4": 2384, "74_164": 2385, "164_74": 2386, "198_5": 2387, "5_198": 2388, "140_64": 2389, "64_140": 2390, "57_61": 2391, "61_57": 2392, "188_75": 2393, "75_188": 2394, "201_155": 2395, "155_201": 2396, "201_201": 2397, "201_12": 2398, "12_201": 2399, "201_82": 2400, "82_201": 2401, "201_158": 2402, "158_201": 2403, "201_57": 2404, "57_201": 2405, "201_195": 2406, "195_201": 2407, "201_13": 2408, "13_201": 2409, "201_53": 2410, "53_201": 2411, "201_149": 2412, "149_201": 2413, "5_133": 2414, "133_5": 2415, "190_53": 2416, "53_190": 2417, "9_79": 2418, "79_9": 2419, "173_195": 2420, "195_173": 2421, "85_118": 2422, "118_85": 2423, "60_99": 2424, "99_60": 2425, "24_147": 2426, "147_24": 2427, "27_125": 2428, "125_27": 2429, "11_110": 2430, "110_11": 2431, "11_80": 2432, "80_11": 2433, "39_41": 2434, "41_39": 2435, "174_147": 2436, "147_174": 2437, "3_198": 2438, "198_3": 2439, "12_24": 2440, "24_12": 2441, "57_122": 2442, "122_57": 2443, "181_190": 2444, "190_181": 2445, "181_133": 2446, "133_181": 2447, "65_82": 2448, "82_65": 2449, "182_84": 2450, "84_182": 2451, "170_40": 2452, "40_170": 2453, "170_72": 2454, "72_170": 2455, "170_49": 2456, "49_170": 2457, "170_149": 2458, "149_170": 2459, "170_84": 2460, "84_170": 2461, "170_174": 2462, "174_170": 2463, "170_172": 2464, "172_170": 2465, "170_169": 2466, "169_170": 2467, "170_24": 2468, "24_170": 2469, "111_200": 2470, "200_111": 2471, "70_125": 2472, "125_70": 2473, "24_113": 2474, "113_24": 2475, "20_45": 2476, "45_20": 2477, "110_167": 2478, "167_110": 2479, "12_65": 2480, "65_12": 2481, "173_185": 2482, "185_173": 2483, "136_82": 2484, "82_136": 2485, "154_63": 2486, "63_154": 2487, "95_15": 2488, "15_95": 2489, "45_26": 2490, "26_45": 2491, "39_142": 2492, "142_39": 2493, "36_82": 2494, "82_36": 2495, "126_24": 2496, "24_126": 2497, "126_180": 2498, "180_126": 2499, "39_194": 2500, "194_39": 2501, "111_181": 2502, "181_111": 2503, "55_143": 2504, "143_55": 2505, "180_150": 2506, "150_180": 2507, "48_103": 2508, "103_48": 2509, "158_38": 2510, "38_158": 2511, "24_96": 2512, "96_24": 2513, "91_120": 2514, "120_91": 2515, "108_102": 2516, "102_108": 2517, "162_60": 2518, "60_162": 2519, "64_150": 2520, "150_64": 2521, "64_167": 2522, "167_64": 2523, "183_44": 2524, "44_183": 2525, "145_176": 2526, "176_145": 2527, "168_168": 2528, "50_181": 2529, "181_50": 2530, "128_149": 2531, "149_128": 2532, "183_110": 2533, "110_183": 2534, "129_29": 2535, "29_129": 2536, "128_170": 2537, "170_128": 2538, "187_110": 2539, "110_187": 2540, "48_124": 2541, "124_48": 2542, "48_29": 2543, "29_48": 2544, "74_119": 2545, "119_74": 2546, "61_155": 2547, "155_61": 2548, "136_151": 2549, "151_136": 2550, "136_2": 2551, "2_136": 2552, "134_151": 2553, "151_134": 2554, "94_198": 2555, "198_94": 2556, "148_56": 2557, "56_148": 2558, "33_33": 2559, "33_27": 2560, "27_33": 2561, "88_104": 2562, "104_88": 2563, "171_77": 2564, "77_171": 2565, "171_176": 2566, "176_171": 2567, "39_80": 2568, "80_39": 2569, "179_91": 2570, "91_179": 2571, "5_23": 2572, "23_5": 2573, "174_167": 2574, "167_174": 2575, "90_130": 2576, "130_90": 2577, "90_57": 2578, "57_90": 2579, "53_3": 2580, "3_53": 2581, "154_12": 2582, "12_154": 2583, "124_97": 2584, "97_124": 2585, "124_98": 2586, "98_124": 2587, "118_118": 2588, "16_200": 2589, "200_16": 2590, "173_36": 2591, "36_173": 2592, "31_70": 2593, "70_31": 2594, "31_71": 2595, "71_31": 2596, "88_113": 2597, "113_88": 2598, "150_59": 2599, "59_150": 2600, "124_39": 2601, "39_124": 2602, "36_190": 2603, "190_36": 2604, "36_181": 2605, "181_36": 2606, "36_117": 2607, "117_36": 2608, "36_100": 2609, "100_36": 2610, "36_149": 2611, "149_36": 2612, "176_157": 2613, "157_176": 2614, "174_13": 2615, "13_174": 2616, "174_42": 2617, "42_174": 2618, "36_140": 2619, "140_36": 2620, "124_105": 2621, "105_124": 2622, "104_26": 2623, "26_104": 2624, "85_129": 2625, "129_85": 2626, "85_16": 2627, "16_85": 2628, "85_114": 2629, "114_85": 2630, "81_185": 2631, "185_81": 2632, "81_74": 2633, "74_81": 2634, "147_111": 2635, "111_147": 2636, "16_153": 2637, "153_16": 2638, "176_97": 2639, "97_176": 2640, "147_120": 2641, "120_147": 2642, "124_57": 2643, "57_124": 2644, "124_152": 2645, "152_124": 2646, "108_110": 2647, "110_108": 2648, "151_74": 2649, "74_151": 2650, "158_180": 2651, "180_158": 2652, "98_56": 2653, "56_98": 2654, "2_121": 2655, "121_2": 2656, "125_38": 2657, "38_125": 2658, "112_81": 2659, "81_112": 2660, "112_161": 2661, "161_112": 2662, "112_5": 2663, "5_112": 2664, "67_139": 2665, "139_67": 2666, "174_32": 2667, "32_174": 2668, "196_67": 2669, "67_196": 2670, "129_48": 2671, "48_129": 2672, "18_12": 2673, "12_18": 2674, "70_72": 2675, "72_70": 2676, "100_187": 2677, "187_100": 2678, "182_53": 2679, "53_182": 2680, "62_110": 2681, "110_62": 2682, "27_70": 2683, "70_27": 2684, "128_70": 2685, "70_128": 2686, "158_59": 2687, "59_158": 2688, "112_98": 2689, "98_112": 2690, "69_47": 2691, "47_69": 2692, "69_110": 2693, "110_69": 2694, "162_146": 2695, "146_162": 2696, "57_74": 2697, "74_57": 2698, "80_80": 2699, "114_79": 2700, "79_114": 2701, "111_5": 2702, "5_111": 2703, "131_110": 2704, "110_131": 2705, "124_104": 2706, "104_124": 2707, "143_109": 2708, "109_143": 2709, "143_81": 2710, "81_143": 2711, "195_195": 2712, "21_70": 2713, "70_21": 2714, "24_110": 2715, "110_24": 2716, "104_79": 2717, "79_104": 2718, "81_13": 2719, "13_81": 2720, "39_79": 2721, "79_39": 2722, "27_24": 2723, "24_27": 2724, "89_108": 2725, "108_89": 2726, "124_190": 2727, "190_124": 2728, "107_53": 2729, "53_107": 2730, "82_183": 2731, "183_82": 2732, "18_4": 2733, "4_18": 2734, "180_149": 2735, "149_180": 2736, "190_146": 2737, "146_190": 2738, "27_44": 2739, "44_27": 2740, "129_125": 2741, "125_129": 2742, "129_96": 2743, "96_129": 2744, "70_3": 2745, "3_70": 2746, "72_53": 2747, "53_72": 2748, "72_56": 2749, "56_72": 2750, "190_81": 2751, "81_190": 2752, "99_171": 2753, "171_99": 2754, "180_74": 2755, "74_180": 2756, "31_57": 2757, "57_31": 2758, "71_127": 2759, "127_71": 2760, "136_53": 2761, "53_136": 2762, "158_150": 2763, "150_158": 2764, "158_194": 2765, "194_158": 2766, "91_25": 2767, "25_91": 2768, "129_164": 2769, "164_129": 2770, "74_63": 2771, "63_74": 2772, "144_96": 2773, "96_144": 2774, "135_70": 2775, "70_135": 2776, "72_181": 2777, "181_72": 2778, "73_142": 2779, "142_73": 2780, "74_124": 2781, "124_74": 2782, "123_43": 2783, "43_123": 2784, "13_124": 2785, "124_13": 2786, "143_99": 2787, "99_143": 2788, "29_81": 2789, "81_29": 2790, "181_29": 2791, "29_181": 2792, "79_10": 2793, "10_79": 2794, "97_5": 2795, "5_97": 2796, "78_159": 2797, "159_78": 2798, "78_44": 2799, "44_78": 2800, "78_99": 2801, "99_78": 2802, "78_185": 2803, "185_78": 2804, "199_194": 2805, "194_199": 2806, "152_58": 2807, "58_152": 2808, "53_146": 2809, "146_53": 2810, "114_104": 2811, "104_114": 2812, "161_82": 2813, "82_161": 2814, "167_143": 2815, "143_167": 2816, "167_71": 2817, "71_167": 2818, "167_180": 2819, "180_167": 2820, "124_198": 2821, "198_124": 2822, "104_5": 2823, "5_104": 2824, "104_154": 2825, "154_104": 2826, "105_102": 2827, "102_105": 2828, "154_144": 2829, "144_154": 2830, "145_66": 2831, "66_145": 2832, "145_79": 2833, "79_145": 2834, "170_66": 2835, "66_170": 2836, "5_136": 2837, "136_5": 2838, "154_13": 2839, "13_154": 2840, "198_26": 2841, "26_198": 2842, "39_61": 2843, "61_39": 2844, "124_36": 2845, "36_124": 2846, "53_97": 2847, "97_53": 2848, "5_127": 2849, "127_5": 2850, "124_66": 2851, "66_124": 2852, "181_108": 2853, "108_181": 2854, "110_157": 2855, "157_110": 2856, "111_57": 2857, "57_111": 2858, "5_94": 2859, "94_5": 2860, "140_79": 2861, "79_140": 2862, "75_79": 2863, "79_75": 2864, "75_45": 2865, "45_75": 2866, "75_187": 2867, "187_75": 2868, "75_173": 2869, "173_75": 2870, "75_153": 2871, "153_75": 2872, "75_142": 2873, "142_75": 2874, "75_170": 2875, "170_75": 2876, "75_64": 2877, "64_75": 2878, "75_47": 2879, "47_75": 2880, "75_77": 2881, "77_75": 2882, "75_46": 2883, "46_75": 2884, "75_200": 2885, "200_75": 2886, "75_162": 2887, "162_75": 2888, "75_184": 2889, "184_75": 2890, "75_195": 2891, "195_75": 2892, "75_155": 2893, "155_75": 2894, "75_116": 2895, "116_75": 2896, "75_76": 2897, "76_75": 2898, "75_150": 2899, "150_75": 2900, "75_44": 2901, "44_75": 2902, "16_3": 2903, "3_16": 2904, "30_83": 2905, "83_30": 2906, "22_146": 2907, "146_22": 2908, "53_171": 2909, "171_53": 2910, "85_30": 2911, "30_85": 2912, "53_30": 2913, "30_53": 2914, "67_194": 2915, "194_67": 2916, "75_80": 2917, "80_75": 2918, "113_79": 2919, "79_113": 2920, "185_79": 2921, "79_185": 2922, "185_45": 2923, "45_185": 2924, "185_12": 2925, "12_185": 2926, "124_95": 2927, "95_124": 2928, "70_121": 2929, "121_70": 2930, "124_149": 2931, "149_124": 2932, "131_56": 2933, "56_131": 2934, "198_69": 2935, "69_198": 2936, "201_116": 2937, "116_201": 2938, "160_160": 2939, "160_15": 2940, "15_160": 2941, "85_74": 2942, "74_85": 2943, "103_85": 2944, "85_103": 2945, "84_102": 2946, "102_84": 2947, "171_71": 2948, "71_171": 2949, "198_52": 2950, "52_198": 2951, "31_31": 2952, "171_125": 2953, "125_171": 2954, "171_128": 2955, "128_171": 2956, "2_198": 2957, "198_2": 2958, "131_36": 2959, "36_131": 2960, "143_184": 2961, "184_143": 2962, "96_112": 2963, "112_96": 2964, "24_18": 2965, "18_24": 2966, "122_53": 2967, "53_122": 2968, "124_135": 2969, "135_124": 2970, "181_64": 2971, "64_181": 2972, "181_140": 2973, "140_181": 2974, "57_23": 2975, "23_57": 2976, "126_13": 2977, "13_126": 2978, "51_198": 2979, "198_51": 2980, "173_47": 2981, "47_173": 2982, "173_29": 2983, "29_173": 2984, "143_48": 2985, "48_143": 2986, "97_179": 2987, "179_97": 2988, "97_137": 2989, "137_97": 2990, "97_70": 2991, "70_97": 2992, "97_190": 2993, "190_97": 2994, "145_185": 2995, "185_145": 2996, "176_56": 2997, "56_176": 2998, "144_144": 2999, "77_195": 3000, "195_77": 3001, "200_145": 3002, "145_200": 3003, "108_79": 3004, "79_108": 3005, "27_74": 3006, "74_27": 3007, "95_93": 3008, "93_95": 3009, "55_94": 3010, "94_55": 3011, "15_15": 3012, "78_139": 3013, "139_78": 3014, "78_153": 3015, "153_78": 3016, "78_79": 3017, "79_78": 3018, "78_175": 3019, "175_78": 3020, "78_146": 3021, "146_78": 3022, "78_87": 3023, "87_78": 3024, "78_201": 3025, "201_78": 3026, "145_177": 3027, "177_145": 3028, "3_174": 3029, "174_3": 3030, "171_110": 3031, "110_171": 3032, "124_146": 3033, "146_124": 3034, "124_130": 3035, "130_124": 3036, "125_133": 3037, "133_125": 3038, "24_171": 3039, "171_24": 3040, "124_195": 3041, "195_124": 3042, "85_79": 3043, "79_85": 3044, "24_146": 3045, "146_24": 3046, "62_104": 3047, "104_62": 3048, "62_82": 3049, "82_62": 3050, "42_12": 3051, "12_42": 3052, "199_182": 3053, "182_199": 3054, "199_40": 3055, "40_199": 3056, "77_36": 3057, "36_77": 3058, "126_52": 3059, "52_126": 3060, "85_15": 3061, "15_85": 3062, "18_74": 3063, "74_18": 3064, "24_121": 3065, "121_24": 3066, "167_55": 3067, "55_167": 3068, "86_86": 3069, "86_175": 3070, "175_86": 3071, "86_110": 3072, "110_86": 3073, "151_85": 3074, "85_151": 3075, "98_42": 3076, "42_98": 3077, "175_114": 3078, "114_175": 3079, "175_175": 3080, "195_149": 3081, "149_195": 3082, "51_157": 3083, "157_51": 3084, "53_124": 3085, "124_53": 3086, "44_55": 3087, "55_44": 3088, "96_12": 3089, "12_96": 3090, "96_63": 3091, "63_96": 3092, "152_157": 3093, "157_152": 3094, "146_70": 3095, "70_146": 3096, "146_57": 3097, "57_146": 3098, "146_127": 3099, "127_146": 3100, "146_52": 3101, "52_146": 3102, "183_143": 3103, "143_183": 3104, "48_155": 3105, "155_48": 3106, "57_22": 3107, "22_57": 3108, "88_29": 3109, "29_88": 3110, "110_80": 3111, "80_110": 3112, "110_176": 3113, "176_110": 3114, "53_94": 3115, "94_53": 3116, "57_135": 3117, "135_57": 3118, "55_4": 3119, "4_55": 3120, "55_187": 3121, "187_55": 3122, "55_8": 3123, "8_55": 3124, "111_6": 3125, "6_111": 3126, "198_143": 3127, "143_198": 3128, "167_139": 3129, "139_167": 3130, "198_105": 3131, "105_198": 3132, "56_38": 3133, "38_56": 3134, "182_174": 3135, "174_182": 3136, "124_17": 3137, "17_124": 3138, "200_136": 3139, "136_200": 3140, "170_104": 3141, "104_170": 3142, "70_113": 3143, "113_70": 3144, "136_85": 3145, "85_136": 3146, "64_121": 3147, "121_64": 3148, "64_198": 3149, "198_64": 3150, "95_143": 3151, "143_95": 3152, "179_149": 3153, "149_179": 3154, "142_194": 3155, "194_142": 3156, "142_196": 3157, "196_142": 3158, "24_187": 3159, "187_24": 3160, "24_17": 3161, "17_24": 3162, "27_128": 3163, "128_27": 3164, "121_5": 3165, "5_121": 3166, "62_109": 3167, "109_62": 3168, "142_192": 3169, "192_142": 3170, "58_64": 3171, "64_58": 3172, "24_81": 3173, "81_24": 3174, "128_104": 3175, "104_128": 3176, "145_104": 3177, "104_145": 3178, "131_57": 3179, "57_131": 3180, "44_159": 3181, "159_44": 3182, "44_69": 3183, "69_44": 3184, "44_82": 3185, "82_44": 3186, "87_139": 3187, "139_87": 3188, "74_157": 3189, "157_74": 3190, "197_129": 3191, "129_197": 3192, "180_190": 3193, "190_180": 3194, "85_4": 3195, "4_85": 3196, "12_183": 3197, "183_12": 3198, "72_103": 3199, "103_72": 3200, "15_140": 3201, "140_15": 3202, "24_177": 3203, "177_24": 