{"PAD": 0, "DUMMY_START_RELATION": 1, "UNK": 2, "46_36": 3, "44_36": 4, "82_3": 5, "18_99": 6, "82_36": 7, "18_82": 8, "44_58": 9, "31_34": 10, "94_36": 11, "46_58": 12, "30_36": 13, "14_77": 14, "21_34": 15, "21_36": 16, "21_38": 17, "22_36": 18, "44_34": 19, "99_36": 20, "82_58": 21, "53_36": 22, "27_36": 23, "44_11": 24, "95_36": 25, "7_77": 26, "77_58": 27, "46_38": 28, "2_36": 29, "94_58": 30, "31_36": 31, "77_36": 32, "26_36": 33, "82_38": 34, "19_36": 35, "21_77": 36, "100_58": 37, "35_36": 38, "24_36": 39, "31_38": 40, "38_31": 41, "69_48": 42, "48_69": 43, "27_65": 44, "65_27": 45, "45_45": 46, "12_20": 47, "20_12": 48, "16_19": 49, "19_16": 50, "93_93": 51, "97_69": 52, "69_97": 53, "97_38": 54, "38_97": 55, "16_59": 56, "59_16": 57, "35_59": 58, "59_35": 59, "34_97": 60, "97_34": 61, "34_38": 62, "38_34": 63, "14_71": 64, "71_14": 65, "82_13": 66, "13_82": 67, "39_59": 68, "59_39": 69, "88_70": 70, "70_88": 71, "88_48": 72, "48_88": 73, "48_28": 74, "28_48": 75, "96_51": 76, "51_96": 77, "96_37": 78, "37_96": 79, "22_19": 80, "19_22": 81, "18_2": 82, "2_18": 83, "18_27": 84, "27_18": 85, "18_65": 86, "65_18": 87, "22_18": 88, "18_22": 89, "91_65": 90, "65_91": 91, "12_12": 92, "35_19": 93, "19_35": 94, "34_12": 95, "12_34": 96, "81_20": 97, "20_81": 98, "81_12": 99, "12_81": 100, "70_38": 101, "38_70": 102, "96_20": 103, "20_96": 104, "96_38": 105, "38_96": 106, "70_52": 107, "52_70": 108, "67_67": 109, "67_50": 110, "50_67": 111, "39_19": 112, "19_39": 113, "5_41": 114, "41_5": 115, "56_56": 116, "94_88": 117, "88_94": 118, "48_48": 119, "48_65": 120, "65_48": 121, "5_33": 122, "33_5": 123, "5_5": 124, "95_97": 125, "97_95": 126, "95_69": 127, "69_95": 128, "51_18": 129, "18_51": 130, "51_26": 131, "26_51": 132, "83_83": 133, "5_89": 134, "89_5": 135, "53_38": 136, "38_53": 137, "30_71": 138, "71_30": 139, "22_59": 140, "59_22": 141, "54_20": 142, "20_54": 143, "54_12": 144, "12_54": 145, "54_48": 146, "48_54": 147, "54_84": 148, "84_54": 149, "70_11": 150, "11_70": 151, "70_58": 152, "58_70": 153, "65_9": 154, "9_65": 155, "6_18": 156, "18_6": 157, "70_70": 158, "21_65": 159, "65_21": 160, "30_18": 161, "18_30": 162, "53_58": 163, "58_53": 164, "53_9": 165, "9_53": 166, "53_70": 167, "70_53": 168, "53_55": 169, "55_53": 170, "28_38": 171, "38_28": 172, "51_51": 173, "51_48": 174, "48_51": 175, "5_85": 176, "85_5": 177, "95_38": 178, "38_95": 179, "29_70": 180, "70_29": 181, "29_8": 182, "8_29": 183, "29_96": 184, "96_29": 185, "18_88": 186, "88_18": 187, "95_82": 188, "82_95": 189, "95_59": 190, "59_95": 191, "67_93": 192, "93_67": 193, "21_18": 194, "18_21": 195, "24_24": 196, "33_18": 197, "18_33": 198, "48_20": 199, "20_48": 200, "48_84": 201, "84_48": 202, "65_65": 203, "65_12": 204, "12_65": 205, "65_54": 206, "54_65": 207, "28_27": 208, "27_28": 209, "67_96": 210, "96_67": 211, "67_31": 212, "31_67": 213, "18_72": 214, "72_18": 215, "100_38": 216, "38_100": 217, "60_60": 218, "48_91": 219, "91_48": 220, "77_19": 221, "19_77": 222, "84_12": 223, "12_84": 224, "84_84": 225, "96_96": 226, "30_30": 227, "43_43": 228, "35_21": 229, "21_35": 230, "94_94": 231, "52_52": 232, "37_11": 233, "11_37": 234, "14_53": 235, "53_14": 236, "89_95": 237, "95_89": 238, "48_38": 239, "38_48": 240, "11_38": 241, "38_11": 242, "18_5": 243, "5_18": 244, "18_63": 245, "63_18": 246, "67_89": 247, "89_67": 248, "67_81": 249, "81_67": 250, "67_51": 251, "51_67": 252, "42_94": 253, "94_42": 254, "42_50": 255, "50_42": 256, "42_85": 257, "85_42": 258, "42_38": 259, "38_42": 260, "30_91": 261, "91_30": 262, "26_41": 263, "41_26": 264, "70_54": 265, "54_70": 266, "70_37": 267, "37_70": 268, "2_96": 269, "96_2": 270, "22_21": 271, "21_22": 272, "39_82": 273, "82_39": 274, "46_53": 275, "53_46": 276, "37_92": 277, "92_37": 278, "18_41": 279, "41_18": 280, "14_65": 281, "65_14": 282, "39_21": 283, "21_39": 284, "40_96": 285, "96_40": 286, "40_48": 287, "48_40": 288, "54_54": 289, "29_38": 290, "38_29": 291, "18_48": 292, "48_18": 293, "92_2": 294, "2_92": 295, "92_77": 296, "77_92": 297, "92_92": 298, "92_96": 299, "96_92": 300, "92_67": 301, "67_92": 302, "92_13": 303, "13_92": 304, "70_82": 305, "82_70": 306, "67_43": 307, "43_67": 308, "65_62": 309, "62_65": 310, "22_20": 311, "20_22": 312, "68_3": 313, "3_68": 314, "18_66": 315, "66_18": 316, "81_96": 317, "96_81": 318, "81_54": 319, "54_81": 320, "58_36": 321, "36_58": 322, "58_31": 323, "31_58": 324, "58_58": 325, "36_99": 326, "54_82": 327, "82_54": 328, "54_88": 329, "88_54": 330, "54_91": 331, "91_54": 332, "65_94": 333, "94_65": 334, "18_18": 335, "70_9": 336, "9_70": 337, "90_91": 338, "91_90": 339, "82_59": 340, "59_82": 341, "61_61": 342, "61_78": 343, "78_61": 344, "61_41": 345, "41_61": 346, "44_94": 347, "94_44": 348, "12_48": 349, "48_12": 350, "91_71": 351, "71_91": 352, "74_90": 353, "90_74": 354, "48_66": 355, "66_48": 356, "30_82": 357, "82_30": 358, "18_37": 359, "37_18": 360, "38_21": 361, "96_89": 362, "89_96": 363, "97_48": 364, "48_97": 365, "97_84": 366, "84_97": 367, "98_14": 368, "14_98": 369, "30_65": 370, "65_30": 371, "72_19": 372, "19_72": 373, "31_96": 374, "96_31": 375, "39_65": 376, "65_39": 377, "68_85": 378, "85_68": 379, "57_57": 380, "88_38": 381, "38_88": 382, "10_27": 383, "27_10": 384, "38_38": 385, "70_33": 386, "33_70": 387, "60_43": 388, "43_60": 389, "60_93": 390, "93_60": 391, "60_96": 392, "96_60": 393, "60_71": 394, "71_60": 395, "60_90": 396, "90_60": 397, "60_91": 398, "91_60": 399, "87_82": 400, "82_87": 401, "77_82": 402, "82_77": 403, "37_12": 404, "12_37": 405, "67_9": 406, "9_67": 407, "67_54": 408, "54_67": 409, "54_38": 410, "38_54": 411, "54_37": 412, "37_54": 413, "51_54": 414, "54_51": 415, "51_84": 416, "84_51": 417, "51_89": 418, "89_51": 419, "51_97": 420, "97_51": 421, "51_12": 422, "12_51": 423, "51_93": 424, "93_51": 425, "51_20": 426, "20_51": 427, "51_40": 428, "40_51": 429, "77_85": 430, "85_77": 431, "2_2": 432, "2_54": 433, "54_2": 434, "2_55": 435, "55_2": 436, "21_21": 437, "81_84": 438, "84_81": 439, "18_10": 440, "10_18": 441, "31_18": 442, "18_31": 443, "26_2": 444, "2_26": 445, "96_93": 446, "93_96": 447, "96_48": 448, "48_96": 449, "78_96": 450, "96_78": 451, "88_89": 452, "89_88": 453, "27_27": 454, "49_37": 455, "37_49": 456, "49_49": 457, "30_79": 458, "79_30": 459, "54_78": 460, "78_54": 461, "54_41": 462, "41_54": 463, "31_48": 464, "48_31": 465, "18_8": 466, "8_18": 467, "69_38": 468, "38_69": 469, "44_82": 470, "82_44": 471, "77_59": 472, "59_77": 473, "56_45": 474, "45_56": 475, "86_94": 476, "94_86": 477, "65_88": 478, "88_65": 479, "38_84": 480, "84_38": 481, "51_11": 482, "11_51": 483, "2_25": 484, "25_2": 485, "81_48": 486, "48_81": 487, "57_94": 488, "94_57": 489, "18_70": 490, "70_18": 491, "81_92": 492, "92_81": 493, "81_78": 494, "78_81": 495, "81_31": 496, "31_81": 497, "81_70": 498, "70_81": 499, "96_69": 500, "69_96": 501, "2_11": 502, "11_2": 503, "31_80": 504, "80_31": 505, "26_82": 506, "82_26": 507, "26_65": 508, "65_26": 509, "36_38": 510, "38_36": 511, "36_43": 512, "43_36": 513, "36_36": 514, "14_14": 515, "53_96": 516, "96_53": 517, "53_53": 518, "45_65": 519, "65_45": 520, "82_82": 521, "53_78": 522, "78_53": 523, "43_20": 524, "20_43": 525, "2_21": 526, "21_2": 527, "2_82": 528, "82_2": 529, "2_94": 530, "94_2": 531, "77_77": 532, "22_22": 533, "5_82": 534, "82_5": 535, "5_95": 536, "95_5": 537, "96_54": 538, "54_96": 539, "96_70": 540, "70_96": 541, "78_78": 542, "78_38": 543, "38_78": 544, "51_78": 545, "78_51": 546, "55_55": 547, "80_80": 548, "26_85": 549, "85_26": 550, "2_70": 551, "70_2": 552, "54_32": 553, "32_54": 554, "94_77": 555, "77_94": 556, "49_11": 557, "11_49": 558, "2_5": 559, "5_2": 560, "2_37": 561, "37_2": 562, "33_77": 563, "77_33": 564, "41_38": 565, "38_41": 566, "14_18": 567, "18_14": 568, "80_11": 569, "11_80": 570, "80_58": 571, "58_80": 572, "14_78": 573, "78_14": 574, "83_38": 575, "38_83": 576, "98_82": 577, "82_98": 578, "5_72": 579, "72_5": 580, "96_18": 581, "18_96": 582, "96_88": 583, "88_96": 584, "96_12": 585, "12_96": 586, "96_58": 587, "58_96": 588, "96_9": 589, "9_96": 590, "72_33": 591, "33_72": 592, "98_98": 593, "98_15": 594, "15_98": 595, "26_11": 596, "11_26": 597, "53_54": 598, "54_53": 599, "82_21": 600, "21_82": 601, "29_55": 602, "55_29": 603, "62_54": 604, "54_62": 605, "65_23": 606, "23_65": 607, "65_82": 608, "82_65": 609, "26_7": 610, "7_26": 611, "54_93": 612, "93_54": 613, "72_4": 614, "4_72": 615, "72_30": 616, "30_72": 617, "100_11": 618, "11_100": 619, "100_100": 620, "96_33": 621, "33_96": 622, "96_5": 623, "5_96": 624, "4_71": 625, "71_4": 626, "38_55": 627, "55_38": 628, "38_52": 629, "52_38": 630, "2_45": 631, "45_2": 632, "37_13": 633, "13_37": 634, "37_37": 635, "93_50": 636, "50_93": 637, "93_43": 638, "43_93": 639, "16_57": 640, "57_16": 641, "25_77": 642, "77_25": 643, "5_65": 644, "65_5": 645, "2_38": 646, "38_2": 647, "31_31": 648, "65_66": 649, "66_65": 650, "94_19": 651, "19_94": 652, "65_11": 653, "11_65": 654, "65_15": 655, "15_65": 656, "94_54": 657, "54_94": 658, "65_41": 659, "41_65": 660, "65_77": 661, "77_65": 662, "22_87": 663, "87_22": 664, "96_43": 665, "43_96": 666, "95_11": 667, "11_95": 668, "101_38": 669, "38_101": 670, "67_88": 671, "88_67": 672, "54_89": 673, "89_54": 674, "93_31": 675, "31_93": 676, "30_85": 677, "85_30": 678, "30_22": 679, "22_30": 680, "35_62": 681, "62_35": 682, "14_8": 683, "8_14": 684, "96_41": 685, "41_96": 686, "54_43": 687, "43_54": 688, "68_96": 689, "96_68": 690, "99_70": 691, "70_99": 692, "99_38": 693, "38_99": 694, "71_96": 695, "96_71": 696, "10_19": 697, "19_10": 698, "93_48": 699, "48_93": 700, "5_94": 701, "94_5": 702, "52_59": 703, "59_52": 704, "69_20": 705, "20_69": 706, "53_11": 707, "11_53": 708, "53_48": 709, "48_53": 710, "87_20": 711, "20_87": 712, "93_20": 713, "20_93": 714, "90_90": 715, "4_5": 716, "5_4": 717, "56_81": 718, "81_56": 719, "50_50": 720, "81_51": 721, "51_81": 722, "5_99": 723, "99_5": 724, "5_77": 725, "77_5": 726, "5_30": 727, "30_5": 728, "82_24": 729, "24_82": 730, "30_59": 731, "59_30": 732, "10_10": 733, "26_18": 734, "18_26": 735, "77_18": 736, "18_77": 737, "50_96": 738, "96_50": 739, "88_20": 740, "20_88": 741, "69_69": 742, "69_84": 743, "84_69": 744, "69_54": 745, "54_69": 746, "84_45": 747, "45_84": 748, "81_66": 749, "66_81": 750, "72_20": 751, "20_72": 752, "30_50": 753, "50_30": 754, "29_11": 755, "11_29": 756, "18_12": 757, "12_18": 758, "48_52": 759, "52_48": 760, "53_7": 761, "7_53": 762, "53_93": 763, "93_53": 764, "65_33": 765, "33_65": 766, "27_87": 767, "87_27": 768, "36_44": 769, "26_55": 770, "55_26": 771, "11_11": 772, "67_48": 773, "48_67": 774, "67_60": 775, "60_67": 776, "67_38": 777, "38_67": 778, "81_93": 779, "93_81": 780, "88_43": 781, "43_88": 782, "27_2": 783, "2_27": 784, "2_46": 785, "46_2": 786, "2_14": 787, "14_2": 788, "2_12": 789, "12_2": 790, "2_31": 791, "31_2": 792, "48_70": 793, "70_48": 794, "14_86": 795, "86_14": 796, "97_12": 797, "12_97": 798, "41_78": 799, "78_41": 800, "41_41": 801, "32_32": 802, "88_69": 803, "69_88": 804, "31_77": 805, "77_31": 806, "14_48": 807, "48_14": 808, "81_18": 809, "18_81": 810, "41_11": 811, "11_41": 812, "87_31": 813, "31_87": 814, "89_20": 815, "20_89": 816, "89_66": 817, "66_89": 818, "61_31": 819, "31_61": 820, "65_85": 821, "85_65": 822, "15_23": 823, "23_15": 824, "15_91": 825, "91_15": 826, "15_71": 827, "71_15": 828, "15_72": 829, "72_15": 830, "15_26": 831, "26_15": 832, "70_55": 833, "55_70": 834, "67_20": 835, "20_67": 836, "99_18": 837, "14_96": 838, "96_14": 839, "82_81": 840, "81_82": 841, "93_21": 842, "21_93": 843, "93_18": 844, "18_93": 845, "77_20": 846, "20_77": 847, "2_100": 848, "100_2": 849, "67_94": 850, "94_67": 851, "14_38": 852, "38_14": 853, "92_93": 854, "93_92": 855, "92_51": 856, "51_92": 857, "58_100": 858, "54_72": 859, "72_54": 860, "65_44": 861, "44_65": 862, "35_18": 863, "18_35": 864, "65_28": 865, "28_65": 866, "82_19": 867, "19_82": 868, "27_12": 869, "12_27": 870, "97_96": 871, "96_97": 872, "89_48": 873, "48_89": 874, "89_89": 875, "3_59": 876, "59_3": 877, "82_48": 878, "48_82": 879, "26_45": 880, "45_26": 881, "81_65": 882, "65_81": 883, "80_36": 884, "36_80": 885, "19_38": 886, "38_19": 887, "70_36": 888, "36_70": 889, "70_43": 890, "43_70": 891, "100_70": 892, "70_100": 893, "67_30": 894, "30_67": 895, "67_79": 896, "79_67": 897, "6_94": 898, "94_6": 899, "35_2": 900, "2_35": 901, "77_27": 902, "27_77": 903, "34_78": 904, "78_34": 905, "101_96": 906, "96_101": 907, "5_14": 908, "14_5": 909, "70_69": 910, "69_70": 911, "70_31": 912, "31_70": 913, "54_92": 914, "92_54": 915, "34_20": 916, "20_34": 917, "2_99": 918, "99_2": 919, "53_51": 920, "51_53": 921, "34_48": 922, "48_34": 923, "28_28": 924, "28_70": 925, "70_28": 926, "26_50": 927, "50_26": 928, "40_40": 929, "40_20": 930, "20_40": 931, "90_4": 932, "4_90": 933, "90_82": 934, "82_90": 935, "90_76": 936, "76_90": 937, "21_78": 938, "78_21": 939, "88_84": 940, "84_88": 941, "53_18": 942, "18_53": 943, "9_9": 944, "2_41": 945, "41_2": 946, "64_37": 947, "37_64": 948, "85_18": 949, "18_85": 950, "85_85": 951, "83_70": 952, "70_83": 953, "96_8": 954, "8_96": 955, "26_98": 956, "98_26": 957, "41_34": 958, "34_41": 959, "2_13": 960, "13_2": 961, "7_85": 962, "85_7": 963, "2_59": 964, "59_2": 965, "16_26": 966, "26_16": 967, "42_78": 968, "78_42": 969, "66_69": 970, "69_66": 971, "66_38": 972, "38_66": 973, "24_21": 974, "21_24": 975, "24_14": 976, "14_24": 977, "46_46": 978, "77_14": 979, "19_66": 980, "66_19": 981, "85_48": 982, "48_85": 983, "86_27": 984, "27_86": 985, "53_98": 986, "98_53": 987, "36_77": 988, "22_31": 989, "31_22": 990, "3_54": 991, "54_3": 992, "3_88": 993, "88_3": 994, "5_24": 995, "24_5": 996, "86_59": 997, "59_86": 998, "10_82": 999, "82_10": 1000, "84_20": 1001, "20_84": 1002, "60_30": 1003, "30_60": 1004, "60_74": 1005, "74_60": 1006, "82_37": 1007, "37_82": 1008, "88_12": 1009, "12_88": 1010, "81_50": 1011, "50_81": 1012, "100_48": 1013, "48_100": 1014, "65_57": 1015, "57_65": 1016, "96_83": 1017, "83_96": 1018, "94_48": 1019, "48_94": 1020, "69_45": 1021, "45_69": 1022, "77_21": 1023, "69_50": 1024, "50_69": 1025, "69_43": 1026, "43_69": 1027, "94_14": 1028, "14_94": 1029, "18_39": 1030, "39_18": 1031, "14_27": 1032, "27_14": 1033, "14_19": 1034, "19_14": 1035, "39_85": 1036, "85_39": 1037, "83_47": 1038, "47_83": 1039, "26_12": 1040, "12_26": 1041, "88_66": 1042, "66_88": 1043, "50_38": 1044, "38_50": 1045, "18_38": 1046, "38_18": 1047, "51_38": 1048, "38_51": 1049, "16_18": 1050, "18_16": 1051, "36_53": 1052, "14_54": 1053, "54_14": 1054, "82_18": 1055, "98_11": 1056, "11_98": 1057, "7_18": 1058, "18_7": 1059, "22_62": 1060, "62_22": 1061, "75_12": 1062, "12_75": 1063, "65_72": 1064, "72_65": 1065, "26_81": 1066, "81_26": 1067, "2_95": 1068, "95_2": 1069, "24_77": 1070, "77_24": 1071, "65_96": 1072, "96_65": 1073, "8_26": 1074, "26_8": 1075, "31_39": 1076, "39_31": 1077, "12_38": 1078, "38_12": 1079, "65_19": 1080, "19_65": 1081, "96_66": 1082, "66_96": 1083, "96_84": 1084, "84_96": 1085, "53_82": 1086, "82_53": 1087, "66_66": 1088, "65_100": 1089, "100_65": 1090, "14_59": 1091, "59_14": 1092, "58_99": 1093, "99_58": 1094, "58_11": 1095, "11_58": 1096, "93_90": 1097, "90_93": 1098, "53_8": 1099, "8_53": 1100, "53_44": 1101, "44_53": 1102, "27_76": 1103, "76_27": 1104, "2_63": 1105, "63_2": 1106, "12_66": 1107, "66_12": 1108, "12_85": 1109, "85_12": 1110, "12_8": 1111, "8_12": 1112, "29_48": 1113, "48_29": 1114, "54_66": 1115, "66_54": 1116, "32_12": 1117, "12_32": 1118, "32_72": 1119, "72_32": 1120, "32_48": 1121, "48_32": 1122, "14_10": 1123, "10_14": 1124, "11_20": 1125, "20_11": 1126, "11_96": 1127, "96_11": 1128, "54_40": 1129, "40_54": 1130, "35_77": 1131, "77_35": 1132, "69_65": 1133, "65_69": 1134, "70_34": 1135, "34_70": 1136, "25_48": 1137, "48_25": 1138, "54_59": 1139, "59_54": 1140, "27_23": 1141, "23_27": 1142, "82_23": 1143, "23_82": 1144, "77_80": 1145, "80_77": 1146, "58_34": 1147, "34_58": 1148, "28_54": 1149, "54_28": 1150, "57_10": 1151, "10_57": 1152, "35_35": 1153, "41_28": 1154, "28_41": 1155, "41_51": 1156, "51_41": 1157, "41_36": 1158, "36_41": 1159, "41_97": 1160, "97_41": 1161, "41_29": 1162, "29_41": 1163, "41_81": 1164, "81_41": 1165, "41_69": 1166, "69_41": 1167, "41_70": 1168, "70_41": 1169, "41_83": 1170, "83_41": 1171, "41_48": 1172, "48_41": 1173, "41_55": 1174, "55_41": 1175, "41_37": 1176, "37_41": 1177, "41_100": 1178, "100_41": 1179, "41_40": 1180, "40_41": 1181, "41_47": 1182, "47_41": 1183, "41_52": 1184, "52_41": 1185, "41_20": 1186, "20_41": 1187, "25_18": 1188, "18_25": 1189, "82_27": 1190, "27_82": 1191, "2_20": 1192, "20_2": 1193, "16_27": 1194, "27_16": 1195, "77_30": 1196, "30_77": 1197, "28_52": 1198, "52_28": 1199, "28_8": 1200, "8_28": 1201, "7_82": 1202, "82_7": 1203, "89_12": 1204, "12_89": 1205, "88_93": 1206, "93_88": 1207, "19_95": 1208, "95_19": 1209, "37_61": 1210, "61_37": 1211, "98_65": 1212, "65_98": 1213, "30_31": 1214, "31_30": 1215, "40_38": 1216, "38_40": 1217, "40_36": 1218, "36_40": 1219, "40_55": 1220, "55_40": 1221, "100_83": 1222, "83_100": 1223, "82_85": 1224, "85_82": 1225, "80_53": 1226, "53_80": 1227, "87_64": 1228, "64_87": 1229, "52_18": 1230, "18_52": 1231, "54_50": 1232, "50_54": 1233, "16_65": 1234, "65_16": 1235, "26_99": 1236, "99_26": 1237, "27_94": 1238, "94_27": 1239, "18_92": 1240, "92_18": 1241, "58_48": 1242, "48_58": 1243, "58_28": 1244, "28_58": 1245, "45_88": 1246, "88_45": 1247, "18_78": 1248, "78_18": 1249, "97_20": 1250, "20_97": 1251, "2_65": 1252, "65_2": 1253, "12_31": 1254, "31_12": 1255, "50_20": 1256, "20_50": 1257, "21_53": 1258, "53_21": 1259, "38_22": 1260, "22_38": 1261, "77_38": 1262, "38_77": 1263, "70_20": 1264, "20_70": 1265, "4_81": 1266, "81_4": 1267, "58_14": 1268, "14_58": 1269, "58_27": 1270, "27_58": 1271, "70_97": 1272, "97_70": 1273, "97_54": 1274, "54_97": 1275, "48_43": 1276, "43_48": 1277, "26_37": 1278, "37_26": 1279, "54_31": 1280, "31_54": 1281, "74_74": 1282, "21_66": 1283, "66_21": 1284, "28_11": 1285, "11_28": 1286, "64_65": 1287, "65_64": 1288, "39_42": 1289, "42_39": 1290, "47_47": 1291, "4_11": 1292, "11_4": 1293, "21_19": 1294, "19_21": 1295, "97_67": 1296, "67_97": 1297, "35_78": 1298, "78_35": 1299, "81_53": 1300, "53_81": 1301, "81_38": 1302, "38_81": 1303, "84_66": 1304, "66_84": 1305, "84_101": 1306, "101_84": 1307, "34_11": 1308, "11_34": 1309, "11_12": 1310, "12_11": 1311, "54_83": 1312, "83_54": 1313, "5_53": 1314, "53_5": 1315, "34_87": 1316, "87_34": 1317, "81_11": 1318, "11_81": 1319, "81_34": 1320, "34_81": 1321, "95_53": 1322, "53_95": 1323, "66_20": 1324, "20_66": 1325, "85_95": 1326, "95_85": 1327, "68_48": 1328, "48_68": 1329, "95_81": 1330, "81_95": 1331, "48_55": 1332, "55_48": 1333, "33_19": 1334, "19_33": 1335, "4_18": 1336, "18_4": 1337, "53_16": 1338, "16_53": 1339, "53_12": 1340, "12_53": 1341, "82_66": 1342, "66_82": 1343, "36_48": 1344, "48_36": 1345, "77_87": 1346, "87_77": 1347, "82_92": 1348, "92_82": 1349, "93_38": 1350, "38_93": 1351, "18_11": 1352, "11_18": 1353, "7_33": 1354, "33_7": 1355, "99_41": 1356, "41_99": 1357, "65_38": 1358, "38_65": 1359, "44_70": 1360, "70_44": 1361, "44_38": 1362, "38_44": 1363, "44_44": 1364, "44_95": 1365, "95_44": 1366, "44_33": 1367, "33_44": 1368, "29_43": 1369, "43_29": 1370, "29_20": 1371, "20_29": 1372, "29_12": 1373, "12_29": 1374, "29_31": 1375, "31_29": 1376, "29_99": 1377, "99_29": 1378, "97_97": 1379, "64_92": 1380, "92_64": 1381, "2_85": 1382, "85_2": 1383, "12_64": 1384, "64_12": 1385, "12_67": 1386, "67_12": 1387, "30_95": 1388, "95_30": 1389, "9_31": 1390, "31_9": 1391, "95_65": 1392, "65_95": 1393, "14_12": 1394, "12_14": 1395, "27_19": 1396, "19_27": 1397, "36_31": 1398, "31_52": 1399, "52_31": 1400, "31_11": 1401, "11_31": 1402, "92_12": 1403, "12_92": 1404, "30_88": 1405, "88_30": 1406, "84_65": 1407, "65_84": 1408, "69_27": 1409, "27_69": 1410, "21_85": 1411, "85_21": 1412, "8_11": 1413, "11_8": 1414, "82_14": 1415, "14_82": 1416, "82_31": 1417, "31_82": 1418, "8_8": 1419, "70_27": 1420, "27_70": 1421, "25_66": 1422, "66_25": 1423, "54_34": 1424, "34_54": 1425, "54_11": 1426, "11_54": 1427, "21_56": 1428, "56_21": 1429, "37_38": 1430, "38_37": 1431, "26_77": 1432, "77_26": 1433, "49_41": 1434, "41_49": 1435, "67_84": 1436, "84_67": 1437, "32_20": 1438, "20_32": 1439, "89_85": 1440, "85_89": 1441, "93_99": 1442, "99_93": 1443, "93_36": 1444, "36_93": 1445, "53_85": 1446, "85_53": 1447, "85_69": 1448, "69_85": 1449, "85_38": 1450, "38_85": 1451, "66_71": 1452, "71_66": 1453, "12_43": 1454, "43_12": 1455, "2_61": 1456, "61_2": 1457, "5_59": 1458, "59_5": 1459, "96_85": 1460, "85_96": 1461, "65_25": 1462, "25_65": 1463, "83_48": 1464, "48_83": 1465, "38_89": 1466, "89_38": 1467, "81_89": 1468, "89_81": 1469, "62_82": 1470, "82_62": 1471, "91_77": 1472, "77_91": 1473, "67_7": 1474, "7_67": 1475, "47_27": 1476, "27_47": 1477, "93_70": 1478, "70_93": 1479, "86_78": 1480, "78_86": 1481, "70_12": 1482, "12_70": 1483, "5_100": 1484, "100_5": 1485, "2_87": 1486, "87_2": 1487, "2_88": 1488, "88_2": 1489, "67_68": 1490, "68_67": 1491, "21_20": 1492, "20_21": 1493, "53_37": 1494, "37_53": 1495, "88_29": 1496, "29_88": 1497, "70_51": 1498, "51_70": 1499, "74_94": 1500, "94_74": 1501, "74_65": 1502, "65_74": 1503, "51_43": 1504, "43_51": 1505, "60_38": 1506, "38_60": 1507, "60_36": 1508, "36_60": 1509, "90_38": 1510, "38_90": 1511, "90_67": 1512, "67_90": 1513, "90_36": 1514, "36_90": 1515, "90_71": 1516, "71_90": 1517, "90_77": 1518, "77_90": 1519, "90_79": 1520, "79_90": 1521, "90_30": 1522, "30_90": 1523, "69_11": 1524, "11_69": 1525, "56_59": 1526, "59_56": 1527, "56_48": 1528, "48_56": 1529, "94_96": 1530, "96_94": 1531, "50_48": 1532, "48_50": 1533, "51_2": 1534, "2_51": 1535, "70_8": 1536, "8_70": 1537, "34_27": 1538, "27_34": 1539, "48_11": 1540, "11_48": 1541, "31_28": 1542, "28_31": 1543, "77_2": 1544, "2_77": 1545, "4_91": 1546, "91_4": 1547, "48_72": 1548, "72_48": 1549, "18_84": 1550, "84_18": 1551, "5_34": 1552, "34_5": 1553, "98_19": 1554, "19_98": 1555, "38_86": 1556, "86_38": 1557, "38_47": 1558, "47_38": 1559, "21_25": 1560, "25_21": 1561, "69_12": 1562, "12_69": 1563, "30_81": 1564, "81_30": 1565, "37_14": 1566, "14_37": 1567, "54_45": 1568, "45_54": 1569, "37_66": 1570, "66_37": 1571, "20_8": 1572, "8_20": 1573, "20_20": 1574, "18_61": 1575, "61_18": 1576, "82_11": 1577, "11_82": 1578, "36_82": 1579, "82_91": 1580, "91_82": 1581, "2_53": 1582, "53_2": 1583, "2_62": 1584, "62_2": 1585, "25_40": 1586, "40_25": 1587, "77_42": 1588, "42_77": 1589, "64_14": 1590, "14_64": 1591, "41_13": 1592, "13_41": 1593, "62_57": 1594, "57_62": 1595, "7_54": 1596, "54_7": 1597, "36_10": 1598, "10_36": 1599, "82_20": 1600, "20_82": 1601, "72_88": 1602, "88_72": 1603, "72_77": 1604, "77_72": 1605, "69_51": 1606, "51_69": 1607, "16_100": 1608, "100_16": 1609, "27_80": 1610, "80_27": 1611, "28_20": 1612, "20_28": 1613, "95_27": 1614, "27_95": 1615, "56_84": 1616, "84_56": 1617, "63_13": 1618, "13_63": 1619, "2_89": 1620, "89_2": 1621, "8_37": 1622, "37_8": 1623, "51_50": 1624, "50_51": 1625, "95_34": 1626, "34_95": 1627, "51_5": 1628, "5_51": 1629, "51_49": 1630, "49_51": 1631, "51_65": 1632, "65_51": 1633, "26_26": 1634, "30_78": 1635, "78_30": 1636, "28_81": 1637, "81_28": 1638, "18_19": 1639, "19_18": 1640, "2_22": 1641, "22_2": 1642, "88_71": 1643, "71_88": 1644, "91_22": 1645, "22_91": 1646, "70_19": 1647, "19_70": 1648, "91_11": 1649, "11_91": 1650, "24_30": 1651, "30_24": 1652, "84_8": 1653, "8_84": 1654, "84_72": 1655, "72_84": 1656, "84_46": 1657, "46_84": 1658, "84_91": 1659, "91_84": 1660, "39_98": 1661, "98_39": 1662, "53_89": 1663, "89_53": 1664, "53_77": 1665, "77_53": 1666, "97_43": 1667, "43_97": 1668, "68_97": 1669, "97_68": 1670, "58_2": 1671, "2_58": 1672, "96_99": 1673, "99_96": 1674, "34_69": 1675, "69_34": 1676, "97_65": 1677, "65_97": 1678, "16_85": 1679, "85_16": 1680, "24_2": 1681, "2_24": 1682, "24_65": 1683, "65_24": 1684, "21_59": 1685, "59_21": 1686, "84_59": 1687, "59_84": 1688, "98_18": 1689, "18_98": 1690, "78_20": 1691, "20_78": 1692, "82_71": 1693, "71_82": 1694, "98_61": 1695, "61_98": 1696, "99_46": 1697, "46_99": 1698, "96_90": 1699, "90_96": 1700, "80_99": 1701, "99_80": 1702, "69_93": 1703, "93_69": 1704, "26_72": 1705, "72_26": 1706, "80_70": 1707, "70_80": 1708, "7_38": 1709, "38_7": 1710, "50_84": 1711, "84_50": 1712, "94_59": 1713, "59_94": 1714, "7_51": 1715, "51_7": 1716, "52_27": 1717, "27_52": 1718, "21_46": 1719, "46_21": 1720, "21_44": 1721, "44_21": 1722, "95_12": 1723, "12_95": 1724, "77_48": 1725, "48_77": 1726, "30_57": 1727, "57_30": 1728, "91_81": 1729, "81_91": 1730, "2_81": 1731, "81_2": 1732, "19_19": 1733, "28_37": 1734, "37_28": 1735, "35_58": 1736, "58_35": 1737, "95_87": 1738, "87_95": 1739, "5_88": 1740, "88_5": 1741, "37_65": 1742, "65_37": 1743, "93_89": 1744, "89_93": 1745, "91_12": 1746, "12_91": 1747, "55_12": 1748, "12_55": 1749, "55_81": 1750, "81_55": 1751, "55_96": 1752, "96_55": 1753, "22_53": 1754, "53_22": 1755, "87_38": 1756, "38_87": 1757, "93_30": 1758, "30_93": 1759, "34_96": 1760, "96_34": 1761, "85_59": 1762, "59_85": 1763, "48_37": 1764, "37_48": 1765, "34_34": 1766, "91_62": 1767, "62_91": 1768, "8_38": 1769, "38_8": 1770, "2_19": 1771, "19_2": 1772, "41_94": 1773, "94_41": 1774, "25_38": 1775, "38_25": 1776, "29_67": 1777, "67_29": 1778, "92_87": 1779, "87_92": 1780, "8_43": 1781, "43_8": 1782, "16_94": 1783, "94_16": 1784, "27_20": 1785, "20_27": 1786, "65_78": 1787, "78_65": 1788, "35_38": 1789, "38_35": 1790, "5_12": 1791, "12_5": 1792, "21_87": 1793, "87_21": 1794, "5_38": 1795, "38_5": 1796, "94_72": 1797, "72_94": 1798, "81_81": 1799, "50_66": 1800, "66_50": 1801, "12_78": 1802, "78_12": 1803, "67_69": 1804, "69_67": 1805, "14_31": 1806, "31_14": 1807, "88_78": 1808, "78_88": 1809, "21_62": 1810, "62_21": 1811, "51_31": 1812, "31_51": 1813, "6_99": 1814, "99_6": 1815, "48_7": 1816, "7_48": 1817, "26_94": 1818, "94_26": 1819, "26_21": 1820, "21_26": 1821, "82_72": 1822, "72_82": 1823, "30_26": 1824, "26_30": 1825, "94_29": 1826, "29_94": 1827, "39_57": 1828, "57_39": 1829, "36_96": 1830, "96_36": 1831, "58_71": 1832, "71_58": 1833, "58_9": 1834, "9_58": 1835, "16_21": 1836, "21_16": 1837, "58_33": 1838, "33_58": 1839, "53_65": 1840, "65_53": 1841, "26_19": 1842, "19_26": 1843, "65_13": 1844, "13_65": 1845, "8_21": 1846, "21_8": 1847, "11_83": 1848, "83_11": 1849, "4_30": 1850, "30_4": 1851, "31_5": 1852, "5_31": 1853, "60_76": 1854, "76_60": 1855, "81_43": 1856, "43_81": 1857, "99_21": 1858, "21_99": 1859, "78_59": 1860, "59_78": 1861, "40_11": 1862, "11_40": 1863, "54_18": 1864, "18_54": 1865, "54_58": 1866, "58_54": 1867, "12_94": 1868, "94_12": 1869, "48_78": 1870, "78_48": 1871, "88_19": 1872, "19_88": 1873, "5_70": 1874, "70_5": 1875, "30_27": 1876, "27_30": 1877, "38_20": 1878, "20_38": 1879, "38_92": 1880, "92_38": 1881, "38_3": 1882, "3_38": 1883, "24_87": 1884, "87_24": 1885, "75_75": 1886, "30_87": 1887, "87_30": 1888, "31_89": 1889, "89_31": 1890, "87_78": 1891, "78_87": 1892, "78_69": 1893, "69_78": 1894, "78_97": 1895, "97_78": 1896, "78_55": 1897, "55_78": 1898, "8_36": 1899, "36_8": 1900, "94_100": 1901, "100_94": 1902, "5_66": 1903, "66_5": 1904, "34_21": 1905, "22_99": 1906, "99_22": 1907, "93_85": 1908, "85_93": 1909, "93_94": 1910, "94_93": 1911, "93_82": 1912, "82_93": 1913, "62_77": 1914, "77_62": 1915, "30_14": 1916, "14_30": 1917, "24_81": 1918, "81_24": 1919, "18_50": 1920, "50_18": 1921, "86_18": 1922, "18_86": 1923, "69_52": 1924, "52_69": 1925, "69_55": 1926, "55_69": 1927, "93_57": 1928, "57_93": 1929, "18_49": 1930, "49_18": 1931, "89_69": 1932, "69_89": 1933, "89_84": 1934, "84_89": 1935, "99_78": 1936, "78_99": 1937, "14_46": 1938, "46_14": 1939, "34_51": 1940, "51_34": 1941, "34_42": 1942, "42_34": 1943, "34_30": 1944, "30_34": 1945, "34_86": 1946, "86_34": 1947, "54_36": 1948, "36_54": 1949, "72_91": 1950, "91_72": 1951, "5_11": 1952, "11_5": 1953, "57_21": 1954, "21_57": 1955, "37_67": 1956, "67_37": 1957, "5_81": 1958, "81_5": 1959, "36_11": 1960, "11_36": 1961, "2_67": 1962, "67_2": 1963, "96_82": 1964, "82_96": 1965, "84_27": 1966, "27_84": 1967, "84_30": 1968, "30_84": 1969, "41_82": 1970, "82_41": 1971, "61_70": 1972, "70_61": 1973, "98_21": 1974, "21_98": 1975, "24_59": 1976, "59_24": 1977, "82_94": 1978, "94_82": 1979, "81_14": 1980, "14_81": 1981, "41_42": 1982, "42_41": 1983, "42_65": 1984, "65_42": 1985, "42_42": 1986, "86_20": 1987, "20_86": 1988, "40_53": 1989, "53_40": 1990, "77_96": 1991, "96_77": 1992, "27_21": 1993, "21_27": 1994, "85_88": 1995, "88_85": 1996, "25_96": 1997, "96_25": 1998, "77_78": 1999, "78_77": 2000, "91_94": 2001, "94_91": 2002, "38_43": 2003, "43_38": 2004, "26_53": 2005, "53_26": 2006, "21_94": 2007, "94_21": 2008, "53_33": 2009, "33_53": 2010, "53_30": 2011, "30_53": 2012, "53_39": 2013, "39_53": 2014, "98_6": 2015, "6_98": 2016, "91_91": 2017, "5_55": 2018, "55_5": 2019, "87_87": 2020, "85_87": 2021, "87_85": 2022, "4_88": 2023, "88_4": 2024, "54_15": 2025, "15_54": 2026, "21_50": 2027, "50_21": 2028, "100_31": 2029, "31_100": 2030, "67_16": 2031, "16_67": 2032, "26_95": 2033, "95_26": 2034, "50_12": 2035, "12_50": 2036, "65_4": 2037, "4_65": 2038, "39_78": 2039, "78_39": 2040, "51_13": 2041, "13_51": 2042, "35_82": 2043, "82_35": 2044, "58_26": 2045, "26_58": 2046, "57_38": 2047, "38_57": 2048, "39_8": 2049, "8_39": 2050, "36_26": 2051, "18_59": 2052, "59_18": 2053, "64_30": 2054, "30_64": 2055, "73_31": 2056, "31_73": 2057, "96_59": 2058, "59_96": 2059, "50_89": 2060, "89_50": 2061, "58_44": 2062, "85_33": 2063, "33_85": 2064, "56_96": 2065, "96_56": 2066, "5_37": 2067, "37_5": 2068, "98_77": 2069, "77_98": 2070, "35_88": 2071, "88_35": 2072, "36_21": 2073, "67_85": 2074, "85_67": 2075, "52_20": 2076, "20_52": 2077, "97_13": 2078, "13_97": 2079, "65_87": 2080, "87_65": 2081, "18_67": 2082, "67_18": 2083, "67_19": 2084, "19_67": 2085, "54_52": 2086, "52_54": 2087, "92_20": 2088, "20_92": 2089, "93_91": 2090, "91_93": 2091, "95_18": 2092, "18_95": 2093, "36_2": 2094, "39_94": 2095, "94_39": 2096, "77_39": 2097, "39_77": 2098, "2_43": 2099, "43_2": 2100, "31_37": 2101, "37_31": 2102, "5_52": 2103, "52_5": 2104, "16_82": 2105, "82_16": 2106, "53_64": 2107, "64_53": 2108, "96_26": 2109, "26_96": 2110, "40_84": 2111, "84_40": 2112, "40_5": 2113, "5_40": 2114, "81_9": 2115, "9_81": 2116, "26_39": 2117, "39_26": 2118, "41_12": 2119, "12_41": 2120, "35_65": 2121, "65_35": 2122, "68_88": 2123, "88_68": 2124, "26_43": 2125, "43_26": 2126, "82_57": 2127, "57_82": 2128, "72_53": 2129, "53_72": 2130, "96_45": 2131, "45_96": 2132, "60_4": 2133, "4_60": 2134, "60_82": 2135, "82_60": 2136, "60_79": 2137, "79_60": 2138, "37_63": 2139, "63_37": 2140, "37_51": 2141, "51_37": 2142, "9_38": 2143, "38_9": 2144, "25_88": 2145, "88_25": 2146, "25_54": 2147, "54_25": 2148, "82_42": 2149, "42_82": 2150, "36_78": 2151, "78_36": 2152, "81_42": 2153, "42_81": 2154, "41_77": 2155, "77_41": 2156, "41_6": 2157, "6_41": 2158, "41_21": 2159, "21_41": 2160, "41_87": 2161, "87_41": 2162, "36_52": 2163, "52_36": 2164, "92_31": 2165, "31_92": 2166, "30_99": 2167, "99_30": 2168, "91_78": 2169, "78_91": 2170, "41_92": 2171, "92_41": 2172, "92_50": 2173, "50_92": 2174, "2_34": 2175, "34_2": 2176, "98_85": 2177, "85_98": 2178, "46_77": 2179, "77_46": 2180, "46_65": 2181, "65_46": 2182, "33_38": 2183, "38_33": 2184, "33_66": 2185, "66_33": 2186, "96_19": 2187, "19_96": 2188, "36_28": 2189, "28_36": 2190, "36_51": 2191, "51_36": 2192, "94_38": 2193, "38_94": 2194, "93_84": 2195, "84_93": 2196, "98_72": 2197, "72_98": 2198, "97_66": 2199, "66_97": 2200, "99_99": 2201, "7_65": 2202, "65_7": 2203, "28_12": 2204, "12_28": 2205, "67_5": 2206, "5_67": 2207, "81_87": 2208, "87_81": 2209, "36_20": 2210, "20_36": 2211, "36_94": 2212, "36_65": 2213, "65_36": 2214, "36_19": 2215, "81_99": 2216, "99_81": 2217, "81_58": 2218, "58_81": 2219, "82_33": 2220, "33_82": 2221, "29_29": 2222, "80_43": 2223, "43_80": 2224, "80_38": 2225, "38_80": 2226, "80_96": 2227, "96_80": 2228, "80_78": 2229, "78_80": 2230, "58_8": 2231, "8_58": 2232, "58_38": 2233, "38_58": 2234, "58_52": 2235, "52_58": 2236, "58_55": 2237, "55_58": 2238, "58_49": 2239, "49_58": 2240, "58_20": 2241, "20_58": 2242, "58_24": 2243, "24_58": 2244, "24_96": 2245, "96_24": 2246, "82_51": 2247, "51_82": 2248, "51_42": 2249, "42_51": 2250, "94_87": 2251, "87_94": 2252, "100_96": 2253, "96_100": 2254, "94_55": 2255, "55_94": 2256, "35_85": 2257, "85_35": 2258, "26_14": 2259, "14_26": 2260, "95_77": 2261, "77_95": 2262, "35_14": 2263, "14_35": 2264, "12_42": 2265, "42_12": 2266, "92_11": 2267, "11_92": 2268, "49_2": 2269, "2_49": 2270, "64_78": 2271, "78_64": 2272, "91_20": 2273, "20_91": 2274, "88_83": 2275, "83_88": 2276, "37_36": 2277, "36_37": 2278, "37_43": 2279, "43_37": 2280, "37_93": 2281, "93_37": 2282, "37_20": 2283, "20_37": 2284, "37_69": 2285, "69_37": 2286, "37_58": 2287, "58_37": 2288, "37_97": 2289, "97_37": 2290, "37_99": 2291, "99_37": 2292, "65_31": 2293, "31_65": 2294, "18_94": 2295, "94_18": 2296, "21_12": 2297, "12_21": 2298, "51_66": 2299, "66_51": 2300, "51_9": 2301, "9_51": 2302, "51_55": 2303, "55_51": 2304, "20_55": 2305, "55_20": 2306, "77_99": 2307, "99_77": 2308, "70_78": 2309, "78_70": 2310, "10_20": 2311, "20_10": 2312, "30_33": 2313, "33_30": 2314, "96_42": 2315, "42_96": 2316, "19_89": 2317, "89_19": 2318, "65_20": 2319, "20_65": 2320, "12_87": 2321, "87_12": 2322, "82_46": 2323, "46_82": 2324, "7_94": 2325, "94_7": 2326, "7_20": 2327, "20_7": 2328, "35_29": 2329, "29_35": 2330, "67_87": 2331, "87_67": 2332, "67_95": 2333, "95_67": 2334, "85_3": 2335, "3_85": 2336, "11_44": 2337, "2_98": 2338, "98_2": 2339, "28_83": 2340, "83_28": 2341, "67_82": 2342, "82_67": 2343, "79_79": 2344, "19_31": 2345, "31_19": 2346, "4_4": 2347, "4_31": 2348, "31_4": 2349, "53_31": 2350, "31_53": 2351, "95_54": 2352, "54_95": 2353, "58_29": 2354, "29_58": 2355, "82_88": 2356, "88_82": 2357, "44_48": 2358, "48_44": 2359, "88_32": 2360, "32_88": 2361, "93_12": 2362, "12_93": 2363, "84_94": 2364, "94_84": 2365, "65_86": 2366, "86_65": 2367, "13_20": 2368, "20_13": 2369, "94_11": 2370, "11_94": 2371, "88_51": 2372, "51_88": 2373, "12_45": 2374, "45_12": 2375, "5_36": 2376, "36_5": 2377, "53_24": 2378, "24_53": 2379, "36_89": 2380, "89_36": 2381, "96_13": 2382, "13_96": 2383, "34_14": 2384, "14_34": 2385, "92_94": 2386, "94_92": 2387, "44_20": 2388, "20_44": 2389, "54_73": 2390, "73_54": 2391, "87_48": 2392, "48_87": 2393, "24_31": 2394, "31_24": 2395, "24_46": 2396, "46_24": 2397, "70_87": 2398, "87_70": 2399, "70_92": 2400, "92_70": 2401, "2_57": 2402, "57_2": 2403, "22_14": 2404, "14_22": 2405, "21_31": 2406, "31_21": 2407, "28_93": 2408, "93_28": 2409, "28_96": 2410, "96_28": 2411, "5_26": 2412, "26_5": 2413, "22_95": 2414, "95_22": 2415, "22_57": 2416, "57_22": 2417, "8_27": 2418, "27_8": 2419, "49_55": 2420, "55_49": 2421, "35_39": 2422, "39_35": 2423, "82_12": 2424, "12_82": 2425, "2_42": 2426, "42_2": 2427, "77_37": 2428, "37_77": 2429, "25_78": 2430, "78_25": 2431, "2_50": 2432, "50_2": 2433, "8_77": 2434, "77_8": 2435, "94_85": 2436, "85_94": 2437, "72_46": 2438, "46_72": 2439, "21_14": 2440, "14_21": 2441, "53_86": 2442, "86_53": 2443, "36_24": 2444, "70_59": 2445, "59_70": 2446, "83_31": 2447, "31_83": 2448, "61_12": 2449, "12_61": 2450, "16_30": 2451, "30_16": 2452, "58_46": 2453, "77_54": 2454, "54_77": 2455, "94_30": 2456, "30_94": 2457, "99_9": 2458, "9_99": 2459, "37_19": 2460, "19_37": 2461, "61_53": 2462, "53_61": 2463, "61_38": 2464, "38_61": 2465, "61_96": 2466, "96_61": 2467, "84_19": 2468, "19_84": 2469, "98_71": 2470, "71_98": 2471, "14_87": 2472, "87_14": 2473, "85_55": 2474, "55_85": 2475, "77_11": 2476, "11_77": 2477, "26_100": 2478, "100_26": 2479, "18_64": 2480, "64_18": 2481, "100_54": 2482, "54_100": 2483, "42_21": 2484, "21_42": 2485, "5_22": 2486, "22_5": 2487, "30_35": 2488, "35_30": 2489, "30_38": 2490, "38_30": 2491, "35_27": 2492, "27_35": 2493, "72_87": 2494, "87_72": 2495, "6_11": 2496, "11_6": 2497, "67_72": 2498, "72_67": 2499, "93_14": 2500, "14_93": 2501, "94_53": 2502, "53_94": 2503, "54_9": 2504, "9_54": 2505, "92_29": 2506, "29_92": 2507, "47_12": 2508, "12_47": 2509, "77_13": 2510, "13_77": 2511, "93_40": 2512, "40_93": 2513, "38_82": 2514, "18_87": 2515, "87_18": 2516, "53_84": 2517, "84_53": 2518, "53_20": 2519, "20_53": 2520, "87_29": 2521, "29_87": 2522, "18_9": 2523, "9_18": 2524, "16_98": 2525, "98_16": 2526, "74_91": 2527, "91_74": 2528, "74_76": 2529, "76_74": 2530, "39_30": 2531, "30_39": 2532, "67_78": 2533, "78_67": 2534, "46_31": 2535, "31_46": 2536, "95_28": 2537, "28_95": 2538, "95_61": 2539, "61_95": 2540, "82_22": 2541, "22_82": 2542, "75_48": 2543, "48_75": 2544, "87_57": 2545, "57_87": 2546, "66_31": 2547, "31_66": 2548, "96_95": 2549, "95_96": 2550, "95_45": 2551, "45_95": 2552, "70_84": 2553, "84_70": 2554, "8_81": 2555, "81_8": 2556, "15_18": 2557, "18_15": 2558, "51_33": 2559, "33_51": 2560, "60_77": 2561, "77_60": 2562, "60_95": 2563, "95_60": 2564, "60_2": 2565, "2_60": 2566, "60_62": 2567, "62_60": 2568, "64_51": 2569, "51_64": 2570, "36_34": 2571, "34_36": 2572, "44_8": 2573, "8_44": 2574, "87_11": 2575, "11_87": 2576, "26_34": 2577, "34_26": 2578, "3_48": 2579, "48_3": 2580, "5_35": 2581, "35_5": 2582, "16_77": 2583, "77_16": 2584, "39_27": 2585, "27_39": 2586, "62_19": 2587, "19_62": 2588, "59_91": 2589, "91_59": 2590, "31_78": 2591, "78_31": 2592, "12_77": 2593, "77_12": 2594, "12_30": 2595, "30_12": 2596, "50_11": 2597, "11_50": 2598, "86_86": 2599, "37_81": 2600, "81_37": 2601, "65_59": 2602, "59_65": 2603, "30_21": 2604, "21_30": 2605, "30_96": 2606, "96_30": 2607, "25_31": 2608, "31_25": 2609, "26_47": 2610, "47_26": 2611, "90_15": 2612, "15_90": 2613, "98_31": 2614, "31_98": 2615, "40_26": 2616, "26_40": 2617, "22_98": 2618, "98_22": 2619, "60_98": 2620, "98_60": 2621, "60_65": 2622, "65_60": 2623, "60_18": 2624, "18_60": 2625, "60_48": 2626, "48_60": 2627, "30_98": 2628, "98_30": 2629, "25_30": 2630, "30_25": 2631, "26_61": 2632, "61_26": 2633, "36_59": 2634, "59_36": 2635, "46_44": 2636, "44_46": 2637, "31_84": 2638, "84_31": 2639, "28_18": 2640, "18_28": 2641, "68_21": 2642, "21_68": 2643, "26_38": 2644, "38_26": 2645, "70_40": 2646, "40_70": 2647, "86_72": 2648, "72_86": 2649, "84_3": 2650, "3_84": 2651, "29_51": 2652, "51_29": 2653, "41_43": 2654, "43_41": 2655, "57_95": 2656, "95_57": 2657, "53_52": 2658, "52_53": 2659, "21_91": 2660, "91_21": 2661, "92_69": 2662, "69_92": 2663, "15_15": 2664, "53_19": 2665, "19_53": 2666, "7_43": 2667, "43_7": 2668, "22_27": 2669, "27_22": 2670, "74_79": 2671, "79_74": 2672, "96_27": 2673, "27_96": 2674, "6_65": 2675, "65_6": 2676, "92_55": 2677, "55_92": 2678, "92_89": 2679, "89_92": 2680, "9_19": 2681, "19_9": 2682, "51_21": 2683, "21_51": 2684, "94_24": 2685, "24_94": 2686, "97_11": 2687, "11_97": 2688, "89_33": 2689, "33_89": 2690, "69_99": 2691, "99_69": 2692, "93_78": 2693, "78_93": 2694, "12_59": 2695, "59_12": 2696, "10_59": 2697, "59_10": 2698, "5_21": 2699, "21_5": 2700, "5_44": 2701, "44_5": 2702, "12_13": 2703, "13_12": 2704, "72_14": 2705, "14_72": 2706, "69_82": 2707, "82_69": 2708, "5_54": 2709, "54_5": 2710, "33_95": 2711, "95_33": 2712, "61_99": 2713, "99_61": 2714, "87_97": 2715, "97_87": 2716, "72_72": 2717, "96_72": 2718, "72_96": 2719, "26_46": 2720, "46_26": 2721, "31_41": 2722, "41_31": 2723, "44_24": 2724, "24_44": 2725, "77_57": 2726, "57_77": 2727, "26_29": 2728, "29_26": 2729, "89_72": 2730, "72_89": 2731, "89_65": 2732, "65_89": 2733, "89_91": 2734, "91_89": 2735, "2_78": 2736, "78_2": 2737, "2_4": 2738, "4_2": 2739, "24_18": 2740, "18_24": 2741, "70_35": 2742, "35_70": 2743, "44_18": 2744, "18_44": 2745, "72_59": 2746, "59_72": 2747, "18_46": 2748, "46_18": 2749, "30_15": 2750, "15_30": 2751, "95_55": 2752, "55_95": 2753, "95_6": 2754, "6_95": 2755, "98_38": 2756, "38_98": 2757, "72_13": 2758, "13_72": 2759, "55_11": 2760, "11_55": 2761, "14_25": 2762, "25_14": 2763, "14_100": 2764, "100_14": 2765, "10_62": 2766, "62_10": 2767, "27_88": 2768, "88_27": 2769, "100_33": 2770, "33_100": 2771, "14_11": 2772, "11_14": 2773, "88_59": 2774, "59_88": 2775, "88_53": 2776, "53_88": 2777, "25_81": 2778, "81_25": 2779, "68_69": 2780, "69_68": 2781, "68_66": 2782, "66_68": 2783, "68_54": 2784, "54_68": 2785, "12_58": 2786, "58_12": 2787, "86_41": 2788, "41_86": 2789, "16_22": 2790, "22_16": 2791, "96_44": 2792, "44_96": 2793, "17_17": 2794, "97_93": 2795, "93_97": 2796, "21_61": 2797, "61_21": 2798, "57_59": 2799, "59_57": 2800, "60_15": 2801, "15_60": 2802, "60_27": 2803, "27_60": 2804, "58_18": 2805, "18_58": 2806, "58_69": 2807, "69_58": 2808, "53_47": 2809, "47_53": 2810, "77_66": 2811, "66_77": 2812, "80_18": 2813, "18_80": 2814, "80_9": 2815, "9_80": 2816, "96_87": 2817, "87_96": 2818, "51_85": 2819, "85_51": 2820, "51_94": 2821, "94_51": 2822, "11_59": 2823, "59_11": 2824, "54_33": 2825, "33_54": 2826, "16_95": 2827, "95_16": 2828, "33_4": 2829, "4_33": 2830, "46_8": 2831, "8_46": 2832, "36_46": 2833, "45_20": 2834, "20_45": 2835, "30_2": 2836, "2_30": 2837, "27_85": 2838, "85_27": 2839, "94_20": 2840, "20_94": 2841, "24_12": 2842, "12_24": 2843, "14_62": 2844, "62_14": 2845, "16_48": 2846, "48_16": 2847, "98_10": 2848, "10_98": 2849, "7_59": 2850, "59_7": 2851, "30_43": 2852, "43_30": 2853, "26_13": 2854, "13_26": 2855, "46_56": 2856, "56_46": 2857, "61_13": 2858, "13_61": 2859, "3_18": 2860, "18_3": 2861, "18_57": 2862, "57_18": 2863, "72_21": 2864, "21_72": 2865, "26_27": 2866, "27_26": 2867, "88_88": 2868, "52_12": 2869, "12_52": 2870, "56_68": 2871, "68_56": 2872, "24_19": 2873, "19_24": 2874, "26_59": 2875, "59_26": 2876, "10_7": 2877, "7_10": 2878, "28_55": 2879, "55_28": 2880, "56_12": 2881, "12_56": 2882, "93_26": 2883, "26_93": 2884, "24_89": 2885, "89_24": 2886, "98_33": 2887, "33_98": 2888, "101_101": 2889, "25_57": 2890, "57_25": 2891, "33_48": 2892, "48_33": 2893, "77_22": 2894, "22_77": 2895, "80_51": 2896, "51_80": 2897, "94_98": 2898, "98_94": 2899, "39_4": 2900, "4_39": 2901, "19_34": 2902, "34_19": 2903, "16_31": 2904, "31_16": 2905, "94_31": 2906, "31_94": 2907, "96_22": 2908, "22_96": 2909, "80_82": 2910, "82_80": 2911, "27_59": 2912, "59_27": 2913, "26_9": 2914, "9_26": 2915, "38_27": 2916, "27_38": 2917, "85_97": 2918, "97_85": 2919, "8_69": 2920, "69_8": 2921, "48_42": 2922, "42_48": 2923, "53_29": 2924, "29_53": 2925, "93_71": 2926, "71_93": 2927, "29_83": 2928, "83_29": 2929, "69_28": 2930, "28_69": 2931, "69_81": 2932, "81_69": 2933, "69_91": 2934, "91_69": 2935, "81_19": 2936, "19_81": 2937, "28_100": 2938, "100_28": 2939, "58_94": 2940, "59_19": 2941, "19_59": 2942, "24_51": 2943, "51_24": 2944, "51_99": 2945, "99_51": 2946, "61_9": 2947, "9_61": 2948, "88_81": 2949, "81_88": 2950, "44_77": 2951, "77_44": 2952, "33_62": 2953, "62_33": 2954, "24_27": 2955, "27_24": 2956, "72_99": 2957, "99_72": 2958, "61_65": 2959, "65_61": 2960, "61_19": 2961, "19_61": 2962, "61_14": 2963, "14_61": 2964, "54_19": 2965, "19_54": 2966, "8_59": 2967, "59_8": 2968, "29_54": 2969, "54_29": 2970, "29_47": 2971, "47_29": 2972, "29_52": 2973, "52_29": 2974, "29_69": 2975, "69_29": 2976, "29_28": 2977, "28_29": 2978, "29_36": 2979, "36_29": 2980, "29_34": 2981, "34_29": 2982, "29_100": 2983, "100_29": 2984, "42_20": 2985, "20_42": 2986, "26_57": 2987, "57_26": 2988, "71_94": 2989, "94_71": 2990, "101_67": 2991, "67_101": 2992, "25_11": 2993, "11_25": 2994, "61_94": 2995, "94_61": 2996, "14_9": 2997, "9_14": 2998, "12_71": 2999, "71_12": 3000, "8_31": 3001, "31_8": 3002, "14_88": 3003, "88_14": 3004, "53_97": 3005, "97_53": 3006, "78_89": 3007, "89_78": 3008, "78_33": 3009, "33_78": 3010, "96_10": 3011, "10_96": 3012, "40_58": 3013, "58_40": 3014, "40_9": 3015, "9_40": 3016, "27_71": 3017, "71_27": 3018, "76_38": 3019, "38_76": 3020, "76_18": 3021, "18_76": 3022, "67_65": 3023, "65_67": 3024, "22_39": 3025, "39_22": 3026, "30_8": 3027, "8_30": 3028, "92_43": 3029, "43_92": 3030, "70_67": 3031, "67_70": 3032, "66_59": 3033, "59_66": 3034, "6_85": 3035, "85_6": 3036, "52_19": 3037, "19_52": 3038, "70_47": 3039, "47_70": 3040, "41_85": 3041, "85_41": 3042, "12_99": 3043, "99_12": 3044, "35_94": 3045, "94_35": 3046, "25_20": 3047, "20_25": 3048, "2_29": 3049, "29_2": 3050, "5_8": 3051, "8_5": 3052, "27_31": 3053, "31_27": 3054, "85_91": 3055, "91_85": 3056, "85_4": 3057, "4_85": 3058, "10_91": 3059, "91_10": 3060, "39_70": 3061, "70_39": 3062, "61_39": 3063, "39_61": 3064, "16_39": 3065, "39_16": 3066, "28_97": 3067, "97_28": 3068, "6_34": 3069, "34_6": 3070, "37_24": 3071, "24_37": 3072, "2_66": 3073, "66_2": 3074, "71_85": 3075, "85_71": 3076, "25_51": 3077, "51_25": 3078, "97_89": 3079, "89_97": 3080, "22_48": 3081, "48_22": 3082, "52_97": 3083, "97_52": 3084, "99_11": 3085, "11_99": 3086, "61_51": 3087, "51_61": 3088, "6_59": 3089, "59_6": 3090, "97_31": 3091, "31_97": 3092, "24_25": 3093, "25_24": 3094, "53_41": 3095, "41_53": 3096, "54_99": 3097, "99_54": 3098, "18_55": 3099, "55_18": 3100, "87_5": 3101, "5_87": 3102, "67_41": 3103, "41_67": 3104, "98_95": 3105, "95_98": 3106, "9_20": 3107, "20_9": 3108, "53_59": 3109, "59_53": 3110, "63_31": 3111, "31_63": 3112, "63_54": 3113, "54_63": 3114, "48_45": 3115, "45_48": 3116, "64_31": 3117, "31_64": 3118, "89_94": 3119, "94_89": 3120, "52_100": 3121, "100_52": 3122, "82_79": 3123, "79_82": 3124, "41_66": 3125, "66_41": 3126, "95_29": 3127, "29_95": 3128, "97_83": 3129, "83_97": 3130, "35_95": 3131, "95_35": 3132, "99_19": 3133, "19_99": 3134, "53_83": 3135, "83_53": 3136, "41_14": 3137, "14_41": 3138, "41_24": 3139, "24_41": 3140, "67_53": 3141, "53_67": 3142, "39_95": 3143, "95_39": 3144, "7_2": 3145, "2_7": 3146, "81_35": 3147, "35_81": 3148, "6_31": 3149, "31_6": 3150, "34_28": 3151, "28_34": 3152, "68_87": 3153, "87_68": 3154, "68_27": 3155, "27_68": 3156, "68_77": 3157, "77_68": 3158, "68_2": 3159, "2_68": 3160, "68_33": 3161, "33_68": 3162, "100_53": 3163, "53_100": 3164, "83_69": 3165, "69_83": 3166, "82_99": 3167, "99_82": 3168, "46_96": 3169, "96_46": 3170, "4_14": 3171, "14_4": 3172, "99_48": 3173, "48_99": 3174, "66_101": 3175, "101_66": 3176, "66_67": 3177, "67_66": 3178, "66_42": 3179, "42_66": 3180, "33_59": 3181, "59_33": 3182, "23_23": 3183, "5_84": 3184, "84_5": 3185, "42_19": 3186, "19_42": 3187, "62_8": 3188, "8_62": 3189, "87_86": 3190, "86_87": 3191, "35_100": 3192, "100_35": 3193, "82_43": 3194, "43_82": 3195, "9_11": 3196, "11_9": 3197, "84_82": 3198, "82_84": 3199, "8_48": 3200, "48_8": 3201, "68_84": 3202, "84_68": 3203, "14_91": 3204, "91_14": 3205, "52_92": 3206, "92_52": 3207, "52_43": 3208, "43_52": 3209, "52_93": 3210, "93_52": 3211, "52_96": 3212, "96_52": 3213, "52_11": 3214, "11_52": 3215, "52_99": 3216, "99_52": 3217, "99_20": 3218, "20_99": 3219, "26_66": 3220, "66_26": 3221, "83_37": 3222, "37_83": 3223, "22_94": 3224, "94_22": 3225, "26_71": 3226, "71_26": 3227, "71_20": 3228, "20_71": 3229, "57_88": 3230, "88_57": 3231, "30_42": 3232, "42_30": 3233, "97_27": 3234, "27_97": 3235, "46_85": 3236, "85_46": 3237, "42_69": 3238, "69_42": 3239, "88_77": 3240, "77_88": 3241, "87_84": 3242, "84_87": 3243, "94_66": 3244, "66_94": 3245, "29_81": 3246, "81_29": 3247, "29_78": 3248, "78_29": 3249, "51_52": 3250, "52_51": 3251, "96_47": 3252, "47_96": 3253, "58_82": 3254, "26_62": 3255, "62_26": 3256, "41_62": 3257, "62_41": 3258, "5_46": 3259, "46_5": 3260, "74_30": 3261, "30_74": 3262, "3_12": 3263, "12_3": 3264, "30_11": 3265, "11_30": 3266, "70_21": 3267, "21_70": 3268, "70_30": 3269, "30_70": 3270, "14_33": 3271, "33_14": 3272, "59_87": 3273, "87_59": 3274, "77_29": 3275, "29_77": 3276, "36_69": 3277, "69_36": 3278, "42_31": 3279, "31_42": 3280, "7_24": 3281, "24_7": 3282, "7_86": 3283, "86_7": 3284, "37_34": 3285, "34_37": 3286, "37_88": 3287, "88_37": 3288, "75_13": 3289, "13_75": 3290, "5_16": 3291, "16_5": 3292, "50_87": 3293, "87_50": 3294, "70_24": 3295, "24_70": 3296, "35_26": 3297, "26_35": 3298, "37_39": 3299, "39_37": 3300, "82_52": 3301, "52_82": 3302, "53_27": 3303, "27_53": 3304, "58_77": 3305, "11_78": 3306, "78_11": 3307, "90_22": 3308, "22_90": 3309, "90_94": 3310, "94_90": 3311, "77_79": 3312, "79_77": 3313, "41_35": 3314, "35_41": 3315, "53_79": 3316, "79_53": 3317, "57_27": 3318, "27_57": 3319, "65_3": 3320, "3_65": 3321, "26_31": 3322, "31_26": 3323, "26_3": 3324, "3_26": 3325, "6_5": 3326, "5_6": 3327, "16_2": 3328, "2_16": 3329, "18_42": 3330, "42_18": 3331, "16_6": 3332, "6_16": 3333, "33_87": 3334, "87_33": 3335, "43_18": 3336, "18_43": 3337, "35_11": 3338, "11_35": 3339, "99_31": 3340, "31_99": 3341, "39_44": 3342, "44_39": 3343, "23_91": 3344, "91_23": 3345, "37_78": 3346, "78_37": 3347, "5_71": 3348, "71_5": 3349, "18_34": 3350, "34_18": 3351, "45_66": 3352, "66_45": 3353, "94_78": 3354, "78_94": 3355, "82_64": 3356, "64_82": 3357, "5_83": 3358, "83_5": 3359, "57_53": 3360, "53_57": 3361, "81_97": 3362, "97_81": 3363, "49_31": 3364, "31_49": 3365, "49_81": 3366, "81_49": 3367, "25_53": 3368, "53_25": 3369, "64_2": 3370, "2_64": 3371, "5_78": 3372, "78_5": 3373, "39_24": 3374, "24_39": 3375, "85_19": 3376, "19_85": 3377, "2_44": 3378, "44_2": 3379, "2_10": 3380, "10_2": 3381, "25_25": 3382, "62_62": 3383, "33_33": 3384, "9_94": 3385, "94_9": 3386, "72_11": 3387, "11_72": 3388, "5_58": 3389, "58_5": 3390, "50_94": 3391, "94_50": 3392, "8_85": 3393, "85_8": 3394, "77_43": 3395, "43_77": 3396, "95_95": 3397, "95_23": 3398, "23_95": 3399, "44_13": 3400, "13_44": 3401, "49_20": 3402, "20_49": 3403, "49_12": 3404, "12_49": 3405, "95_50": 3406, "50_95": 3407, "35_31": 3408, "31_35": 3409, "51_32": 3410, "32_51": 3411, "53_99": 3412, "99_53": 3413, "53_91": 3414, "91_53": 3415, "5_43": 3416, "43_5": 3417, "14_89": 3418, "89_14": 3419, "31_57": 3420, "57_31": 3421, "27_54": 3422, "54_27": 3423, "39_43": 3424, "43_39": 3425, "72_38": 3426, "38_72": 3427, "21_37": 3428, "37_21": 3429, "68_94": 3430, "94_68": 3431, "37_46": 3432, "46_37": 3433, "18_20": 3434, 