{"PAD": 0, "DUMMY_START_RELATION": 1, "UNK": 2, "2_41": 3, "27_5": 4, "49_41": 5, "9_41": 6, "49_44": 7, "49_38": 8, "27_41": 9, "24_41": 10, "27_38": 11, "33_41": 12, "2_38": 13, "36_41": 14, "4_41": 15, "42_36": 16, "42_41": 17, "22_41": 18, "7_41": 19, "31_38": 20, "28_38": 21, "18_41": 22, "2_7": 23, "26_41": 24, "41_41": 25, "20_41": 26, "38_49": 27, "40_32": 28, "32_40": 29, "36_36": 30, "27_25": 31, "25_27": 32, "8_8": 33, "26_18": 34, "18_26": 35, "34_34": 36, "20_22": 37, "22_20": 38, "20_18": 39, "18_20": 40, "38_40": 41, "40_38": 42, "38_12": 43, "12_38": 44, "9_19": 45, "19_9": 46, "28_43": 47, "43_28": 48, "26_22": 49, "22_26": 50, "16_29": 51, "29_16": 52, "16_32": 53, "32_16": 54, "32_11": 55, "11_32": 56, "34_35": 57, "35_34": 58, "49_3": 59, "3_49": 60, "49_33": 61, "33_49": 62, "49_27": 63, "27_49": 64, "26_49": 65, "49_26": 66, "24_28": 67, "28_24": 68, "38_8": 69, "8_38": 70, "38_38": 71, "29_38": 72, "38_29": 73, "32_38": 74, "38_32": 75, "32_32": 76, "29_29": 77, "34_8": 78, "8_34": 79, "34_28": 80, "28_34": 81, "42_34": 82, "34_42": 83, "42_35": 84, "35_42": 85, "25_25": 86, "33_16": 87, "16_33": 88, "32_28": 89, "28_32": 90, "42_30": 91, "30_42": 92, "42_42": 93, "3_40": 94, "40_3": 95, "14_49": 96, "49_14": 97, "14_44": 98, "44_14": 99, "10_10": 100, "4_38": 101, "38_4": 102, "8_32": 103, "32_8": 104, "8_48": 105, "48_8": 106, "29_41": 107, "41_29": 108, "27_27": 109, "9_49": 110, "49_9": 111, "27_33": 112, "33_27": 113, "42_49": 114, "49_42": 115, "36_49": 116, "49_36": 117, "41_4": 118, "4_34": 119, "34_4": 120, "4_35": 121, "35_4": 122, "4_47": 123, "47_4": 124, "34_32": 125, "32_34": 126, "3_12": 127, "12_3": 128, "11_3": 129, "3_11": 130, "27_16": 131, "16_27": 132, "9_24": 133, "24_9": 134, "9_22": 135, "22_9": 136, "26_42": 137, "42_26": 138, "30_49": 139, "49_30": 140, "32_48": 141, "48_32": 142, "31_27": 143, "27_31": 144, "31_8": 145, "8_31": 146, "31_9": 147, "9_31": 148, "31_44": 149, "44_31": 150, "31_16": 151, "16_31": 152, "16_8": 153, "8_16": 154, "11_33": 155, "33_11": 156, "49_35": 157, "35_49": 158, "44_49": 159, "34_49": 160, "49_34": 161, "27_23": 162, "23_27": 163, "15_15": 164, "32_24": 165, "24_32": 166, "48_48": 167, "49_32": 168, "32_49": 169, "24_50": 170, "50_24": 171, "24_15": 172, "15_24": 173, "41_36": 174, "20_27": 175, "27_20": 176, "28_28": 177, "35_38": 178, "38_35": 179, "49_4": 180, "4_49": 181, "34_3": 182, "3_34": 183, "40_40": 184, "49_28": 185, "28_49": 186, "28_18": 187, "18_28": 188, "35_28": 189, "28_35": 190, "35_30": 191, "30_35": 192, "35_6": 193, "6_35": 194, "44_44": 195, "44_35": 196, "35_44": 197, "35_35": 198, "36_29": 199, "29_36": 200, "26_27": 201, "27_26": 202, "20_33": 203, "33_20": 204, "27_4": 205, "4_27": 206, "9_36": 207, "36_9": 208, "48_38": 209, "38_48": 210, "20_2": 211, "2_20": 212, "39_6": 213, "6_39": 214, "39_39": 215, "39_32": 216, "32_39": 217, "11_38": 218, "38_11": 219, "12_32": 220, "32_12": 221, "35_36": 222, "36_35": 223, "35_8": 224, "8_35": 225, "35_43": 226, "43_35": 227, "35_27": 228, "27_35": 229, "35_41": 230, "41_35": 231, "35_7": 232, "7_35": 233, "34_41": 234, "41_34": 235, "28_23": 236, "23_28": 237, "28_6": 238, "6_28": 239, "26_38": 240, "38_26": 241, "28_5": 242, "5_28": 243, "33_12": 244, "12_33": 245, "29_49": 246, "49_29": 247, "29_35": 248, "35_29": 249, "29_7": 250, "7_29": 251, "41_49": 252, "22_34": 253, "34_22": 254, "8_28": 255, "28_8": 256, "8_24": 257, "24_8": 258, "33_28": 259, "28_33": 260, "27_30": 261, "30_27": 262, "49_49": 263, "38_34": 264, "34_38": 265, "42_22": 266, "22_42": 267, "35_9": 268, "9_35": 269, "9_28": 270, "28_9": 271, "24_19": 272, "19_24": 273, "5_27": 274, "36_27": 275, "27_36": 276, "27_6": 277, "6_27": 278, "40_48": 279, "48_40": 280, "20_9": 281, "9_20": 282, "9_18": 283, "18_9": 284, "49_6": 285, "6_49": 286, "28_30": 287, "30_28": 288, "13_13": 289, "3_18": 290, "18_3": 291, "16_10": 292, "10_16": 293, "16_16": 294, "23_33": 295, "33_23": 296, "28_25": 297, "25_28": 298, "4_8": 299, "8_4": 300, "29_30": 301, "30_29": 302, "29_32": 303, "32_29": 304, "15_12": 305, "12_15": 306, "15_36": 307, "36_15": 308, "15_6": 309, "6_15": 310, "15_34": 311, "34_15": 312, "15_32": 313, "32_15": 314, "15_19": 315, "19_15": 316, "31_49": 317, "49_31": 318, "34_30": 319, "30_34": 320, "34_48": 321, "48_34": 322, "34_16": 323, "16_34": 324, "34_40": 325, "40_34": 326, "34_6": 327, "6_34": 328, "34_39": 329, "39_34": 330, "36_30": 331, "30_36": 332, "35_12": 333, "12_35": 334, "35_47": 335, "47_35": 336, "44_23": 337, "23_44": 338, "6_6": 339, "16_30": 340, "30_16": 341, "33_33": 342, "44_8": 343, "8_44": 344, "6_38": 345, "38_6": 346, "6_32": 347, "32_6": 348, "6_8": 349, "8_6": 350, "33_36": 351, "36_33": 352, "27_22": 353, "22_27": 354, "45_27": 355, "27_45": 356, "28_16": 357, "16_28": 358, "35_39": 359, "39_35": 360, "13_28": 361, "28_13": 362, "8_47": 363, "47_8": 364, "8_29": 365, "29_8": 366, "8_49": 367, "49_8": 368, "14_40": 369, "40_14": 370, "44_38": 371, "38_44": 372, "49_7": 373, "7_49": 374, "44_27": 375, "27_44": 376, "44_18": 377, "18_44": 378, "36_40": 379, "40_36": 380, "41_32": 381, "32_41": 382, "41_38": 383, "38_41": 384, "9_4": 385, "4_9": 386, "4_4": 387, "25_12": 388, "12_25": 389, "4_6": 390, "6_4": 391, "36_38": 392, "38_36": 393, "44_9": 394, "9_44": 395, "42_3": 396, "3_42": 397, "42_25": 398, "25_42": 399, "28_27": 400, "27_28": 401, "32_31": 402, "31_32": 403, "6_40": 404, "40_6": 405, "47_47": 406, "7_7": 407, "20_36": 408, "36_20": 409, "20_35": 410, "35_20": 411, "8_21": 412, "21_8": 413, "23_36": 414, "36_23": 415, "44_42": 416, "42_44": 417, "44_47": 418, "47_44": 419, "30_3": 420, "3_30": 421, "7_38": 422, "38_7": 423, "36_6": 424, "6_36": 425, "42_6": 426, "6_42": 427, "33_9": 428, "9_33": 429, "4_31": 430, "31_4": 431, "34_27": 432, "27_34": 433, "41_7": 434, "40_10": 435, "10_40": 436, "33_24": 437, "24_33": 438, "4_33": 439, "33_4": 440, "36_13": 441, "13_36": 442, "11_47": 443, "47_11": 444, "23_8": 445, "8_23": 446, "27_9": 447, "9_27": 448, "32_47": 449, "47_32": 450, "9_30": 451, "30_9": 452, "40_47": 453, "47_40": 454, "26_13": 455, "13_26": 456, "27_2": 457, "2_27": 458, "36_42": 459, "42_9": 460, "9_42": 461, "27_48": 462, "48_27": 463, "33_18": 464, "18_33": 465, "36_24": 466, "24_36": 467, "24_38": 468, "38_24": 469, "24_24": 470, "38_31": 471, "36_28": 472, "28_36": 473, "36_31": 474, "31_36": 475, "3_31": 476, "31_3": 477, "37_12": 478, "12_37": 479, "34_5": 480, "5_34": 481, "34_29": 482, "29_34": 483, "20_23": 484, "23_20": 485, "8_41": 486, "41_8": 487, "33_50": 488, "50_33": 489, "33_15": 490, "15_33": 491, "19_34": 492, "34_19": 493, "29_22": 494, "22_29": 495, "40_8": 496, "8_40": 497, "4_32": 498, "32_4": 499, "34_36": 500, "36_34": 501, "24_42": 502, "42_24": 503, "25_8": 504, "8_25": 505, "46_12": 506, "12_46": 507, "46_24": 508, "24_46": 509, "42_33": 510, "33_42": 511, "34_12": 512, "12_34": 513, "2_36": 514, "36_2": 515, "33_22": 516, "22_33": 517, "23_9": 518, "9_23": 519, "16_38": 520, "38_16": 521, "48_25": 522, "25_48": 523, "44_24": 524, "24_44": 525, "27_29": 526, "29_27": 527, "8_12": 528, "12_8": 529, "30_38": 530, "38_30": 531, "14_8": 532, "8_14": 533, "30_45": 534, "45_30": 535, "33_31": 536, "31_33": 537, "41_2": 538, "27_47": 539, "47_27": 540, "34_24": 541, "24_34": 542, "16_41": 543, "41_16": 544, "33_35": 545, "35_33": 546, "16_48": 547, "48_16": 548, "32_35": 549, "35_32": 550, "21_21": 551, "48_12": 552, "12_48": 553, "33_30": 554, "30_33": 555, "29_47": 556, "47_29": 557, "28_29": 558, "29_28": 559, "27_8": 560, "8_27": 561, "16_35": 562, "35_16": 563, "44_29": 564, "29_44": 565, "4_40": 566, "40_4": 567, "26_28": 568, "28_26": 569, "16_40": 570, "40_16": 571, "8_9": 572, "9_8": 573, "29_40": 574, "40_29": 575, "20_49": 576, "49_20": 577, "45_11": 578, "11_45": 579, "33_8": 580, "8_33": 581, "49_23": 582, "23_49": 583, "31_34": 584, "34_31": 585, "30_32": 586, "32_30": 587, "5_22": 588, "22_5": 589, "27_32": 590, "32_27": 591, "18_38": 592, "38_18": 593, "34_33": 594, "33_34": 595, "34_50": 596, "50_34": 597, "9_9": 598, "16_49": 599, "49_16": 600, "37_34": 601, "34_37": 602, "28_12": 603, "12_28": 604, "42_27": 605, "27_42": 606, "28_19": 607, "19_28": 608, "3_22": 609, "22_3": 610, "12_40": 611, "40_12": 612, "12_41": 613, "41_12": 614, "11_11": 615, "39_38": 616, "38_39": 617, "39_8": 618, "8_39": 619, "15_17": 620, "17_15": 621, "14_35": 622, "35_14": 623, "10_29": 624, "29_10": 625, "44_2": 626, "2_44": 627, "9_43": 628, "43_9": 629, "26_44": 630, "44_26": 631, "2_2": 632, "18_12": 633, "12_18": 634, "45_5": 635, "5_45": 636, "9_50": 637, "50_9": 638, "3_3": 639, "45_33": 640, "33_45": 641, "4_42": 642, "42_4": 643, "3_41": 644, "41_3": 645, "5_12": 646, "12_5": 647, "45_22": 648, "22_45": 649, "15_23": 650, "23_15": 651, "24_13": 652, "13_24": 653, "34_10": 654, "10_34": 655, "32_25": 656, "25_32": 657, "40_41": 658, "41_40": 659, "42_20": 660, "20_42": 661, "4_39": 662, "39_4": 663, "20_4": 664, "4_20": 665, "26_30": 666, "30_26": 667, "16_12": 668, "12_16": 669, "4_7": 670, "7_4": 671, "4_28": 672, "28_4": 673, "49_24": 674, "24_49": 675, "26_23": 676, "23_26": 677, "36_5": 678, "5_36": 679, "24_12": 680, "12_24": 681, "28_3": 682, "3_28": 683, "24_40": 684, "40_24": 685, "36_18": 686, "18_36": 687, "4_19": 688, "19_4": 689, "12_12": 690, "4_3": 691, "3_4": 692, "4_2": 693, "2_4": 694, "33_17": 695, "17_33": 696, "44_43": 697, "43_44": 698, "8_30": 699, "30_8": 700, "21_9": 701, "9_21": 702, "21_32": 703, "32_21": 704, "24_23": 705, "23_24": 706, "3_36": 707, "36_3": 708, "8_22": 709, "22_8": 710, "36_7": 711, "7_36": 712, "7_6": 713, "6_7": 714, "44_13": 715, "13_44": 716, "13_23": 717, "23_13": 718, "26_20": 719, "20_26": 720, "34_23": 721, "23_34": 722, "35_11": 723, "11_35": 724, "35_40": 725, "40_35": 726, "35_10": 727, "10_35": 728, "35_31": 729, "31_35": 730, "9_38": 731, "38_9": 732, "13_27": 733, "27_13": 734, "41_18": 735, "42_19": 736, "19_42": 737, "12_49": 738, "49_12": 739, "12_4": 740, "4_12": 741, "38_3": 742, "3_38": 743, "49_19": 744, "19_49": 745, "33_3": 746, "3_33": 747, "9_3": 748, "3_9": 749, "19_19": 750, "39_47": 751, "47_39": 752, "10_38": 753, "38_10": 754, "10_32": 755, "32_10": 756, "31_14": 757, "14_31": 758, "45_29": 759, "29_45": 760, "3_43": 761, "43_3": 762, "32_7": 763, "7_32": 764, "44_36": 765, "36_44": 766, "42_28": 767, "28_42": 768, "38_28": 769, "35_26": 770, "26_35": 771, "41_33": 772, "41_47": 773, "47_41": 774, "21_16": 775, "16_21": 776, "29_11": 777, "11_29": 778, "42_16": 779, "16_42": 780, "27_43": 781, "43_27": 782, "24_3": 783, "3_24": 784, "20_28": 785, "28_20": 786, "15_50": 787, "50_15": 788, "27_12": 789, "12_27": 790, "11_31": 791, "31_11": 792, "14_9": 793, "9_14": 794, "45_6": 795, "6_45": 796, "27_18": 797, "18_27": 798, "41_24": 799, "26_36": 800, "36_26": 801, "29_3": 802, "3_29": 803, "48_37": 804, "37_48": 805, "8_10": 806, "10_8": 807, "11_10": 808, "10_11": 809, "3_8": 810, "8_3": 811, "4_26": 812, "26_4": 813, "26_24": 814, "24_26": 815, "31_31": 816, "44_32": 817, "32_44": 818, "49_50": 819, "50_49": 820, "38_2": 821, "2_3": 822, "3_2": 823, "2_30": 824, "30_2": 825, "11_41": 826, "41_11": 827, "11_8": 828, "8_11": 829, "11_49": 830, "49_11": 831, "3_27": 832, "27_3": 833, "36_43": 834, "43_36": 835, "48_28": 836, "28_48": 837, "35_19": 838, "19_35": 839, "40_33": 840, "33_40": 841, "21_38": 842, "38_21": 843, "30_30": 844, "41_15": 845, "15_41": 846, "4_30": 847, "30_4": 848, "12_19": 849, "19_12": 850, "31_6": 851, "6_31": 852, "42_18": 853, "18_42": 854, "42_40": 855, "40_42": 856, "9_26": 857, "26_9": 858, "34_9": 859, "9_34": 860, "45_38": 861, "38_45": 862, "23_23": 863, "20_24": 864, "24_20": 865, "10_33": 866, "33_10": 867, "42_29": 868, "29_42": 869, "23_38": 870, "38_23": 871, "3_32": 872, "32_3": 873, "28_15": 874, "15_28": 875, "49_40": 876, "40_49": 877, "15_40": 878, "40_15": 879, "25_18": 880, "18_25": 881, "35_3": 882, "3_35": 883, "41_10": 884, "10_41": 885, "2_33": 886, "33_2": 887, "44_12": 888, "12_44": 889, "41_9": 890, "8_26": 891, "26_8": 892, "49_48": 893, "48_49": 894, "42_38": 895, "38_42": 896, "3_50": 897, "50_3": 898, "2_18": 899, "18_2": 900, "39_29": 901, "29_39": 902, "27_39": 903, "39_27": 904, "36_47": 905, "47_36": 906, "31_29": 907, "29_31": 908, "3_19": 909, "19_3": 910, "41_27": 911, "36_22": 912, "22_36": 913, "9_45": 914, "45_9": 915, "41_23": 916, "23_41": 917, "38_27": 918, "9_16": 919, "16_9": 920, "20_29": 921, "29_20": 922, "19_18": 923, "18_19": 924, "33_7": 925, "7_33": 926, "44_33": 927, "33_44": 928, "43_43": 929, "36_19": 930, "19_36": 931, "34_44": 932, "44_34": 933, "11_40": 934, "40_11": 935, "9_6": 936, "6_9": 937, "14_14": 938, "16_19": 939, "19_16": 940, "29_18": 941, "18_29": 942, "48_3": 943, "3_48": 944, "48_2": 945, "2_48": 946, "48_24": 947, "24_48": 948, "24_30": 949, "30_24": 950, "28_40": 951, "40_28": 952, "16_25": 953, "25_16": 954, "4_29": 955, "29_4": 956, "48_22": 957, "22_48": 958, "49_2": 959, "2_49": 960, "29_33": 961, "33_29": 962, "18_18": 963, "31_41": 964, "41_31": 965, "16_11": 966, "11_16": 967, "38_47": 968, "47_38": 969, "20_43": 970, "43_20": 971, "28_22": 972, "22_28": 973, "46_16": 974, "16_46": 975, "33_6": 976, "6_33": 977, "13_9": 978, "9_13": 979, "20_38": 980, "38_20": 981, "42_8": 982, "8_42": 983, "36_50": 984, "50_36": 985, "16_6": 986, "6_16": 987, "7_31": 988, "31_7": 989, "32_42": 990, "42_32": 991, "33_38": 992, "38_33": 993, "44_30": 994, "30_44": 995, "7_30": 996, "30_7": 997, "49_13": 998, "13_49": 999, "24_43": 1000, "43_24": 1001, "6_22": 1002, "22_6": 1003, "10_12": 1004, "12_10": 1005, "36_8": 1006, "8_36": 1007, "16_18": 1008, "18_16": 1009, "42_12": 1010, "12_42": 1011, "29_12": 1012, "12_29": 1013, "38_5": 1014, "5_38": 1015, "13_15": 1016, "15_13": 1017, "29_6": 1018, "6_29": 1019, "9_15": 1020, "15_9": 1021, "49_22": 1022, "22_49": 1023, "45_49": 1024, "49_45": 1025, "15_27": 1026, "27_15": 1027, "34_13": 1028, "13_34": 1029, "9_2": 1030, "2_9": 1031, "39_45": 1032, "45_39": 1033, "39_48": 1034, "48_39": 1035, "30_18": 1036, "18_30": 1037, "42_31": 1038, "31_42": 1039, "44_4": 1040, "4_44": 1041, "13_22": 1042, "22_13": 1043, "42_47": 1044, "47_42": 1045, "24_27": 1046, "27_24": 1047, "4_24": 1048, "24_4": 1049, "49_39": 1050, "39_49": 1051, "24_16": 1052, "16_24": 1053, "34_26": 1054, "26_34": 1055, "44_3": 1056, "3_44": 1057, "9_40": 1058, "40_9": 1059, "26_6": 1060, "6_26": 1061, "7_3": 1062, "3_7": 1063, "13_12": 1064, "12_13": 1065, "26_3": 1066, "3_26": 1067, "44_41": 1068, "41_44": 1069, "49_18": 1070, "18_49": 1071, "14_23": 1072, "23_14": 1073, "20_31": 1074, "31_20": 1075, "20_16": 1076, "16_20": 1077, "28_41": 1078, "41_28": 1079, "28_31": 1080, "31_28": 1081, "44_28": 1082, "28_44": 1083, "44_11": 1084, "11_44": 1085, "22_38": 1086, "38_22": 1087, "26_33": 1088, "33_26": 1089, "14_38": 1090, "38_14": 1091, "4_14": 1092, "14_4": 1093, "39_42": 1094, "42_39": 1095, "40_30": 1096, "30_40": 1097, "33_19": 1098, "19_33": 1099, "13_40": 1100, "40_13": 1101, "34_45": 1102, "45_34": 1103, "41_6": 1104, "6_41": 1105, "24_6": 1106, "6_24": 1107, "34_18": 1108, "18_34": 1109, "34_11": 1110, "11_34": 1111, "9_32": 1112, "32_9": 1113, "27_19": 1114, "19_27": 1115, "41_30": 1116, "30_41": 1117, "8_7": 1118, "7_8": 1119, "7_20": 1120, "20_7": 1121, "7_40": 1122, "40_7": 1123, "7_47": 1124, "47_7": 1125, "20_30": 1126, "30_20": 1127, "14_6": 1128, "6_14": 1129, "30_31": 1130, "31_30": 1131, "2_28": 1132, "28_2": 1133, "20_11": 1134, "11_20": 1135, "36_14": 1136, "14_36": 1137, "30_5": 1138, "5_30": 1139, "50_50": 1140, "22_32": 1141, "32_22": 1142, "2_32": 1143, "32_2": 1144, "19_30": 1145, "30_19": 1146, "45_45": 1147, "43_38": 1148, "38_43": 1149, "43_34": 1150, "34_43": 1151, "22_18": 1152, "18_22": 1153, "41_42": 1154, "34_47": 1155, "47_34": 1156, "27_7": 1157, "7_27": 1158, "42_23": 1159, "23_42": 1160, "9_47": 1161, "47_9": 1162, "4_45": 1163, "45_4": 1164, "46_49": 1165, "49_46": 1166, "7_2": 1167, "6_13": 1168, "13_6": 1169, "35_18": 1170, "18_35": 1171, "4_23": 1172, "23_4": 1173, "45_18": 1174, "18_45": 1175, "48_18": 1176, "18_48": 1177, "8_5": 1178, "5_8": 1179, "8_18": 1180, "18_8": 1181, "31_13": 1182, "13_31": 1183, "37_32": 1184, "32_37": 1185, "13_4": 1186, "4_13": 1187, "4_36": 1188, "36_4": 1189, "13_43": 1190, "43_13": 1191, "13_35": 1192, "35_13": 1193, "9_29": 1194, "29_9": 1195, "36_16": 1196, "16_36": 1197, "45_12": 1198, "12_45": 1199, "4_48": 1200, "48_4": 1201, "13_30": 1202, "30_13": 1203, "5_32": 1204, "32_5": 1205, "3_25": 1206, "25_3": 1207, "29_48": 1208, "48_29": 1209, "3_6": 1210, "6_3": 1211, "44_25": 1212, "25_44": 1213, "23_31": 1214, "31_23": 1215, "24_22": 1216, "22_24": 1217, "29_23": 1218, "23_29": 1219, "44_10": 1220, "10_44": 1221, "31_12": 1222, "12_31": 1223, "39_44": 1224, "44_39": 1225, "43_16": 1226, "16_43": 1227, "39_50": 1228, "50_39": 1229, "41_22": 1230, "9_12": 1231, "12_9": 1232, "3_39": 1233, "39_3": 1234, "14_3": 1235, "3_14": 1236, "24_31": 1237, "31_24": 1238, "48_5": 1239, "5_48": 1240, "11_4": 1241, "4_11": 1242, "13_3": 1243, "3_13": 1244, "4_18": 1245, "18_4": 1246, "12_6": 1247, "6_12": 1248, "20_20": 1249, "24_35": 1250, "35_24": 1251, "42_2": 1252, "2_42": 1253, "7_28": 1254, "28_7": 1255, "7_14": 1256, "14_7": 1257, "40_25": 1258, "25_40": 1259, "3_47": 1260, "47_3": 1261, "16_22": 1262, "22_16": 1263, "16_4": 1264, "4_16": 1265, "29_5": 1266, "5_29": 1267, "45_35": 1268, "35_45": 1269, "24_18": 1270, "18_24": 1271, "4_25": 1272, "25_4": 1273, "51_51": 1274, "16_7": 1275, "7_16": 1276, "30_6": 1277, "6_30": 1278, "15_46": 1279, "46_15": 1280, "15_30": 1281, "30_15": 1282, "4_10": 1283, "10_4": 1284, "40_31": 1285, "31_40": 1286, "44_5": 1287, "5_44": 1288, "8_45": 1289, "45_8": 1290, "20_32": 1291, "32_20": 1292, "2_25": 1293, "25_2": 1294, "5_49": 1295, "49_5": 1296, "32_36": 1297, "36_32": 1298, "18_43": 1299, "43_18": 1300, "44_22": 1301, "22_44": 1302, "37_37": 1303, "39_13": 1304, "13_39": 1305, "32_18": 1306, "18_32": 1307, "23_6": 1308, "6_23": 1309, "13_33": 1310, "33_13": 1311, "48_11": 1312, "11_48": 1313, "30_12": 1314, "12_30": 1315, "23_30": 1316, "30_23": 1317, "8_19": 1318, "19_8": 1319, "25_5": 1320, "5_25": 1321, "42_46": 1322, "46_42": 1323, "18_31": 1324, "31_18": 1325, "17_12": 1326, "12_17": 1327, "17_49": 1328, "49_17": 1329, "12_22": 1330, "22_12": 1331, "26_43": 1332, "43_26": 1333, "20_40": 1334, "40_20": 1335, "33_5": 1336, "5_33": 1337, "6_44": 1338, "44_6": 1339, "28_11": 1340, "11_28": 1341, "26_32": 1342, "32_26": 1343, "6_43": 1344, "43_6": 1345, "3_5": 1346, "5_3": 1347, "20_6": 1348, "6_20": 1349, "2_24": 1350, "24_2": 1351, "2_22": 1352, "22_2": 1353, "49_47": 1354, "47_49": 1355, "4_22": 1356, "22_4": 1357, "26_26": 1358, "6_11": 1359, "11_6": 1360, "10_49": 1361, "49_10": 1362, "2_34": 1363, "34_2": 1364, "30_22": 1365, "22_30": 1366, "42_48": 1367, "48_42": 1368, "20_3": 1369, "3_20": 1370, "23_3": 1371, "3_23": 1372, "31_45": 1373, "45_31": 1374, "36_45": 1375, "45_36": 1376, "19_31": 1377, "31_19": 1378, "48_23": 1379, "23_48": 1380, "48_9": 1381, "9_48": 1382, "26_15": 1383, "15_26": 1384, "5_5": 1385, "5_40": 1386, "40_5": 1387, "5_16": 1388, "16_5": 1389, "48_35": 1390, "35_48": 1391, "42_13": 1392, "13_42": 1393, "45_25": 1394, "25_45": 1395, "44_19": 1396, "19_44": 1397, "19_38": 1398, "38_19": 1399, "13_16": 1400, "16_13": 1401, "16_14": 1402, "14_16": 1403, "22_22": 1404, "15_38": 1405, "38_15": 1406, "33_14": 1407, "14_33": 1408, "45_40": 1409, "40_45": 1410, "42_45": 1411, "45_42": 1412, "36_12": 1413, "12_36": 1414, "4_50": 1415, "50_4": 1416, "14_34": 1417, "34_14": 1418, "44_16": 1419, "16_44": 1420, "2_19": 1421, "19_2": 1422, "9_11": 1423, "11_9": 1424, "35_23": 1425, "23_35": 1426, "28_14": 1427, "14_28": 1428, "42_10": 1429, "10_42": 1430, "31_47": 1431, "47_31": 1432, "20_44": 1433, "44_20": 1434, "39_28": 1435, "28_39": 1436, "2_43": 1437, "43_2": 1438, "34_21": 1439, "21_34": 1440, "26_29": 1441, "29_26": 1442, "13_50": 1443, "50_13": 1444, "35_2": 1445, "2_35": 1446, "33_47": 1447, "47_33": 1448, "22_35": 1449, "35_22": 1450, "24_29": 1451, "29_24": 1452, "44_40": 1453, "40_44": 1454, "24_45": 1455, "45_24": 1456, "45_13": 1457, "13_45": 1458, "45_20": 1459, "20_45": 1460, "45_28": 1461, "28_45": 1462, "32_45": 1463, "45_32": 1464, "45_16": 1465, "16_45": 1466, "28_47": 1467, "47_28": 1468, "46_41": 1469, "41_46": 1470, "34_7": 1471, "7_34": 1472, "19_6": 1473, "6_19": 1474, "6_47": 1475, "47_6": 1476, "6_10": 1477, "10_6": 1478, "6_18": 1479, "18_6": 1480, "47_10": 1481, "10_47": 1482, "27_40": 1483, "40_27": 1484, "13_8": 1485, "8_13": 1486, "26_31": 1487, "31_26": 1488, "26_2": 1489, "2_26": 1490, "23_22": 1491, "22_23": 1492, "40_39": 1493, "39_40": 1494, "2_31": 1495, "31_2": 1496, "26_11": 1497, "11_26": 1498, "24_47": 1499, "47_24": 1500, "3_10": 1501, "10_3": 1502, "26_40": 1503, "40_26": 1504, "36_11": 1505, "11_36": 1506, "23_32": 1507, "32_23": 1508, "36_10": 1509, "10_36": 1510, "30_47": 1511, "47_30": 1512, "7_18": 1513, "18_7": 1514, "47_45": 1515, "45_47": 1516, "10_45": 1517, "45_10": 1518, "22_40": 1519, "40_22": 1520, "26_45": 1521, "45_26": 1522, "31_46": 1523, "46_31": 1524, "46_28": 1525, "28_46": 1526, "19_45": 1527, "45_19": 1528, "11_12": 1529, "12_11": 1530, "8_2": 1531, "2_8": 1532, "2_40": 1533, "40_2": 1534, "31_22": 1535, "22_31": 1536, "44_45": 1537, "45_44": 1538, "18_40": 1539, "40_18": 1540, "3_45": 1541, "45_3": 1542, "47_20": 1543, "20_47": 1544, "31_10": 1545, "10_31": 1546, "47_23": 1547, "23_47": 1548, "11_22": 1549, "22_11": 1550, "13_38": 1551, "38_13": 1552, "2_6": 1553, "6_2": 1554, "27_10": 1555, "10_27": 1556, "23_18": 1557, "18_23": 1558, "13_47": 1559, "47_13": 1560, "44_7": 1561, "7_44": 1562, "9_7": 1563, "7_9": 1564, "41_13": 1565, "13_41": 1566, "41_26": 1567, "7_11": 1568, "11_7": 1569, "41_39": 1570, "39_41": 1571, "23_7": 1572, "7_23": 1573, "19_7": 1574, "7_19": 1575, "46_7": 1576, "7_46": 1577, "41_19": 1578, "19_41": 1579, "5_6": 1580, "6_5": 1581, "41_20": 1582, "26_7": 1583, "7_26": 1584, "27_11": 1585, "11_27": 1586, "2_11": 1587, "11_2": 1588, "26_47": 1589, "47_26": 1590, "13_18": 1591, "18_13": 1592, "46_46": 1593, "36_46": 1594, "46_36": 1595, "13_2": 1596, "2_13": 1597, "33_46": 1598, "46_33": 1599, "3_46": 1600, "46_3": 1601, "6_48": 1602, "48_6": 1603, "41_48": 1604, "48_41": 1605, "30_14": 1606, "14_30": 1607, "8_43": 1608, "43_8": 1609, "43_31": 1610, "31_43": 1611, "43_29": 1612, "29_43": 1613, "43_49": 1614, "49_43": 1615, "43_14": 1616, "14_43": 1617, "43_48": 1618, "48_43": 1619, "43_32": 1620, "32_43": 1621, "43_33": 1622, "33_43": 1623, "43_7": 1624, "7_43": 1625, "43_5": 1626, "5_43": 1627, "43_19": 1628, "19_43": 1629, "43_39": 1630, "39_43": 1631, "12_7": 1632, "7_12": 1633, "12_23": 1634, "23_12": 1635, "12_20": 1636, "20_12": 1637, "12_39": 1638, "39_12": 1639, "13_19": 1640, "19_13": 1641, "36_48": 1642, "48_36": 1643, "26_16": 1644, "16_26": 1645, "26_19": 1646, "19_26": 1647, "23_19": 1648, "19_23": 1649, "22_19": 1650, "19_22": 1651, "17_17": 1652, "24_17": 1653, "17_24": 1654, "17_9": 1655, "9_17": 1656, "17_27": 1657, "27_17": 1658, "17_32": 1659, "32_17": 1660, "17_28": 1661, "28_17": 1662, "17_36": 1663, "36_17": 1664, "33_32": 1665, "32_33": 1666, "3_17": 1667, "17_3": 1668, "17_2": 1669, "2_17": 1670, "17_23": 1671, "23_17": 1672, "44_17": 1673, "17_44": 1674, "17_30": 1675, "30_17": 1676, "17_19": 1677, "19_17": 1678, "14_17": 1679, "17_14": 1680, "17_22": 1681, "22_17": 1682, "17_8": 1683, "8_17": 1684, "15_18": 1685, "18_15": 1686, "23_50": 1687, "50_23": 1688, "39_15": 1689, "15_39": 1690, "2_50": 1691, "50_2": 1692, "15_2": 1693, "2_15": 1694, "15_3": 1695, "3_15": 1696, "49_15": 1697, "15_49": 1698, "15_8": 1699, "8_15": 1700, "15_44": 1701, "44_15": 1702, "50_27": 1703, "27_50": 1704, "50_46": 1705, "46_50": 1706, "50_44": 1707, "44_50": 1708, "39_33": 1709, "33_39": 1710, "28_50": 1711, "50_28": 1712, "50_37": 1713, "37_50": 1714, "15_20": 1715, "20_15": 1716, "37_24": 1717, "24_37": 1718, "37_36": 1719, "36_37": 1720, "37_27": 1721, "27_37": 1722, "37_23": 1723, "23_37": 1724, "16_23": 1725, "23_16": 1726, "37_19": 1727, "19_37": 1728, "23_45": 1729, "45_23": 1730, "23_2": 1731, "2_23": 1732, "37_8": 1733, "8_37": 1734, "19_21": 1735, "21_19": 1736, "28_21": 1737, "21_28": 1738, "36_21": 1739, "21_36": 1740, "49_21": 1741, "21_49": 1742, "33_21": 1743, "21_33": 1744, "27_21": 1745, "21_27": 1746, "21_24": 1747, "24_21": 1748, "21_3": 1749, "3_21": 1750, "21_18": 1751, "18_21": 1752, "30_21": 1753, "21_30": 1754, "21_48": 1755, "48_21": 1756, "21_29": 1757, "29_21": 1758, "21_44": 1759, "44_21": 1760, "21_13": 1761, "13_21": 1762, "51_17": 1763, "17_51": 1764, "3_16": 1765, "16_3": 1766, "26_50": 1767, "50_26": 1768, "50_8": 1769, "8_50": 1770, "51_40": 1771, "40_51": 1772, "51_5": 1773, "5_51": 1774, "25_9": 1775, "9_25": 1776, "50_6": 1777, "6_50": 1778, "50_38": 1779, "38_50": 1780, "50_40": 1781, "40_50": 1782, "50_16": 1783, "16_50": 1784, "50_31": 1785, "31_50": 1786, "50_12": 1787, "12_50": 1788, "10_22": 1789, "22_10": 1790, "50_48": 1791, "48_50": 1792, "24_7": 1793, "7_24": 1794, "51_12": 1795, "12_51": 1796, "50_19": 1797, "19_50": 1798, "50_45": 1799, "45_50": 1800, "50_30": 1801, "30_50": 1802, "50_18": 1803, "18_50": 1804, "50_32": 1805, "32_50": 1806, "50_42": 1807, "42_50": 1808, "50_47": 1809, "47_50": 1810, "46_34": 1811, "34_46": 1812, "46_27": 1813, "27_46": 1814, "46_38": 1815, "38_46": 1816, "46_19": 1817, "19_46": 1818, "50_22": 1819, "22_50": 1820, "50_10": 1821, "10_50": 1822, "51_16": 1823, "16_51": 1824, "40_46": 1825, "46_40": 1826, "40_19": 1827, "19_40": 1828, "51_36": 1829, "36_51": 1830, "23_5": 1831, "5_23": 1832, "22_14": 1833, "14_22": 1834, "23_43": 1835, "43_23": 1836, "13_5": 1837, "5_13": 1838, "20_5": 1839, "5_20": 1840, "14_5": 1841, "5_14": 1842, "2_5": 1843, "5_2": 1844, "42_5": 1845, "5_42": 1846, "24_5": 1847, "5_24": 1848, "39_25": 1849, "25_39": 1850, "23_25": 1851, "25_23": 1852, "51_18": 1853, "18_51": 1854, "18_17": 1855, "17_18": 1856, "51_22": 1857, "22_51": 1858, "50_11": 1859, "11_50": 1860, "14_27": 1861, "27_14": 1862, "39_36": 1863, "36_39": 1864, "39_10": 1865, "10_39": 1866, "29_2": 1867, "2_29": 1868, "22_39": 1869, "39_22": 1870, "13_46": 1871, "46_13": 1872, "39_9": 1873, "9_39": 1874, "2_14": 1875, "14_2": 1876, "43_42": 1877, "42_43": 1878, "14_29": 1879, "29_14": 1880, "39_30": 1881, "30_39": 1882, "34_25": 1883, "25_34": 1884, "49_25": 1885, "25_49": 1886, "2_12": 1887, "12_2": 1888, "39_24": 1889, "24_39": 1890, "23_39": 1891, "39_23": 1892, "39_31": 1893, "31_39": 1894, "39_16": 1895, "16_39": 1896, "39_26": 1897, "26_39": 1898, "39_21": 1899, "21_39": 1900, "9_10": 1901, "10_9": 1902, "47_16": 1903, "16_47": 1904, "14_32": 1905, "32_14": 1906, "14_26": 1907, "26_14": 1908, "14_12": 1909, "12_14": 1910, "18_39": 1911, "39_18": 1912, "2_10": 1913, "10_2": 1914, "13_32": 1915, "32_13": 1916, "35_17": 1917, "17_35": 1918, "26_10": 1919, "10_26": 1920, "19_47": 1921, "47_19": 1922, "30_43": 1923, "43_30": 1924, "22_43": 1925, "43_22": 1926, "23_40": 1927, "40_23": 1928, "24_10": 1929, "10_24": 1930, "4_21": 1931, "21_4": 1932, "47_18": 1933, "18_47": 1934, "14_41": 1935, "41_14": 1936, "37_25": 1937, "25_37": 1938, "20_50": 1939, "50_20": 1940, "0_0": 1941, "1_1": 1942}