{"PAD": 0, "DUMMY_START_RELATION": 1, "UNK": 2, "12_10": 3, "12_12": 4, "8_10": 5, "12_8": 6, "32_10": 7, "20_12": 8, "49_10": 9, "51_10": 10, "10_10": 11, "32_12": 12, "51_12": 13, "30_12": 14, "8_12": 15, "31_10": 16, "49_12": 17, "58_10": 18, "28_12": 19, "24_10": 20, "47_10": 21, "4_31": 22, "31_4": 23, "69_65": 24, "65_69": 25, "8_8": 26, "70_39": 27, "39_70": 28, "26_53": 29, "53_26": 30, "33_68": 31, "68_33": 32, "40_40": 33, "69_69": 34, "58_73": 35, "73_58": 36, "58_16": 37, "16_58": 38, "31_69": 39, "69_31": 40, "10_31": 41, "52_61": 42, "61_52": 43, "66_76": 44, "76_66": 45, "33_73": 46, "73_33": 47, "38_10": 48, "10_38": 49, "38_65": 50, "65_38": 51, "47_35": 52, "35_47": 53, "50_50": 54, "50_57": 55, "57_50": 56, "58_68": 57, "68_58": 58, "4_32": 59, "32_4": 60, "4_70": 61, "70_4": 62, "30_4": 63, "4_30": 64, "71_70": 65, "70_71": 66, "26_26": 67, "31_26": 68, "26_31": 69, "31_31": 70, "47_31": 71, "31_47": 72, "33_16": 73, "16_33": 74, "65_53": 75, "53_65": 76, "65_65": 77, "10_37": 78, "37_10": 79, "64_64": 80, "64_27": 81, "27_64": 82, "64_66": 83, "66_64": 84, "52_45": 85, "45_52": 86, "39_39": 87, "70_70": 88, "65_70": 89, "70_65": 90, "30_16": 91, "16_30": 92, "52_59": 93, "59_52": 94, "52_57": 95, "57_52": 96, "52_52": 97, "48_69": 98, "69_48": 99, "50_54": 100, "54_50": 101, "60_60": 102, "52_27": 103, "27_52": 104, "3_47": 105, "47_3": 106, "30_73": 107, "73_30": 108, "30_68": 109, "68_30": 110, "72_53": 111, "53_72": 112, "72_26": 113, "26_72": 114, "72_65": 115, "65_72": 116, "72_5": 117, "5_72": 118, "10_12": 119, "24_9": 120, "9_24": 121, "42_24": 122, "24_42": 123, "24_24": 124, "52_70": 125, "70_52": 126, "49_4": 127, "4_49": 128, "3_12": 129, "12_3": 130, "3_9": 131, "9_3": 132, "3_10": 133, "10_3": 134, "3_56": 135, "56_3": 136, "35_65": 137, "65_35": 138, "52_15": 139, "15_52": 140, "45_10": 141, "10_45": 142, "63_10": 143, "10_63": 144, "63_28": 145, "28_63": 146, "63_50": 147, "50_63": 148, "29_70": 149, "70_29": 150, "26_65": 151, "65_26": 152, "26_5": 153, "5_26": 154, "48_8": 155, "8_48": 156, "48_68": 157, "68_48": 158, "64_40": 159, "40_64": 160, "32_24": 161, "24_32": 162, "33_21": 163, "21_33": 164, "59_4": 165, "4_59": 166, "65_5": 167, "5_65": 168, "70_26": 169, "26_70": 170, "70_38": 171, "38_70": 172, "38_53": 173, "53_38": 174, "35_34": 175, "34_35": 176, "4_67": 177, "67_4": 178, "64_50": 179, "50_64": 180, "64_4": 181, "4_64": 182, "24_49": 183, "49_24": 184, "55_31": 185, "31_55": 186, "41_41": 187, "5_5": 188, "4_50": 189, "50_4": 190, "49_2": 191, "2_49": 192, "49_41": 193, "41_49": 194, "70_10": 195, "10_70": 196, "58_49": 197, "49_58": 198, "66_66": 199, "37_37": 200, "57_31": 201, "31_57": 202, "3_3": 203, "27_48": 204, "48_27": 205, "4_52": 206, "52_4": 207, "4_45": 208, "45_4": 209, "64_65": 210, "65_64": 211, "64_72": 212, "72_64": 213, "45_66": 214, "66_45": 215, "45_15": 216, "15_45": 217, "45_67": 218, "67_45": 219, "41_71": 220, "71_41": 221, "47_47": 222, "54_54": 223, "54_57": 224, "57_54": 225, "47_72": 226, "72_47": 227, "10_32": 228, "33_34": 229, "34_33": 230, "24_3": 231, "3_24": 232, "57_44": 233, "44_57": 234, "4_44": 235, "44_4": 236, "29_49": 237, "49_29": 238, "5_53": 239, "53_5": 240, "33_13": 241, "13_33": 242, "75_50": 243, "50_75": 244, "75_3": 245, "3_75": 246, "75_65": 247, "65_75": 248, "35_31": 249, "31_35": 250, "44_32": 251, "32_44": 252, "44_44": 253, "44_64": 254, "64_44": 255, "44_76": 256, "76_44": 257, "10_24": 258, "10_51": 259, "64_10": 260, "10_64": 261, "49_19": 262, "19_49": 263, "30_53": 264, "53_30": 265, "36_17": 266, "17_36": 267, "29_46": 268, "46_29": 269, "72_50": 270, "50_72": 271, "72_72": 272, "47_4": 273, "4_47": 274, "47_57": 275, "57_47": 276, "47_51": 277, "51_47": 278, "4_12": 279, "12_4": 280, "26_50": 281, "50_26": 282, "72_70": 283, "70_72": 284, "49_66": 285, "66_49": 286, "24_4": 287, "4_24": 288, "10_9": 289, "9_10": 290, "70_16": 291, "16_70": 292, "45_45": 293, "29_66": 294, "66_29": 295, "71_61": 296, "61_71": 297, "65_46": 298, "46_65": 299, "7_57": 300, "57_7": 301, "24_67": 302, "67_24": 303, "69_5": 304, "5_69": 305, "6_29": 306, "29_6": 307, "49_49": 308, "29_16": 309, "16_29": 310, "33_49": 311, "49_33": 312, "36_15": 313, "15_36": 314, "25_25": 315, "38_60": 316, "60_38": 317, "38_38": 318, "70_66": 319, "66_70": 320, "20_34": 321, "34_20": 322, "3_50": 323, "50_3": 324, "10_59": 325, "59_10": 326, "41_27": 327, "27_41": 328, "41_8": 329, "8_41": 330, "41_47": 331, "47_41": 332, "41_40": 333, "40_41": 334, "41_67": 335, "67_41": 336, "41_50": 337, "50_41": 338, "41_61": 339, "61_41": 340, "18_18": 341, "27_4": 342, "4_27": 343, "45_34": 344, "34_45": 345, "57_26": 346, "26_57": 347, "72_31": 348, "31_72": 349, "50_65": 350, "65_50": 351, "50_5": 352, "5_50": 353, "50_38": 354, "38_50": 355, "50_10": 356, "10_50": 357, "50_40": 358, "40_50": 359, "50_69": 360, "69_50": 361, "50_53": 362, "53_50": 363, "49_15": 364, "15_49": 365, "32_32": 366, "32_46": 367, "46_32": 368, "32_56": 369, "56_32": 370, "29_20": 371, "20_29": 372, "4_4": 373, "29_32": 374, "32_29": 375, "72_40": 376, "40_72": 377, "67_50": 378, "50_67": 379, "38_59": 380, "59_38": 381, "34_34": 382, "54_32": 383, "32_54": 384, "54_26": 385, "26_54": 386, "41_2": 387, "2_41": 388, "67_53": 389, "53_67": 390, "67_65": 391, "65_67": 392, "67_67": 393, "67_72": 394, "72_67": 395, "4_65": 396, "65_4": 397, "24_28": 398, "28_24": 399, "69_67": 400, "67_69": 401, "49_68": 402, "68_49": 403, "69_10": 404, "10_69": 405, "50_31": 406, "31_50": 407, "32_43": 408, "43_32": 409, "25_66": 410, "66_25": 411, "7_10": 412, "10_7": 413, "72_10": 414, "10_72": 415, "72_44": 416, "44_72": 417, "72_4": 418, "4_72": 419, "7_69": 420, "69_7": 421, "32_31": 422, "31_32": 423, "53_53": 424, "4_51": 425, "51_4": 426, "6_24": 427, "24_6": 428, "6_49": 429, "49_6": 430, "12_31": 431, "31_12": 432, "29_3": 433, "3_29": 434, "35_10": 435, "10_35": 436, "3_67": 437, "67_3": 438, "3_31": 439, "31_3": 440, "8_53": 441, "53_8": 442, "32_66": 443, "66_32": 444, "30_70": 445, "70_30": 446, "34_4": 447, "4_34": 448, "52_48": 449, "48_52": 450, "52_39": 451, "39_52": 452, "56_56": 453, "51_51": 454, "58_29": 455, "29_58": 456, "58_57": 457, "57_58": 458, "32_47": 459, "47_32": 460, "9_65": 461, "65_9": 462, "72_22": 463, "22_72": 464, "66_18": 465, "18_66": 466, "54_31": 467, "31_54": 468, "32_52": 469, "52_32": 470, "32_57": 471, "57_32": 472, "15_34": 473, "34_15": 474, "8_66": 475, "66_8": 476, "47_69": 477, "69_47": 478, "3_28": 479, "28_3": 480, "51_31": 481, "31_51": 482, "8_67": 483, "67_8": 484, "8_65": 485, "65_8": 486, "68_29": 487, "29_68": 488, "29_29": 489, "52_54": 490, "54_52": 491, "50_52": 492, "52_50": 493, "50_44": 494, "44_50": 495, "50_27": 496, "27_50": 497, "50_12": 498, "12_50": 499, "50_47": 500, "47_50": 501, "50_9": 502, "9_50": 503, "10_47": 504, "69_60": 505, "60_69": 506, "29_59": 507, "59_29": 508, "6_6": 509, "6_71": 510, "71_6": 511, "10_46": 512, "46_10": 513, "3_72": 514, "72_3": 515, "3_34": 516, "34_3": 517, "24_43": 518, "43_24": 519, "63_56": 520, "56_63": 521, "8_73": 522, "73_8": 523, "8_70": 524, "70_8": 525, "29_4": 526, "4_29": 527, "23_23": 528, "23_28": 529, "28_23": 530, "4_43": 531, "43_4": 532, "24_73": 533, "73_24": 534, "55_55": 535, "45_31": 536, "31_45": 537, "50_59": 538, "59_50": 539, "23_61": 540, "61_23": 541, "37_67": 542, "67_37": 543, "37_56": 544, "56_37": 545, "37_69": 546, "69_37": 547, "37_31": 548, "31_37": 549, "32_39": 550, "39_32": 551, "57_57": 552, "40_27": 553, "27_40": 554, "40_10": 555, "10_40": 556, "33_25": 557, "25_33": 558, "52_49": 559, "49_52": 560, "70_46": 561, "46_70": 562, "12_49": 563, "49_71": 564, "71_49": 565, "71_31": 566, "31_71": 567, "71_66": 568, "66_71": 569, "71_71": 570, "49_45": 571, "45_49": 572, "30_18": 573, "18_30": 574, "40_47": 575, "47_40": 576, "48_31": 577, "31_48": 578, "14_65": 579, "65_14": 580, "64_38": 581, "38_64": 582, "64_17": 583, "17_64": 584, "40_67": 585, "67_40": 586, "40_4": 587, "4_40": 588, "49_30": 589, "30_49": 590, "49_31": 591, "31_49": 592, "29_28": 593, "28_29": 594, "3_26": 595, "26_3": 596, "3_57": 597, "57_3": 598, "3_32": 599, "32_3": 600, "3_44": 601, "44_3": 602, "36_45": 603, "45_36": 604, "61_50": 605, "50_61": 606, "20_16": 607, "16_20": 608, "40_65": 609, "65_40": 610, "52_66": 611, "66_52": 612, "37_68": 613, "68_37": 614, "69_53": 615, "53_69": 616, "3_65": 617, "65_3": 618, "32_70": 619, "70_32": 620, "18_53": 621, "53_18": 622, "40_8": 623, "8_40": 624, "40_53": 625, "53_40": 626, "23_52": 627, "52_23": 628, "39_72": 629, "72_39": 630, "27_27": 631, "48_10": 632, "10_48": 633, "55_10": 634, "10_55": 635, "13_8": 636, "8_13": 637, "20_20": 638, "54_4": 639, "4_54": 640, "3_64": 641, "64_3": 642, "3_40": 643, "40_3": 644, "69_72": 645, "72_69": 646, "5_39": 647, "39_5": 648, "72_46": 649, "46_72": 650, "15_53": 651, "53_15": 652, "29_26": 653, "26_29": 654, "7_26": 655, "26_7": 656, "65_37": 657, "37_65": 658, "3_21": 659, "21_3": 660, "15_59": 661, "59_15": 662, "34_18": 663, "18_34": 664, "13_12": 665, "12_13": 666, "24_56": 667, "56_24": 668, "64_8": 669, "8_64": 670, "64_41": 671, "41_64": 672, "64_47": 673, "47_64": 674, "38_26": 675, "26_38": 676, "34_32": 677, "32_34": 678, "6_4": 679, "4_6": 680, "38_5": 681, "5_38": 682, "32_26": 683, "26_32": 684, "65_10": 685, "10_65": 686, "29_8": 687, "8_29": 688, "69_26": 689, "26_69": 690, "22_22": 691, "38_69": 692, "69_38": 693, "29_65": 694, "65_29": 695, "26_67": 696, "67_26": 697, "18_50": 698, "50_18": 699, "18_4": 700, "4_18": 701, "71_2": 702, "2_71": 703, "71_23": 704, "23_71": 705, "71_24": 706, "24_71": 707, "47_56": 708, "56_47": 709, "29_24": 710, "24_29": 711, "8_72": 712, "72_8": 713, "65_47": 714, "47_65": 715, "40_24": 716, "24_40": 717, "29_53": 718, "53_29": 719, "32_55": 720, "55_32": 721, "3_69": 722, "69_3": 723, "44_40": 724, "40_44": 725, "33_24": 726, "24_33": 727, "38_47": 728, "47_38": 729, "26_22": 730, "22_26": 731, "49_70": 732, "70_49": 733, "48_13": 734, "13_48": 735, "50_45": 736, "45_50": 737, "29_39": 738, "39_29": 739, "49_63": 740, "63_49": 741, "8_49": 742, "49_8": 743, "34_26": 744, "26_34": 745, "18_20": 746, "20_18": 747, "27_65": 748, "65_27": 749, "17_73": 750, "73_17": 751, "24_65": 752, "65_24": 753, "24_13": 754, "13_24": 755, "34_39": 756, "39_34": 757, "16_31": 758, "31_16": 759, "47_12": 760, "12_47": 761, "64_49": 762, "49_64": 763, "64_32": 764, "32_64": 765, "64_2": 766, "2_64": 767, "42_42": 768, "38_4": 769, "4_38": 770, "14_50": 771, "50_14": 772, "32_45": 773, "45_32": 774, "52_8": 775, "8_52": 776, "52_29": 777, "29_52": 778, "10_4": 779, "4_10": 780, "54_29": 781, "29_54": 782, "35_35": 783, "35_63": 784, "63_35": 785, "75_75": 786, "75_53": 787, "53_75": 788, "41_23": 789, "23_41": 790, "41_11": 791, "11_41": 792, "67_31": 793, "31_67": 794, "9_9": 795, "15_4": 796, "4_15": 797, "15_15": 798, "7_50": 799, "50_7": 800, "10_60": 801, "60_10": 802, "58_70": 803, "70_58": 804, "52_64": 805, "64_52": 806, "50_28": 807, "28_50": 808, "32_6": 809, "6_32": 810, "57_72": 811, "72_57": 812, "32_76": 813, "76_32": 814, "47_60": 815, "60_47": 816, "24_61": 817, "61_24": 818, "21_15": 819, "15_21": 820, "32_68": 821, "68_32": 822, "46_69": 823, "69_46": 824, "46_37": 825, "37_46": 826, "8_24": 827, "24_8": 828, "13_13": 829, "68_46": 830, "46_68": 831, "70_2": 832, "2_70": 833, "15_65": 834, "65_15": 835, "72_27": 836, "27_72": 837, "74_34": 838, "34_74": 839, "3_6": 840, "6_3": 841, "48_12": 842, "12_48": 843, "17_46": 844, "46_17": 845, "17_38": 846, "38_17": 847, "74_68": 848, "68_74": 849, "20_32": 850, "32_20": 851, "41_19": 852, "19_41": 853, "24_57": 854, "57_24": 855, "55_65": 856, "65_55": 857, "23_25": 858, "25_23": 859, "50_32": 860, "32_50": 861, "50_60": 862, "60_50": 863, "66_65": 864, "65_66": 865, "65_39": 866, "39_65": 867, "41_10": 868, "10_41": 869, "69_27": 870, "27_69": 871, "55_47": 872, "47_55": 873, "55_51": 874, "51_55": 875, "29_57": 876, "57_29": 877, "33_33": 878, "58_3": 879, "3_58": 880, "33_15": 881, "15_33": 882, "30_67": 883, "67_30": 884, "5_46": 885, "46_5": 886, "66_10": 887, "10_66": 888, "4_57": 889, "57_4": 890, "55_50": 891, "50_55": 892, "48_39": 893, "39_48": 894, "38_72": 895, "72_38": 896, "3_49": 897, "49_3": 898, "4_71": 899, "71_4": 900, "6_31": 901, "31_6": 902, "21_4": 903, "4_21": 904, "30_19": 905, "19_30": 906, "66_24": 907, "24_66": 908, "49_23": 909, "23_49": 910, "54_72": 911, "72_54": 912, "45_48": 913, "48_45": 914, "45_8": 915, "8_45": 916, "70_50": 917, "50_70": 918, "28_54": 919, "54_28": 920, "4_33": 921, "33_4": 922, "55_53": 923, "53_55": 924, "55_67": 925, "67_55": 926, "49_73": 927, "73_49": 928, "50_46": 929, "46_50": 930, "43_39": 931, "39_43": 932, "3_61": 933, "61_3": 934, "46_46": 935, "49_55": 936, "55_49": 937, "24_15": 938, "15_24": 939, "12_57": 940, "57_12": 941, "12_51": 942, "3_13": 943, "13_3": 944, "70_11": 945, "11_70": 946, "26_46": 947, "46_26": 948, "26_28": 949, "28_26": 950, "10_67": 951, "67_10": 952, "66_67": 953, "67_66": 954, "26_47": 955, "47_26": 956, "22_70": 957, "70_22": 958, "22_65": 959, "65_22": 960, "8_31": 961, "31_8": 962, "31_53": 963, "53_31": 964, "31_63": 965, "63_31": 966, "72_75": 967, "75_72": 968, "4_56": 969, "56_4": 970, "33_8": 971, "8_33": 972, "69_70": 973, "70_69": 974, "43_65": 975, "65_43": 976, "72_73": 977, "73_72": 978, "34_71": 979, "71_34": 980, "29_51": 981, "51_29": 982, "4_26": 983, "26_4": 984, "24_70": 985, "70_24": 986, "45_64": 987, "64_45": 988, "29_67": 989, "67_29": 990, "25_20": 991, "20_25": 992, "32_49": 993, "49_32": 994, "30_58": 995, "58_30": 996, "27_70": 997, "70_27": 998, "50_49": 999, "49_50": 1000, "10_56": 1001, "56_10": 1002, "10_44": 1003, "44_10": 1004, "10_57": 1005, "57_10": 1006, "10_75": 1007, "75_10": 1008, "10_18": 1009, "18_10": 1010, "64_53": 1011, "53_64": 1012, "43_43": 1013, "10_53": 1014, "53_10": 1015, "32_53": 1016, "53_32": 1017, "12_16": 1018, "16_12": 1019, "8_59": 1020, "59_8": 1021, "25_70": 1022, "70_25": 1023, "25_3": 1024, "3_25": 1025, "25_65": 1026, "65_25": 1027, "45_29": 1028, "29_45": 1029, "35_37": 1030, "37_35": 1031, "35_28": 1032, "28_35": 1033, "21_70": 1034, "70_21": 1035, "38_40": 1036, "40_38": 1037, "57_45": 1038, "45_57": 1039, "29_61": 1040, "61_29": 1041, "24_55": 1042, "55_24": 1043, "75_31": 1044, "31_75": 1045, "75_56": 1046, "56_75": 1047, "49_72": 1048, "72_49": 1049, "70_15": 1050, "15_70": 1051, "51_3": 1052, "3_51": 1053, "18_7": 1054, "7_18": 1055, "42_10": 1056, "10_42": 1057, "37_70": 1058, "70_37": 1059, "7_31": 1060, "31_7": 1061, "4_28": 1062, "28_4": 1063, "48_70": 1064, "70_48": 1065, "34_21": 1066, "21_34": 1067, "69_56": 1068, "56_69": 1069, "70_73": 1070, "73_70": 1071, "63_34": 1072, "34_63": 1073, "70_59": 1074, "59_70": 1075, "64_57": 1076, "57_64": 1077, "70_45": 1078, "45_70": 1079, "45_24": 1080, "24_45": 1081, "45_53": 1082, "53_45": 1083, "50_30": 1084, "30_50": 1085, "23_26": 1086, "26_23": 1087, "12_34": 1088, "34_12": 1089, "12_56": 1090, "56_12": 1091, "22_38": 1092, "38_22": 1093, "47_67": 1094, "67_47": 1095, "29_76": 1096, "76_29": 1097, "70_34": 1098, "34_70": 1099, "4_3": 1100, "3_4": 1101, "49_46": 1102, "46_49": 1103, "7_8": 1104, "8_7": 1105, "30_45": 1106, "45_30": 1107, "23_31": 1108, "31_23": 1109, "74_72": 1110, "72_74": 1111, "24_16": 1112, "16_24": 1113, "71_10": 1114, "10_71": 1115, "73_15": 1116, "15_73": 1117, "69_64": 1118, "64_69": 1119, "23_2": 1120, "2_23": 1121, "54_65": 1122, "65_54": 1123, "5_14": 1124, "14_5": 1125, "48_3": 1126, "3_48": 1127, "46_53": 1128, "53_46": 1129, "15_48": 1130, "48_15": 1131, "36_65": 1132, "65_36": 1133, "45_65": 1134, "65_45": 1135, "48_72": 1136, "72_48": 1137, "65_56": 1138, "56_65": 1139, "3_30": 1140, "30_3": 1141, "30_71": 1142, "71_30": 1143, "12_65": 1144, "65_12": 1145, "29_44": 1146, "44_29": 1147, "66_47": 1148, "47_66": 1149, "40_69": 1150, "69_40": 1151, "21_59": 1152, "59_21": 1153, "13_47": 1154, "47_13": 1155, "13_59": 1156, "59_13": 1157, "63_53": 1158, "53_63": 1159, "63_26": 1160, "26_63": 1161, "63_4": 1162, "4_63": 1163, "7_44": 1164, "44_7": 1165, "26_64": 1166, "64_26": 1167, "66_50": 1168, "50_66": 1169, "9_4": 1170, "4_9": 1171, "48_49": 1172, "49_48": 1173, "49_57": 1174, "57_49": 1175, "18_26": 1176, "26_18": 1177, "48_4": 1178, "4_48": 1179, "34_68": 1180, "68_34": 1181, "4_37": 1182, "37_4": 1183, "44_26": 1184, "26_44": 1185, "5_70": 1186, "70_5": 1187, "69_34": 1188, "34_69": 1189, "28_31": 1190, "31_28": 1191, "26_10": 1192, "10_26": 1193, "66_4": 1194, "4_66": 1195, "42_61": 1196, "61_42": 1197, "28_28": 1198, "26_6": 1199, "6_26": 1200, "10_34": 1201, "34_10": 1202, "43_46": 1203, "46_43": 1204, "9_39": 1205, "39_9": 1206, "24_39": 1207, "39_24": 1208, "54_16": 1209, "16_54": 1210, "40_26": 1211, "26_40": 1212, "64_5": 1213, "5_64": 1214, "22_53": 1215, "53_22": 1216, "27_29": 1217, "29_27": 1218, "40_12": 1219, "12_40": 1220, "34_24": 1221, "24_34": 1222, "3_15": 1223, "15_3": 1224, "27_10": 1225, "10_27": 1226, "46_61": 1227, "61_46": 1228, "18_67": 1229, "67_18": 1230, "34_73": 1231, "73_34": 1232, "52_73": 1233, "73_52": 1234, "50_15": 1235, "15_50": 1236, "30_30": 1237, "70_19": 1238, "19_70": 1239, "70_68": 1240, "68_70": 1241, "70_6": 1242, "6_70": 1243, "70_64": 1244, "64_70": 1245, "60_65": 1246, "65_60": 1247, "44_69": 1248, "69_44": 1249, "44_65": 1250, "65_44": 1251, "44_27": 1252, "27_44": 1253, "72_66": 1254, "66_72": 1255, "72_18": 1256, "18_72": 1257, "49_34": 1258, "34_49": 1259, "23_72": 1260, "72_23": 1261, "23_12": 1262, "12_23": 1263, "19_24": 1264, "24_19": 1265, "8_16": 1266, "16_8": 1267, "60_34": 1268, "34_60": 1269, "37_73": 1270, "73_37": 1271, "29_15": 1272, "15_29": 1273, "74_67": 1274, "67_74": 1275, "52_55": 1276, "55_52": 1277, "32_18": 1278, "18_32": 1279, "32_38": 1280, "38_32": 1281, "64_36": 1282, "36_64": 1283, "49_53": 1284, "53_49": 1285, "48_50": 1286, "50_48": 1287, "48_65": 1288, "65_48": 1289, "34_29": 1290, "29_34": 1291, "41_66": 1292, "66_41": 1293, "41_25": 1294, "25_41": 1295, "4_69": 1296, "69_4": 1297, "41_69": 1298, "69_41": 1299, "41_12": 1300, "12_41": 1301, "8_32": 1302, "32_8": 1303, "39_68": 1304, "68_39": 1305, "64_24": 1306, "24_64": 1307, "47_44": 1308, "44_47": 1309, "10_28": 1310, "28_10": 1311, "67_34": 1312, "34_67": 1313, "32_61": 1314, "61_32": 1315, "27_53": 1316, "53_27": 1317, "65_31": 1318, "31_65": 1319, "17_32": 1320, "32_17": 1321, "4_5": 1322, "5_4": 1323, "52_31": 1324, "31_52": 1325, "6_68": 1326, "68_6": 1327, "47_74": 1328, "74_47": 1329, "75_55": 1330, "55_75": 1331, "32_72": 1332, "72_32": 1333, "26_39": 1334, "39_26": 1335, "57_46": 1336, "46_57": 1337, "3_70": 1338, "70_3": 1339, "53_28": 1340, "28_53": 1341, "24_31": 1342, "31_24": 1343, "29_71": 1344, "71_29": 1345, "29_12": 1346, "12_29": 1347, "45_3": 1348, "3_45": 1349, "45_19": 1350, "19_45": 1351, "43_75": 1352, "75_43": 1353, "7_29": 1354, "29_7": 1355, "52_12": 1356, "12_52": 1357, "57_63": 1358, "63_57": 1359, "30_41": 1360, "41_30": 1361, "57_56": 1362, "56_57": 1363, "29_73": 1364, "73_29": 1365, "49_67": 1366, "67_49": 1367, "21_72": 1368, "72_21": 1369, "12_20": 1370, "24_53": 1371, "53_24": 1372, "42_3": 1373, "3_42": 1374, "33_45": 1375, "45_33": 1376, "33_55": 1377, "55_33": 1378, "61_68": 1379, "68_61": 1380, "34_51": 1381, "51_34": 1382, "35_53": 1383, "53_35": 1384, "48_34": 1385, "34_48": 1386, "49_76": 1387, "76_49": 1388, "32_27": 1389, "27_32": 1390, "52_3": 1391, "3_52": 1392, "35_69": 1393, "69_35": 1394, "24_54": 1395, "54_24": 1396, "43_67": 1397, "67_43": 1398, "35_72": 1399, "72_35": 1400, "7_7": 1401, "32_30": 1402, "30_32": 1403, "38_61": 1404, "61_38": 1405, "34_19": 1406, "19_34": 1407, "10_16": 1408, "16_10": 1409, "5_28": 1410, "28_5": 1411, "5_73": 1412, "73_5": 1413, "5_71": 1414, "71_5": 1415, "5_13": 1416, "13_5": 1417, "33_6": 1418, "6_33": 1419, "3_27": 1420, "27_3": 1421, "3_66": 1422, "66_3": 1423, "68_18": 1424, "18_68": 1425, "36_69": 1426, "69_36": 1427, "12_32": 1428, "30_15": 1429, "15_30": 1430, "38_39": 1431, "39_38": 1432, "70_57": 1433, "57_70": 1434, "18_31": 1435, "31_18": 1436, "70_61": 1437, "61_70": 1438, "4_13": 1439, "13_4": 1440, "70_31": 1441, "31_70": 1442, "48_55": 1443, "55_48": 1444, "21_69": 1445, "69_21": 1446, "66_5": 1447, "5_66": 1448, "66_68": 1449, "68_66": 1450, "21_50": 1451, "50_21": 1452, "37_34": 1453, "34_37": 1454, "58_19": 1455, "19_58": 1456, "48_26": 1457, "26_48": 1458, "71_25": 1459, "25_71": 1460, "71_26": 1461, "26_71": 1462, "49_18": 1463, "18_49": 1464, "73_16": 1465, "16_73": 1466, "33_10": 1467, "10_33": 1468, "48_18": 1469, "18_48": 1470, "52_38": 1471, "38_52": 1472, "57_28": 1473, "28_57": 1474, "71_72": 1475, "72_71": 1476, "56_26": 1477, "26_56": 1478, "56_72": 1479, "72_56": 1480, "56_73": 1481, "73_56": 1482, "56_50": 1483, "50_56": 1484, "40_2": 1485, "2_40": 1486, "58_45": 1487, "45_58": 1488, "34_17": 1489, "17_34": 1490, "57_55": 1491, "55_57": 1492, "23_19": 1493, "19_23": 1494, "66_27": 1495, "27_66": 1496, "32_16": 1497, "16_32": 1498, "5_45": 1499, "45_5": 1500, "43_31": 1501, "31_43": 1502, "31_56": 1503, "56_31": 1504, "44_18": 1505, "18_44": 1506, "43_66": 1507, "66_43": 1508, "33_66": 1509, "66_33": 1510, "34_53": 1511, "53_34": 1512, "58_31": 1513, "31_58": 1514, "52_26": 1515, "26_52": 1516, "18_59": 1517, "59_18": 1518, "38_67": 1519, "67_38": 1520, "30_24": 1521, "24_30": 1522, "42_4": 1523, "4_42": 1524, "51_15": 1525, "15_51": 1526, "65_21": 1527, "21_65": 1528, "52_65": 1529, "65_52": 1530, "12_30": 1531, "52_18": 1532, "18_52": 1533, "28_25": 1534, "25_28": 1535, "18_64": 1536, "64_18": 1537, "26_24": 1538, "24_26": 1539, "66_63": 1540, "63_66": 1541, "34_66": 1542, "66_34": 1543, "57_61": 1544, "61_57": 1545, "57_51": 1546, "51_57": 1547, "57_9": 1548, "9_57": 1549, "4_55": 1550, "55_4": 1551, "51_59": 1552, "59_51": 1553, "6_16": 1554, "16_6": 1555, "70_76": 1556, "76_70": 1557, "28_49": 1558, "49_28": 1559, "31_60": 1560, "60_31": 1561, "43_50": 1562, "50_43": 1563, "67_68": 1564, "68_67": 1565, "23_4": 1566, "4_23": 1567, "75_12": 1568, "12_75": 1569, "6_18": 1570, "18_6": 1571, "49_26": 1572, "26_49": 1573, "64_55": 1574, "55_64": 1575, "26_15": 1576, "15_26": 1577, "38_16": 1578, "16_38": 1579, "52_47": 1580, "47_52": 1581, "32_67": 1582, "67_32": 1583, "42_12": 1584, "12_42": 1585, "64_67": 1586, "67_64": 1587, "69_57": 1588, "57_69": 1589, "69_63": 1590, "63_69": 1591, "69_28": 1592, "28_69": 1593, "69_17": 1594, "17_69": 1595, "70_54": 1596, "54_70": 1597, "49_54": 1598, "54_49": 1599, "47_37": 1600, "37_47": 1601, "12_28": 1602, "49_25": 1603, "25_49": 1604, "43_10": 1605, "10_43": 1606, "55_60": 1607, "60_55": 1608, "40_15": 1609, "15_40": 1610, "40_66": 1611, "66_40": 1612, "18_47": 1613, "47_18": 1614, "33_65": 1615, "65_33": 1616, "19_25": 1617, "25_19": 1618, "8_26": 1619, "26_8": 1620, "74_4": 1621, "4_74": 1622, "34_65": 1623, "65_34": 1624, "40_25": 1625, "25_40": 1626, "29_13": 1627, "13_29": 1628, "25_24": 1629, "24_25": 1630, "50_8": 1631, "8_50": 1632, "50_71": 1633, "71_50": 1634, "52_72": 1635, "72_52": 1636, "70_67": 1637, "67_70": 1638, "5_49": 1639, "49_5": 1640, "72_43": 1641, "43_72": 1642, "74_53": 1643, "53_74": 1644, "34_59": 1645, "59_34": 1646, "43_70": 1647, "70_43": 1648, "43_64": 1649, "64_43": 1650, "67_27": 1651, "27_67": 1652, "3_59": 1653, "59_3": 1654, "3_33": 1655, "33_3": 1656, "43_3": 1657, "3_43": 1658, "6_42": 1659, "42_6": 1660, "47_63": 1661, "63_47": 1662, "52_56": 1663, "56_52": 1664, "27_18": 1665, "18_27": 1666, "15_18": 1667, "18_15": 1668, "29_50": 1669, "50_29": 1670, "10_76": 1671, "76_10": 1672, "23_70": 1673, "70_23": 1674, "47_53": 1675, "53_47": 1676, "64_30": 1677, "30_64": 1678, "24_12": 1679, "12_24": 1680, "48_48": 1681, "32_63": 1682, "63_32": 1683, "66_26": 1684, "26_66": 1685, "21_73": 1686, "73_21": 1687, "52_34": 1688, "34_52": 1689, "50_58": 1690, "58_50": 1691, "50_76": 1692, "76_50": 1693, "48_29": 1694, "29_48": 1695, "25_10": 1696, "10_25": 1697, "21_53": 1698, "53_21": 1699, "30_28": 1700, "28_30": 1701, "8_76": 1702, "76_8": 1703, "54_12": 1704, "12_54": 1705, "7_70": 1706, "70_7": 1707, "50_73": 1708, "73_50": 1709, "48_73": 1710, "73_48": 1711, "39_45": 1712, "45_39": 1713, "6_28": 1714, "28_6": 1715, "52_24": 1716, "24_52": 1717, "66_12": 1718, "12_66": 1719, "64_15": 1720, "15_64": 1721, "57_76": 1722, "76_57": 1723, "37_53": 1724, "53_37": 1725, "43_57": 1726, "57_43": 1727, "29_2": 1728, "2_29": 1729, "61_65": 1730, "65_61": 1731, "37_38": 1732, "38_37": 1733, "44_53": 1734, "53_44": 1735, "54_63": 1736, "63_54": 1737, "40_71": 1738, "71_40": 1739, "48_24": 1740, "24_48": 1741, "73_31": 1742, "31_73": 1743, "73_66": 1744, "66_73": 1745, "38_27": 1746, "27_38": 1747, "32_69": 1748, "69_32": 1749, "21_64": 1750, "64_21": 1751, "52_37": 1752, "37_52": 1753, "30_8": 1754, "8_30": 1755, "3_7": 1756, "7_3": 1757, "75_5": 1758, "5_75": 1759, "75_52": 1760, "52_75": 1761, "57_53": 1762, "53_57": 1763, "72_9": 1764, "9_72": 1765, "58_71": 1766, "71_58": 1767, "36_38": 1768, "38_36": 1769, "8_25": 1770, "25_8": 1771, "43_47": 1772, "47_43": 1773, "41_6": 1774, "6_41": 1775, "9_69": 1776, "69_9": 1777, "54_45": 1778, "45_54": 1779, "12_70": 1780, "70_12": 1781, "12_67": 1782, "67_12": 1783, "72_45": 1784, "45_72": 1785, "57_42": 1786, "42_57": 1787, "57_18": 1788, "18_57": 1789, "57_66": 1790, "66_57": 1791, "12_37": 1792, "37_12": 1793, "71_67": 1794, "67_71": 1795, "6_15": 1796, "15_6": 1797, "50_35": 1798, "35_50": 1799, "6_25": 1800, "25_6": 1801, "50_24": 1802, "24_50": 1803, "66_31": 1804, "31_66": 1805, "40_5": 1806, "5_40": 1807, "64_46": 1808, "46_64": 1809, "64_31": 1810, "31_64": 1811, "16_16": 1812, "8_4": 1813, "4_8": 1814, "12_53": 1815, "53_12": 1816, "12_45": 1817, "45_12": 1818, "12_19": 1819, "19_12": 1820, "72_51": 1821, "51_72": 1822, "24_59": 1823, "59_24": 1824, "10_13": 1825, "13_10": 1826, "51_67": 1827, "67_51": 1828, "51_28": 1829, "28_51": 1830, "51_37": 1831, "37_51": 1832, "51_56": 1833, "56_51": 1834, "51_53": 1835, "53_51": 1836, "29_30": 1837, "30_29": 1838, "70_18": 1839, "18_70": 1840, "66_56": 1841, "56_66": 1842, "26_45": 1843, "45_26": 1844, "44_31": 1845, "31_44": 1846, "8_15": 1847, "15_8": 1848, "7_67": 1849, "67_7": 1850, "3_53": 1851, "53_3": 1852, "20_70": 1853, "70_20": 1854, "6_30": 1855, "30_6": 1856, "53_56": 1857, "56_53": 1858, "73_27": 1859, "27_73": 1860, "4_53": 1861, "53_4": 1862, "6_45": 1863, "45_6": 1864, "27_49": 1865, "49_27": 1866, "21_48": 1867, "48_21": 1868, "54_34": 1869, "34_54": 1870, "49_7": 1871, "7_49": 1872, "64_71": 1873, "71_64": 1874, "15_17": 1875, "17_15": 1876, "13_31": 1877, "31_13": 1878, "35_60": 1879, "60_35": 1880, "2_2": 1881, "23_45": 1882, "45_23": 1883, "49_16": 1884, "16_49": 1885, "40_31": 1886, "31_40": 1887, "68_65": 1888, "65_68": 1889, "12_55": 1890, "55_12": 1891, "28_72": 1892, "72_28": 1893, "49_74": 1894, "74_49": 1895, "76_53": 1896, "53_76": 1897, "38_46": 1898, "46_38": 1899, "3_8": 1900, "8_3": 1901, "12_27": 1902, "27_12": 1903, "64_76": 1904, "76_64": 1905, "64_56": 1906, "56_64": 1907, "44_66": 1908, "66_44": 1909, "18_65": 1910, "65_18": 1911, "45_25": 1912, "25_45": 1913, "58_2": 1914, "2_58": 1915, "35_40": 1916, "40_35": 1917, "24_51": 1918, "51_24": 1919, "70_53": 1920, "53_70": 1921, "30_48": 1922, "48_30": 1923, "30_25": 1924, "25_30": 1925, "54_56": 1926, "56_54": 1927, "20_31": 1928, "31_20": 1929, "54_8": 1930, "8_54": 1931, "28_59": 1932, "59_28": 1933, "66_15": 1934, "15_66": 1935, "3_74": 1936, "74_3": 1937, "20_4": 1938, "4_20": 1939, "10_68": 1940, "68_10": 1941, "16_66": 1942, "66_16": 1943, "26_17": 1944, "17_26": 1945, "51_58": 1946, "58_51": 1947, "51_13": 1948, "13_51": 1949, "74_73": 1950, "73_74": 1951, "67_25": 1952, "25_67": 1953, "58_8": 1954, "8_58": 1955, "57_68": 1956, "68_57": 1957, "3_20": 1958, "20_3": 1959, "57_67": 1960, "67_57": 1961, "5_16": 1962, "16_5": 1963, "53_48": 1964, "48_53": 1965, "53_23": 1966, "23_53": 1967, "53_71": 1968, "71_53": 1969, "6_61": 1970, "61_6": 1971, "29_56": 1972, "56_29": 1973, "64_59": 1974, "59_64": 1975, "54_55": 1976, "55_54": 1977, "35_55": 1978, "55_35": 1979, "44_35": 1980, "35_44": 1981, "7_72": 1982, "72_7": 1983, "15_31": 1984, "31_15": 1985, "24_68": 1986, "68_24": 1987, "52_30": 1988, "30_52": 1989, "9_31": 1990, "31_9": 1991, "58_34": 1992, "34_58": 1993, "8_57": 1994, "57_8": 1995, "29_18": 1996, "18_29": 1997, "42_7": 1998, "7_42": 1999, "42_31": 2000, "31_42": 2001, "68_4": 2002, "4_68": 2003, "64_29": 2004, "29_64": 2005, "64_7": 2006, "7_64": 2007, "14_72": 2008, "72_14": 2009, "49_51": 2010, "51_49": 2011, "60_26": 2012, "26_60": 2013, "4_35": 2014, "35_4": 2015, "40_75": 2016, "75_40": 2017, "8_18": 2018, "18_8": 2019, "29_38": 2020, "38_29": 2021, "32_25": 2022, "25_32": 2023, "74_10": 2024, "10_74": 2025, "3_5": 2026, "5_3": 2027, "19_9": 2028, "9_19": 2029, "45_69": 2030, "69_45": 2031, "17_72": 2032, "72_17": 2033, "48_35": 2034, "35_48": 2035, "18_25": 2036, "25_18": 2037, "46_4": 2038, "4_46": 2039, "64_48": 2040, "48_64": 2041, "42_26": 2042, "26_42": 2043, "10_5": 2044, "5_10": 2045, "51_9": 2046, "9_51": 2047, "37_72": 2048, "72_37": 2049, "19_18": 2050, "18_19": 2051, "59_65": 2052, "65_59": 2053, "72_15": 2054, "15_72": 2055, "7_65": 2056, "65_7": 2057, "8_71": 2058, "71_8": 2059, "30_72": 2060, "72_30": 2061, "12_72": 2062, "72_12": 2063, "13_28": 2064, "28_13": 2065, "17_65": 2066, "65_17": 2067, "52_58": 2068, "58_52": 2069, "49_38": 2070, "38_49": 2071, "30_34": 2072, "34_30": 2073, "19_68": 2074, "68_19": 2075, "74_74": 2076, "13_65": 2077, "65_13": 2078, "10_20": 2079, "20_10": 2080, "61_4": 2081, "4_61": 2082, "49_39": 2083, "39_49": 2084, "23_24": 2085, "24_23": 2086, "32_60": 2087, "60_32": 2088, "18_61": 2089, "61_18": 2090, "75_54": 2091, "54_75": 2092, "33_70": 2093, "70_33": 2094, "41_65": 2095, "65_41": 2096, "43_2": 2097, "2_43": 2098, "8_44": 2099, "44_8": 2100, "32_58": 2101, "58_32": 2102, "40_49": 2103, "49_40": 2104, "35_24": 2105, "24_35": 2106, "36_24": 2107, "24_36": 2108, "7_47": 2109, "47_7": 2110, "7_54": 2111, "54_7": 2112, "7_32": 2113, "32_7": 2114, "23_6": 2115, "6_23": 2116, "74_29": 2117, "29_74": 2118, "5_17": 2119, "17_5": 2120, "58_23": 2121, "23_58": 2122, "25_48": 2123, "48_25": 2124, "3_37": 2125, "37_3": 2126, "54_3": 2127, "3_54": 2128, "10_61": 2129, "61_10": 2130, "3_68": 2131, "68_3": 2132, "21_10": 2133, "10_21": 2134, "49_59": 2135, "59_49": 2136, "32_28": 2137, "28_32": 2138, "42_49": 2139, "49_42": 2140, "44_56": 2141, "56_44": 2142, "48_47": 2143, "47_48": 2144, "48_67": 2145, "67_48": 2146, "57_65": 2147, "65_57": 2148, "27_26": 2149, "26_27": 2150, "27_59": 2151, "59_27": 2152, "58_58": 2153, "26_73": 2154, "73_26": 2155, "43_48": 2156, "48_43": 2157, "52_13": 2158, "13_52": 2159, "6_67": 2160, "67_6": 2161, "59_48": 2162, "48_59": 2163, "38_31": 2164, "31_38": 2165, "38_35": 2166, "35_38": 2167, "18_69": 2168, "69_18": 2169, "69_39": 2170, "39_69": 2171, "3_71": 2172, "71_3": 2173, "34_25": 2174, "25_34": 2175, "27_23": 2176, "23_27": 2177, "65_63": 2178, "63_65": 2179, "10_58": 2180, "47_28": 2181, "28_47": 2182, "48_56": 2183, "56_48": 2184, "48_42": 2185, "42_48": 2186, "3_55": 2187, "55_3": 2188, "8_23": 2189, "23_8": 2190, "29_43": 2191, "43_29": 2192, "29_55": 2193, "55_29": 2194, "20_19": 2195, "19_20": 2196, "55_59": 2197, "59_55": 2198, "64_9": 2199, "9_64": 2200, "58_24": 2201, "24_58": 2202, "38_73": 2203, "73_38": 2204, "38_3": 2205, "3_38": 2206, "43_26": 2207, "26_43": 2208, "36_70": 2209, "70_36": 2210, "36_46": 2211, "46_36": 2212, "36_72": 2213, "72_36": 2214, "29_23": 2215, "23_29": 2216, "3_39": 2217, "39_3": 2218, "19_29": 2219, "29_19": 2220, "62_62": 2221, "52_68": 2222, "68_52": 2223, "35_26": 2224, "26_35": 2225, "29_31": 2226, "31_29": 2227, "15_67": 2228, "67_15": 2229, "55_56": 2230, "56_55": 2231, "25_68": 2232, "68_25": 2233, "41_34": 2234, "34_41": 2235, "3_60": 2236, "60_3": 2237, "50_6": 2238, "6_50": 2239, "50_17": 2240, "17_50": 2241, "24_20": 2242, "20_24": 2243, "33_48": 2244, "48_33": 2245, "59_23": 2246, "23_59": 2247, "54_25": 2248, "25_54": 2249, "71_32": 2250, "32_71": 2251, "39_53": 2252, "53_39": 2253, "66_53": 2254, "53_66": 2255, "54_68": 2256, "68_54": 2257, "58_65": 2258, "65_58": 2259, "6_20": 2260, "20_6": 2261, "34_31": 2262, "31_34": 2263, "13_39": 2264, "39_13": 2265, "29_69": 2266, "69_29": 2267, "45_76": 2268, "76_45": 2269, "17_17": 2270, "55_63": 2271, "63_55": 2272, "66_39": 2273, "39_66": 2274, "15_25": 2275, "25_15": 2276, "37_26": 2277, "26_37": 2278, "39_36": 2279, "36_39": 2280, "35_56": 2281, "56_35": 2282, "40_54": 2283, "54_40": 2284, "52_16": 2285, "16_52": 2286, "34_16": 2287, "16_34": 2288, "67_56": 2289, "56_67": 2290, "67_60": 2291, "60_67": 2292, "67_63": 2293, "63_67": 2294, "45_28": 2295, "28_45": 2296, "8_27": 2297, "27_8": 2298, "6_59": 2299, "59_6": 2300, "5_27": 2301, "27_5": 2302, "14_14": 2303, "43_25": 2304, "25_43": 2305, "34_46": 2306, "46_34": 2307, "42_2": 2308, "2_42": 2309, "34_57": 2310, "57_34": 2311, "51_50": 2312, "50_51": 2313, "68_53": 2314, "53_68": 2315, "49_13": 2316, "13_49": 2317, "66_55": 2318, "55_66": 2319, "29_9": 2320, "9_29": 2321, "50_34": 2322, "34_50": 2323, "5_35": 2324, "35_5": 2325, "21_24": 2326, "24_21": 2327, "21_52": 2328, "52_21": 2329, "21_66": 2330, "66_21": 2331, "21_18": 2332, "18_21": 2333, "15_27": 2334, "27_15": 2335, "3_35": 2336, "35_3": 2337, "40_61": 2338, "61_40": 2339, "49_61": 2340, "61_49": 2341, "40_48": 2342, "48_40": 2343, "68_68": 2344, "54_13": 2345, "13_54": 2346, "57_40": 2347, "40_57": 2348, "8_34": 2349, "34_8": 2350, "45_16": 2351, "16_45": 2352, "66_6": 2353, "6_66": 2354, "29_72": 2355, "72_29": 2356, "59_41": 2357, "41_59": 2358, "8_61": 2359, "61_8": 2360, "72_16": 2361, "16_72": 2362, "28_73": 2363, "73_28": 2364, "63_63": 2365, "63_72": 2366, "72_63": 2367, "63_37": 2368, "37_63": 2369, "63_12": 2370, "12_63": 2371, "63_60": 2372, "60_63": 2373, "69_61": 2374, "61_69": 2375, "14_64": 2376, "64_14": 2377, "21_43": 2378, "43_21": 2379, "48_71": 2380, "71_48": 2381, "26_61": 2382, "61_26": 2383, "67_59": 2384, "59_67": 2385, "75_47": 2386, "47_75": 2387, "75_9": 2388, "9_75": 2389, "75_64": 2390, "64_75": 2391, "59_47": 2392, "47_59": 2393, "34_61": 2394, "61_34": 2395, "11_10": 2396, "10_11": 2397, "11_8": 2398, "8_11": 2399, "30_33": 2400, "33_30": 2401, "41_28": 2402, "28_41": 2403, "46_73": 2404, "73_46": 2405, "42_15": 2406, "15_42": 2407, "37_16": 2408, "16_37": 2409, "35_12": 2410, "12_35": 2411, "35_57": 2412, "57_35": 2413, "10_73": 2414, "73_10": 2415, "67_54": 2416, "54_67": 2417, "52_28": 2418, "28_52": 2419, "55_69": 2420, "69_55": 2421, "18_45": 2422, "45_18": 2423, "43_54": 2424, "54_43": 2425, "15_71": 2426, "71_15": 2427, "15_23": 2428, "23_15": 2429, "20_71": 2430, "71_20": 2431, "42_47": 2432, "47_42": 2433, "52_67": 2434, "67_52": 2435, "58_48": 2436, "48_58": 2437, "45_7": 2438, "7_45": 2439, "45_37": 2440, "37_45": 2441, "45_55": 2442, "55_45": 2443, "61_15": 2444, "15_61": 2445, "58_67": 2446, "67_58": 2447, "16_68": 2448, "68_16": 2449, "30_65": 2450, "65_30": 2451, "43_56": 2452, "56_43": 2453, "6_48": 2454, "48_6": 2455, "9_53": 2456, "53_9": 2457, "3_73": 2458, "73_3": 2459, "76_18": 2460, "18_76": 2461, "76_46": 2462, "46_76": 2463, "7_4": 2464, "4_7": 2465, "37_55": 2466, "55_37": 2467, "45_63": 2468, "63_45": 2469, "45_46": 2470, "46_45": 2471, "48_63": 2472, "63_48": 2473, "24_18": 2474, "18_24": 2475, "4_16": 2476, "16_4": 2477, "72_60": 2478, "60_72": 2479, "21_54": 2480, "54_21": 2481, "67_35": 2482, "35_67": 2483, "10_49": 2484, "10_17": 2485, "17_10": 2486, "10_23": 2487, "23_10": 2488, "60_4": 2489, "4_60": 2490, "18_46": 2491, "46_18": 2492, "45_27": 2493, "27_45": 2494, "66_42": 2495, "42_66": 2496, "13_50": 2497, "50_13": 2498, "30_66": 2499, "66_30": 2500, "46_14": 2501, "14_46": 2502, "59_73": 2503, "73_59": 2504, "52_5": 2505, "5_52": 2506, "19_28": 2507, "28_19": 2508, "18_74": 2509, "74_18": 2510, "5_34": 2511, "34_5": 2512, "36_5": 2513, "5_36": 2514, "37_44": 2515, "44_37": 2516, "37_40": 2517, "40_37": 2518, "37_50": 2519, "50_37": 2520, "70_55": 2521, "55_70": 2522, "54_46": 2523, "46_54": 2524, "8_55": 2525, "55_8": 2526, "74_39": 2527, "39_74": 2528, "54_61": 2529, "61_54": 2530, "61_53": 2531, "53_61": 2532, "23_18": 2533, "18_23": 2534, "21_29": 2535, "29_21": 2536, "18_5": 2537, "5_18": 2538, "68_73": 2539, "73_68": 2540, "66_46": 2541, "46_66": 2542, "6_73": 2543, "73_6": 2544, "32_19": 2545, "19_32": 2546, "45_9": 2547, "9_45": 2548, "33_54": 2549, "54_33": 2550, "15_32": 2551, "32_15": 2552, "43_69": 2553, "69_43": 2554, "30_21": 2555, "21_30": 2556, "54_18": 2557, "18_54": 2558, "41_31": 2559, "31_41": 2560, "6_7": 2561, "7_6": 2562, "49_35": 2563, "35_49": 2564, "21_8": 2565, "8_21": 2566, "21_57": 2567, "57_21": 2568, "54_19": 2569, "19_54": 2570, "57_30": 2571, "30_57": 2572, "6_37": 2573, "37_6": 2574, "3_2": 2575, "2_3": 2576, "49_17": 2577, "17_49": 2578, "29_17": 2579, "17_29": 2580, "74_65": 2581, "65_74": 2582, "58_42": 2583, "42_58": 2584, "73_4": 2585, "4_73": 2586, "27_47": 2587, "47_27": 2588, "32_73": 2589, "73_32": 2590, "57_37": 2591, "37_57": 2592, "32_35": 2593, "35_32": 2594, "38_48": 2595, "48_38": 2596, "57_27": 2597, "27_57": 2598, "57_5": 2599, "5_57": 2600, "57_36": 2601, "36_57": 2602, "18_3": 2603, "3_18": 2604, "39_46": 2605, "46_39": 2606, "43_53": 2607, "53_43": 2608, "65_23": 2609, "23_65": 2610, "52_60": 2611, "60_52": 2612, "59_16": 2613, "16_59": 2614, "15_16": 2615, "16_15": 2616, "32_13": 2617, "13_32": 2618, "43_49": 2619, "49_43": 2620, "19_19": 2621, "59_59": 2622, "9_66": 2623, "66_9": 2624, "52_10": 2625, "10_52": 2626, "28_15": 2627, "15_28": 2628, "48_32": 2629, "32_48": 2630, "48_66": 2631, "66_48": 2632, "58_4": 2633, "4_58": 2634, "49_9": 2635, "9_49": 2636, "50_22": 2637, "22_50": 2638, "33_53": 2639, "53_33": 2640, "29_47": 2641, "47_29": 2642, "44_70": 2643, "70_44": 2644, "4_25": 2645, "25_4": 2646, "29_10": 2647, "10_29": 2648, "34_72": 2649, "72_34": 2650, "36_66": 2651, "66_36": 2652, "57_13": 2653, "13_57": 2654, "5_67": 2655, "67_5": 2656, "28_34": 2657, "34_28": 2658, "8_37": 2659, "37_8": 2660, "6_57": 2661, "57_6": 2662, "23_57": 2663, "57_23": 2664, "15_57": 2665, "57_15": 2666, "30_31": 2667, "31_30": 2668, "49_56": 2669, "56_49": 2670, "54_35": 2671, "35_54": 2672, "48_57": 2673, "57_48": 2674, "71_57": 2675, "57_71": 2676, "59_57": 2677, "57_59": 2678, "59_63": 2679, "63_59": 2680, "73_57": 2681, "57_73": 2682, "54_47": 2683, "47_54": 2684, "54_71": 2685, "71_54": 2686, "20_57": 2687, "57_20": 2688, "54_69": 2689, "69_54": 2690, "42_32": 2691, "32_42": 2692, "25_57": 2693, "57_25": 2694, "34_56": 2695, "56_34": 2696, "6_56": 2697, "56_6": 2698, "54_44": 2699, "44_54": 2700, "74_24": 2701, "24_74": 2702, "74_8": 2703, "8_74": 2704, "15_74": 2705, "74_15": 2706, "10_8": 2707, "74_69": 2708, "69_74": 2709, "55_74": 2710, "74_55": 2711, "74_66": 2712, "66_74": 2713, "74_58": 2714, "58_74": 2715, "74_35": 2716, "35_74": 2717, "74_48": 2718, "48_74": 2719, "74_16": 2720, "16_74": 2721, "74_30": 2722, "30_74": 2723, "74_31": 2724, "31_74": 2725, "74_38": 2726, "38_74": 2727, "74_21": 2728, "21_74": 2729, "34_55": 2730, "55_34": 2731, "19_31": 2732, "31_19": 2733, "24_47": 2734, "47_24": 2735, "66_69": 2736, "69_66": 2737, "58_47": 2738, "47_58": 2739, "42_72": 2740, "72_42": 2741, "24_72": 2742, "72_24": 2743, "30_47": 2744, "47_30": 2745, "33_47": 2746, "47_33": 2747, "9_34": 2748, "34_9": 2749, "9_7": 2750, "7_9": 2751, "9_67": 2752, "67_9": 2753, "18_56": 2754, "56_18": 2755, "9_60": 2756, "60_9": 2757, "9_55": 2758, "55_9": 2759, "21_67": 2760, "67_21": 2761, "9_32": 2762, "32_9": 2763, "61_67": 2764, "67_61": 2765, "67_73": 2766, "73_67": 2767, "58_18": 2768, "18_58": 2769, "67_75": 2770, "75_67": 2771, "55_18": 2772, "18_55": 2773, "67_16": 2774, "16_67": 2775, "33_18": 2776, "18_33": 2777, "43_18": 2778, "18_43": 2779, "42_67": 2780, "67_42": 2781, "23_67": 2782, "67_23": 2783, "60_53": 2784, "53_60": 2785, "56_60": 2786, "60_56": 2787, "70_47": 2788, "47_70": 2789, "8_47": 2790, "47_8": 2791, "49_47": 2792, "47_49": 2793, "23_69": 2794, "69_23": 2795, "25_31": 2796, "31_25": 2797, "42_69": 2798, "69_42": 2799, "42_63": 2800, "63_42": 2801, "42_18": 2802, "18_42": 2803, "23_73": 2804, "73_23": 2805, "42_55": 2806, "55_42": 2807, "25_26": 2808, "26_25": 2809, "6_72": 2810, "72_6": 2811, "58_72": 2812, "72_58": 2813, "70_35": 2814, "35_70": 2815, "42_16": 2816, "16_42": 2817, "42_30": 2818, "30_42": 2819, "42_37": 2820, "37_42": 2821, "42_68": 2822, "68_42": 2823, "42_73": 2824, "73_42": 2825, "30_26": 2826, "26_30": 2827, "58_63": 2828, "63_58": 2829, "23_56": 2830, "56_23": 2831, "42_56": 2832, "56_42": 2833, "42_74": 2834, "74_42": 2835, "20_73": 2836, "73_20": 2837, "33_63": 2838, "63_33": 2839, "59_31": 2840, "31_59": 2841, "33_72": 2842, "72_33": 2843, "48_7": 2844, "7_48": 2845, "47_34": 2846, "34_47": 2847, "48_16": 2848, "16_48": 2849, "30_55": 2850, "55_30": 2851, "48_37": 2852, "37_48": 2853, "28_18": 2854, "18_28": 2855, "28_55": 2856, "55_28": 2857, "28_56": 2858, "56_28": 2859, "58_56": 2860, "56_58": 2861, "28_37": 2862, "37_28": 2863, "28_16": 2864, "16_28": 2865, "28_48": 2866, "48_28": 2867, "28_67": 2868, "67_28": 2869, "28_68": 2870, "68_28": 2871, "33_58": 2872, "58_33": 2873, "28_74": 2874, "74_28": 2875, "68_8": 2876, "8_68": 2877, "21_56": 2878, "56_21": 2879, "6_74": 2880, "74_6": 2881, "56_74": 2882, "74_56": 2883, "60_74": 2884, "74_60": 2885, "35_66": 2886, "66_35": 2887, "26_74": 2888, "74_26": 2889, "37_60": 2890, "60_37": 2891, "70_13": 2892, "13_70": 2893, "57_74": 2894, "74_57": 2895, "18_9": 2896, "9_18": 2897, "63_74": 2898, "74_63": 2899, "18_35": 2900, "35_18": 2901, "61_61": 2902, "55_72": 2903, "72_55": 2904, "59_74": 2905, "74_59": 2906, "70_74": 2907, "74_70": 2908, "37_74": 2909, "74_37": 2910, "32_74": 2911, "74_32": 2912, "56_45": 2913, "45_56": 2914, "33_31": 2915, "31_33": 2916, "63_9": 2917, "9_63": 2918, "45_73": 2919, "73_45": 2920, "47_45": 2921, "45_47": 2922, "18_71": 2923, "71_18": 2924, "43_8": 2925, "8_43": 2926, "72_13": 2927, "13_72": 2928, "21_21": 2929, "6_19": 2930, "19_6": 2931, "54_74": 2932, "74_54": 2933, "20_67": 2934, "67_20": 2935, "18_13": 2936, "13_18": 2937, "50_74": 2938, "74_50": 2939, "56_33": 2940, "33_56": 2941, "18_60": 2942, "60_18": 2943, "63_73": 2944, "73_63": 2945, "47_9": 2946, "9_47": 2947, "43_74": 2948, "74_43": 2949, "49_69": 2950, "69_49": 2951, "49_60": 2952, "60_49": 2953, "34_6": 2954, "6_34": 2955, "33_32": 2956, "32_33": 2957, "71_43": 2958, "43_71": 2959, "67_19": 2960, "19_67": 2961, "32_51": 2962, "51_32": 2963, "12_60": 2964, "60_12": 2965, "12_43": 2966, "43_12": 2967, "8_28": 2968, "28_8": 2969, "12_18": 2970, "18_12": 2971, "8_51": 2972, "51_8": 2973, "66_51": 2974, "51_66": 2975, "8_56": 2976, "56_8": 2977, "16_51": 2978, "51_16": 2979, "30_51": 2980, "51_30": 2981, "66_28": 2982, "28_66": 2983, "12_71": 2984, "71_12": 2985, "12_59": 2986, "59_12": 2987, "70_51": 2988, "51_70": 2989, "68_51": 2990, "51_68": 2991, "12_69": 2992, "69_12": 2993, "12_26": 2994, "26_12": 2995, "70_28": 2996, "28_70": 2997, "51_63": 2998, "63_51": 2999, "68_31": 3000, "31_68": 3001, "12_61": 3002, "61_12": 3003, "12_68": 3004, "68_12": 3005, "17_67": 3006, "67_17": 3007, "6_51": 3008, "51_6": 3009, "54_51": 3010, "51_54": 3011, "33_29": 3012, "29_33": 3013, "23_34": 3014, "34_23": 3015, "21_31": 3016, "31_21": 3017, "30_56": 3018, "56_30": 3019, "13_63": 3020, "63_13": 3021, "23_16": 3022, "16_23": 3023, "8_6": 3024, "6_8": 3025, "8_20": 3026, "20_8": 3027, "13_66": 3028, "66_13": 3029, "21_25": 3030, "25_21": 3031, "25_29": 3032, "29_25": 3033, "43_6": 3034, "6_43": 3035, "25_74": 3036, "74_25": 3037, "9_48": 3038, "48_9": 3039, "21_6": 3040, "6_21": 3041, "21_23": 3042, "23_21": 3043, "32_23": 3044, "23_32": 3045, "25_59": 3046, "59_25": 3047, "42_29": 3048, "29_42": 3049, "42_8": 3050, "8_42": 3051, "42_23": 3052, "23_42": 3053, "67_13": 3054, "13_67": 3055, "13_23": 3056, "23_13": 3057, "12_33": 3058, "33_12": 3059, "12_5": 3060, "5_12": 3061, "38_12": 3062, "12_38": 3063, "68_21": 3064, "21_68": 3065, "32_21": 3066, "21_32": 3067, "59_7": 3068, "7_59": 3069, "59_58": 3070, "58_59": 3071, "25_52": 3072, "52_25": 3073, "42_52": 3074, "52_42": 3075, "59_66": 3076, "66_59": 3077, "6_52": 3078, "52_6": 3079, "58_21": 3080, "21_58": 3081, "16_53": 3082, "53_16": 3083, "72_76": 3084, "76_72": 3085, "76_9": 3086, "9_76": 3087, "76_76": 3088, "76_26": 3089, "26_76": 3090, "46_9": 3091, "9_46": 3092, "76_24": 3093, "24_76": 3094, "26_9": 3095, "9_26": 3096, "76_48": 3097, "48_76": 3098, "76_5": 3099, "5_76": 3100, "76_38": 3101, "38_76": 3102, "76_65": 3103, "65_76": 3104, "76_17": 3105, "17_76": 3106, "76_16": 3107, "16_76": 3108, "76_6": 3109, "6_76": 3110, "24_7": 3111, "7_24": 3112, "76_55": 3113, "55_76": 3114, "76_47": 3115, "47_76": 3116, "8_9": 3117, "9_8": 3118, "76_51": 3119, "51_76": 3120, "34_64": 3121, "64_34": 3122, "76_27": 3123, "27_76": 3124, "21_9": 3125, "9_21": 3126, "9_30": 3127, "30_9": 3128, "42_9": 3129, "9_42": 3130, "58_9": 3131, "9_58": 3132, "70_9": 3133, "9_70": 3134, "51_61": 3135, "61_51": 3136, "25_61": 3137, "61_25": 3138, "8_19": 3139, "19_8": 3140, "66_61": 3141, "61_66": 3142, "8_5": 3143, "5_8": 3144, "8_38": 3145, "38_8": 3146, "25_72": 3147, "72_25": 3148, "6_12": 3149, "12_6": 3150, "15_12": 3151, "12_15": 3152, "66_19": 3153, "19_66": 3154, "30_61": 3155, "61_30": 3156, "43_61": 3157, "61_43": 3158, "59_61": 3159, "61_59": 3160, "34_7": 3161, "7_34": 3162, "73_61": 3163, "61_73": 3164, "48_61": 3165, "61_48": 3166, "19_61": 3167, "61_19": 3168, "19_57": 3169, "57_19": 3170, "19_52": 3171, "52_19": 3172, "19_42": 3173, "42_19": 3174, "19_7": 3175, "7_19": 3176, "19_48": 3177, "48_19": 3178, "19_26": 3179, "26_19": 3180, "19_16": 3181, "16_19": 3182, "11_11": 3183, "71_11": 3184, "11_71": 3185, "11_24": 3186, "24_11": 3187, "11_29": 3188, "29_11": 3189, "11_65": 3190, "65_11": 3191, "23_11": 3192, "11_23": 3193, "48_11": 3194, "11_48": 3195, "32_11": 3196, "11_32": 3197, "49_65": 3198, "65_49": 3199, "11_49": 3200, "49_11": 3201, "11_66": 3202, "66_11": 3203, "11_6": 3204, "6_11": 3205, "59_71": 3206, "71_59": 3207, "11_15": 3208, "15_11": 3209, "11_61": 3210, "61_11": 3211, "33_11": 3212, "11_33": 3213, "11_13": 3214, "13_11": 3215, "11_59": 3216, "59_11": 3217, "11_68": 3218, "68_11": 3219, "11_42": 3220, "42_11": 3221, "11_34": 3222, "34_11": 3223, "11_26": 3224, "26_11": 3225, "11_4": 3226, "4_11": 3227, "54_11": 3228, "11_54": 3229, "41_68": 3230, "68_41": 3231, "41_70": 3232, "70_41": 3233, "41_29": 3234, "29_41": 3235, "32_41": 3236, "41_32": 3237, "43_41": 3238, "41_43": 3239, "48_23": 3240, "23_48": 3241, "48_2": 3242, "2_48": 3243, "41_15": 3244, "15_41": 3245, "41_48": 3246, "48_41": 3247, "41_58": 3248, "58_41": 3249, "43_13": 3250, "13_43": 3251, "4_41": 3252, "41_4": 3253, "41_72": 3254, "72_41": 3255, "41_26": 3256, "26_41": 3257, "41_53": 3258, "53_41": 3259, "41_24": 3260, "24_41": 3261, "2_24": 3262, "24_2": 3263, "32_59": 3264, "59_32": 3265, "2_34": 3266, "34_2": 3267, "2_14": 3268, "14_2": 3269, "42_34": 3270, "34_42": 3271, "42_41": 3272, "41_42": 3273, "6_2": 3274, "2_6": 3275, "41_3": 3276, "3_41": 3277, "28_71": 3278, "71_28": 3279, "20_23": 3280, "23_20": 3281, "20_49": 3282, "49_20": 3283, "38_71": 3284, "71_38": 3285, "71_74": 3286, "74_71": 3287, "33_71": 3288, "71_33": 3289, "14_70": 3290, "70_14": 3291, "19_50": 3292, "50_19": 3293, "14_23": 3294, "23_14": 3295, "14_24": 3296, "24_14": 3297, "14_19": 3298, "19_14": 3299, "38_19": 3300, "19_38": 3301, "14_61": 3302, "61_14": 3303, "19_13": 3304, "13_19": 3305, "14_13": 3306, "13_14": 3307, "19_59": 3308, "59_19": 3309, "14_49": 3310, "49_14": 3311, "58_69": 3312, "69_58": 3313, "15_68": 3314, "68_15": 3315, "33_67": 3316, "67_33": 3317, "13_53": 3318, "53_13": 3319, "44_52": 3320, "52_44": 3321, "50_16": 3322, "16_50": 3323, "48_22": 3324, "22_48": 3325, "66_22": 3326, "22_66": 3327, "49_22": 3328, "22_49": 3329, "8_22": 3330, "22_8": 3331, "15_22": 3332, "22_15": 3333, "58_46": 3334, "46_58": 3335, "22_45": 3336, "45_22": 3337, "24_22": 3338, "22_24": 3339, "72_68": 3340, "68_72": 3341, "22_68": 3342, "68_22": 3343, "22_42": 3344, "42_22": 3345, "22_71": 3346, "71_22": 3347, "22_16": 3348, "16_22": 3349, "23_22": 3350, "22_23": 3351, "22_5": 3352, "5_22": 3353, "34_22": 3354, "22_34": 3355, "4_22": 3356, "22_4": 3357, "43_68": 3358, "68_43": 3359, "22_32": 3360, "32_22": 3361, "22_10": 3362, "10_22": 3363, "22_29": 3364, "29_22": 3365, "62_11": 3366, "11_62": 3367, "48_17": 3368, "17_48": 3369, "36_48": 3370, "48_36": 3371, "30_2": 3372, "2_30": 3373, "71_14": 3374, "14_71": 3375, "2_26": 3376, "26_2": 3377, "62_69": 3378, "69_62": 3379, "62_17": 3380, "17_62": 3381, "36_34": 3382, "34_36": 3383, "36_29": 3384, "29_36": 3385, "64_16": 3386, "16_64": 3387, "2_67": 3388, "67_2": 3389, "2_72": 3390, "72_2": 3391, "2_31": 3392, "31_2": 3393, "2_55": 3394, "55_2": 3395, "2_19": 3396, "19_2": 3397, "2_8": 3398, "8_2": 3399, "2_69": 3400, "69_2": 3401, "2_38": 3402, "38_2": 3403, "2_18": 3404, "18_2": 3405, "2_32": 3406, "32_2": 3407, "2_66": 3408, "66_2": 3409, "13_9": 3410, "9_13": 3411, "60_73": 3412, "73_60": 3413, "2_5": 3414, "5_2": 3415, "71_51": 3416, "51_71": 3417, "71_21": 3418, "21_71": 3419, "62_70": 3420, "70_62": 3421, "36_67": 3422, "67_36": 3423, "36_6": 3424, "6_36": 3425, "23_66": 3426, "66_23": 3427, "2_61": 3428, "61_2": 3429, "2_53": 3430, "53_2": 3431, "2_59": 3432, "59_2": 3433, "2_68": 3434, "68_2": 3435, "71_69": 3436, "69_71": 3437, "46_2": 3438, "2_46": 3439, "71_16": 3440, "16_71": 3441, "71_56": 3442, "56_71": 3443, "36_49": 3444, "49_36": 3445, "71_45": 3446, "45_71": 3447, "2_65": 3448, "65_2": 3449, "2_21": 3450, "21_2": 3451, "2_33": 3452, "33_2": 3453, "2_56": 3454, "56_2": 3455, "2_47": 3456, "47_2": 3457, "2_60": 3458, 