{"PAD": 0, "DUMMY_START_RELATION": 1, "UNK": 2, "49_41": 3, "27_35": 4, "49_35": 5, "4_34": 6, "34_35": 7, "49_44": 8, "39_34": 9, "4_28": 10, "49_28": 11, "49_36": 12, "14_35": 13, "49_34": 14, "4_29": 15, "4_35": 16, "39_9": 17, "49_6": 18, "4_6": 19, "6_6": 20, "22_35": 21, "49_24": 22, "33_28": 23, "6_28": 24, "49_42": 25, "33_35": 26, "4_42": 27, "39_38": 28, "42_35": 29, "36_35": 30, "8_6": 31, "49_23": 32, "39_35": 33, "4_48": 34, "49_31": 35, "49_11": 36, "49_38": 37, "4_8": 38, "9_28": 39, "29_29": 40, "49_8": 41, "49_3": 42, "2_8": 43, "42_42": 44, "39_6": 45, "20_28": 46, "27_23": 47, "26_28": 48, "3_35": 49, "49_47": 50, "27_44": 51, "39_8": 52, "20_35": 53, "30_31": 54, "36_3": 55, "49_2": 56, "48_8": 57, "49_30": 58, "27_28": 59, "49_9": 60, "34_34": 61, "9_44": 62, "30_30": 63, "33_36": 64, "49_33": 65, "4_41": 66, "30_35": 67, "39_39": 68, "45_35": 69, "12_35": 70, "11_11": 71, "49_32": 72, "39_28": 73, "31_31": 74, "49_26": 75, "35_35": 76, "4_32": 77, "8_35": 78, "39_48": 79, "49_46": 80, "33_44": 81, "49_27": 82, "38_38": 83, "4_11": 84, "36_36": 85, "36_41": 86, "28_35": 87, "13_24": 88, "4_40": 89, "4_24": 90, "14_28": 91, "49_12": 92, "49_29": 93, "29_35": 94, "49_22": 95, "2_44": 96, "44_35": 97, "4_44": 98, "27_30": 99, "14_44": 100, "32_34": 101, "32_38": 102, "6_35": 103, "27_42": 104, "49_19": 105, "27_3": 106, "34_8": 107, "49_18": 108, "4_31": 109, "40_35": 110, "3_8": 111, "42_34": 112, "32_35": 113, "26_44": 114, "3_44": 115, "12_28": 116, "31_38": 117, "39_36": 118, "32_8": 119, "12_34": 120, "28_28": 121, "12_8": 122, "6_40": 123, "9_35": 124, "32_40": 125, "45_38": 126, "39_42": 127, "26_26": 128, "16_8": 129, "32_6": 130, "38_49": 131, "40_32": 132, "27_25": 133, "25_27": 134, "8_8": 135, "26_18": 136, "18_26": 137, "20_22": 138, "22_20": 139, "20_18": 140, "18_20": 141, "38_40": 142, "40_38": 143, "38_12": 144, "12_38": 145, "9_19": 146, "19_9": 147, "28_43": 148, "43_28": 149, "26_22": 150, "22_26": 151, "16_29": 152, "29_16": 153, "16_32": 154, "32_16": 155, "32_11": 156, "11_32": 157, "35_34": 158, "27_49": 159, "3_49": 160, "26_49": 161, "24_28": 162, "28_24": 163, "38_8": 164, "8_38": 165, "29_38": 166, "38_29": 167, "38_32": 168, "32_32": 169, "8_34": 170, "34_28": 171, "28_34": 172, "34_42": 173, "35_42": 174, "25_25": 175, "33_16": 176, "16_33": 177, "32_28": 178, "28_32": 179, "42_30": 180, "30_42": 181, "3_40": 182, "40_3": 183, "14_49": 184, "49_14": 185, "44_14": 186, "10_10": 187, "4_38": 188, "38_4": 189, "8_32": 190, "8_48": 191, "29_41": 192, "41_29": 193, "27_27": 194, "9_49": 195, "27_33": 196, "33_27": 197, "42_49": 198, "36_49": 199, "41_4": 200, "34_4": 201, "35_4": 202, "4_47": 203, "47_4": 204, "34_32": 205, "3_12": 206, "12_3": 207, "11_3": 208, "3_11": 209, "27_16": 210, "16_27": 211, "33_49": 212, "9_24": 213, "24_9": 214, "9_22": 215, "22_9": 216, "26_42": 217, "42_26": 218, "30_49": 219, "32_48": 220, "48_32": 221, "31_27": 222, "27_31": 223, "31_8": 224, "8_31": 225, "31_9": 226, "9_31": 227, "31_44": 228, "44_31": 229, "31_16": 230, "16_31": 231, "8_16": 232, "11_33": 233, "33_11": 234, "44_49": 235, "34_49": 236, "15_15": 237, "32_24": 238, "24_32": 239, "48_48": 240, "32_49": 241, "24_50": 242, "50_24": 243, "24_15": 244, "15_24": 245, "41_36": 246, "20_27": 247, "27_20": 248, "35_38": 249, "38_35": 250, "49_4": 251, "4_49": 252, "34_3": 253, "3_34": 254, "40_40": 255, "28_49": 256, "28_18": 257, "18_28": 258, "35_28": 259, "35_30": 260, "35_6": 261, "44_44": 262, "35_44": 263, "36_29": 264, "29_36": 265, "26_27": 266, "27_26": 267, "20_33": 268, "33_20": 269, "27_4": 270, "4_27": 271, "35_49": 272, "9_36": 273, "36_9": 274, "48_38": 275, "38_48": 276, "20_2": 277, "2_20": 278, "6_39": 279, "39_32": 280, "32_39": 281, "11_38": 282, "38_11": 283, "12_32": 284, "32_12": 285, "35_36": 286, "35_8": 287, "35_43": 288, "43_35": 289, "35_27": 290, "35_41": 291, "41_35": 292, "35_7": 293, "7_35": 294, "34_41": 295, "41_34": 296, "28_23": 297, "23_28": 298, "28_6": 299, "26_38": 300, "38_26": 301, "28_5": 302, "5_28": 303, "33_12": 304, "12_33": 305, "29_49": 306, "35_29": 307, "29_7": 308, "7_29": 309, "41_49": 310, "22_34": 311, "34_22": 312, "8_28": 313, "28_8": 314, "8_24": 315, "24_8": 316, "28_33": 317, "30_27": 318, "49_49": 319, "38_34": 320, "34_38": 321, "42_22": 322, "22_42": 323, "35_9": 324, "28_9": 325, "24_19": 326, "19_24": 327, "27_5": 328, "5_27": 329, "36_27": 330, "27_36": 331, "27_6": 332, "6_27": 333, "40_48": 334, "48_40": 335, "20_9": 336, "9_20": 337, "9_18": 338, "18_9": 339, "6_49": 340, "28_30": 341, "30_28": 342, "13_13": 343, "3_18": 344, "18_3": 345, "16_10": 346, "10_16": 347, "16_16": 348, "23_33": 349, "33_23": 350, "28_25": 351, "25_28": 352, "8_4": 353, "29_30": 354, "30_29": 355, "29_32": 356, "32_29": 357, "15_12": 358, "12_15": 359, "15_36": 360, "36_15": 361, "15_6": 362, "6_15": 363, "15_34": 364, "34_15": 365, "15_32": 366, "32_15": 367, "15_19": 368, "19_15": 369, "31_49": 370, "34_30": 371, "30_34": 372, "34_48": 373, "48_34": 374, "34_16": 375, "16_34": 376, "34_40": 377, "40_34": 378, "34_6": 379, "6_34": 380, "34_39": 381, "36_30": 382, "30_36": 383, "35_12": 384, "35_47": 385, "47_35": 386, "44_23": 387, "23_44": 388, "16_30": 389, "30_16": 390, "33_33": 391, "44_8": 392, "8_44": 393, "6_38": 394, "38_6": 395, "6_32": 396, "6_8": 397, "36_33": 398, "27_22": 399, "22_27": 400, "45_27": 401, "27_45": 402, "28_16": 403, "16_28": 404, "35_39": 405, "13_28": 406, "28_13": 407, "8_47": 408, "47_8": 409, "8_29": 410, "29_8": 411, "8_49": 412, "14_40": 413, "40_14": 414, "44_38": 415, "38_44": 416, "49_7": 417, "7_49": 418, "44_27": 419, "44_18": 420, "18_44": 421, "36_40": 422, "40_36": 423, "41_32": 424, "32_41": 425, "41_41": 426, "41_38": 427, "38_41": 428, "9_4": 429, "4_9": 430, "4_4": 431, "25_12": 432, "12_25": 433, "6_4": 434, "36_38": 435, "38_36": 436, "44_9": 437, "42_3": 438, "3_42": 439, "42_25": 440, "25_42": 441, "28_27": 442, "32_31": 443, "31_32": 444, "40_6": 445, "47_47": 446, "7_7": 447, "20_36": 448, "36_20": 449, "35_20": 450, "8_21": 451, "21_8": 452, "23_36": 453, "36_23": 454, "44_42": 455, "42_44": 456, "44_47": 457, "47_44": 458, "30_3": 459, "3_30": 460, "7_38": 461, "38_7": 462, "36_6": 463, "6_36": 464, "42_6": 465, "6_42": 466, "33_9": 467, "9_33": 468, "31_4": 469, "34_27": 470, "27_34": 471, "41_7": 472, "7_41": 473, "40_10": 474, "10_40": 475, "33_24": 476, "24_33": 477, "4_33": 478, "33_4": 479, "36_13": 480, "13_36": 481, "11_47": 482, "47_11": 483, "23_8": 484, "8_23": 485, "27_9": 486, "9_27": 487, "32_47": 488, "47_32": 489, "9_30": 490, "30_9": 491, "40_47": 492, "47_40": 493, "26_13": 494, "13_26": 495, "27_2": 496, "2_27": 497, "42_36": 498, "36_42": 499, "42_9": 500, "9_42": 501, "27_48": 502, "48_27": 503, "33_18": 504, "18_33": 505, "36_24": 506, "24_36": 507, "24_38": 508, "38_24": 509, "24_24": 510, "38_31": 511, "36_28": 512, "28_36": 513, "36_31": 514, "31_36": 515, "3_31": 516, "31_3": 517, "37_12": 518, "12_37": 519, "34_5": 520, "5_34": 521, "34_29": 522, "29_34": 523, "20_23": 524, "23_20": 525, "8_41": 526, "41_8": 527, "33_50": 528, "50_33": 529, "33_15": 530, "15_33": 531, "19_34": 532, "34_19": 533, "29_22": 534, "22_29": 535, "40_8": 536, "8_40": 537, "32_4": 538, "34_36": 539, "36_34": 540, "24_42": 541, "42_24": 542, "25_8": 543, "8_25": 544, "46_12": 545, "12_46": 546, "46_24": 547, "24_46": 548, "42_33": 549, "33_42": 550, "34_12": 551, "2_36": 552, "36_2": 553, "33_22": 554, "22_33": 555, "23_9": 556, "9_23": 557, "16_38": 558, "38_16": 559, "48_25": 560, "25_48": 561, "44_24": 562, "24_44": 563, "27_29": 564, "29_27": 565, "8_12": 566, "30_38": 567, "38_30": 568, "14_8": 569, "8_14": 570, "30_45": 571, "45_30": 572, "33_31": 573, "31_33": 574, "2_41": 575, "41_2": 576, "27_47": 577, "47_27": 578, "34_24": 579, "24_34": 580, "16_41": 581, "41_16": 582, "35_33": 583, "16_48": 584, "48_16": 585, "35_32": 586, "21_21": 587, "48_12": 588, "12_48": 589, "33_30": 590, "30_33": 591, "29_47": 592, "47_29": 593, "28_29": 594, "29_28": 595, "27_8": 596, "8_27": 597, "16_35": 598, "35_16": 599, "44_29": 600, "29_44": 601, "40_4": 602, "28_26": 603, "16_40": 604, "40_16": 605, "8_9": 606, "9_8": 607, "29_40": 608, "40_29": 609, "20_49": 610, "49_20": 611, "45_11": 612, "11_45": 613, "33_8": 614, "8_33": 615, "23_49": 616, "31_34": 617, "34_31": 618, "30_32": 619, "32_30": 620, "5_22": 621, "22_5": 622, "27_32": 623, "32_27": 624, "18_38": 625, "38_18": 626, "34_33": 627, "33_34": 628, "34_50": 629, "50_34": 630, "9_9": 631, "16_49": 632, "49_16": 633, "37_34": 634, "34_37": 635, "28_12": 636, "42_27": 637, "28_19": 638, "19_28": 639, "3_22": 640, "22_3": 641, "12_40": 642, "40_12": 643, "12_41": 644, "41_12": 645, "38_39": 646, "8_39": 647, "15_17": 648, "17_15": 649, "35_14": 650, "10_29": 651, "29_10": 652, "44_2": 653, "9_43": 654, "43_9": 655, "44_26": 656, "2_2": 657, "18_12": 658, "12_18": 659, "45_5": 660, "5_45": 661, "9_50": 662, "50_9": 663, "3_3": 664, "45_33": 665, "33_45": 666, "42_4": 667, "3_41": 668, "41_3": 669, "5_12": 670, "12_5": 671, "45_22": 672, "22_45": 673, "15_23": 674, "23_15": 675, "24_13": 676, "34_10": 677, "10_34": 678, "32_25": 679, "25_32": 680, "40_41": 681, "41_40": 682, "42_20": 683, "20_42": 684, "4_39": 685, "39_4": 686, "20_4": 687, "4_20": 688, "26_30": 689, "30_26": 690, "16_12": 691, "12_16": 692, "4_7": 693, "7_4": 694, "28_4": 695, "24_49": 696, "26_23": 697, "23_26": 698, "36_5": 699, "5_36": 700, "24_12": 701, "12_24": 702, "28_3": 703, "3_28": 704, "24_40": 705, "40_24": 706, "36_18": 707, "18_36": 708, "4_19": 709, "19_4": 710, "12_12": 711, "4_3": 712, "3_4": 713, "4_2": 714, "2_4": 715, "33_17": 716, "17_33": 717, "44_43": 718, "43_44": 719, "8_30": 720, "30_8": 721, "21_9": 722, "9_21": 723, "21_32": 724, "32_21": 725, "24_23": 726, "23_24": 727, "3_36": 728, "8_22": 729, "22_8": 730, "36_7": 731, "7_36": 732, "7_6": 733, "6_7": 734, "44_13": 735, "13_44": 736, "13_23": 737, "23_13": 738, "23_27": 739, "26_20": 740, "20_26": 741, "34_23": 742, "23_34": 743, "35_11": 744, "11_35": 745, "35_40": 746, "35_10": 747, "10_35": 748, "35_31": 749, "31_35": 750, "9_38": 751, "38_9": 752, "13_27": 753, "27_13": 754, "41_18": 755, "18_41": 756, "42_19": 757, "19_42": 758, "12_49": 759, "12_4": 760, "4_12": 761, "38_3": 762, "3_38": 763, "19_49": 764, "33_3": 765, "3_33": 766, "9_3": 767, "3_9": 768, "19_19": 769, "39_47": 770, "47_39": 771, "10_38": 772, "38_10": 773, "10_32": 774, "32_10": 775, "31_14": 776, "14_31": 777, "45_29": 778, "29_45": 779, "3_43": 780, "43_3": 781, "32_7": 782, "7_32": 783, "44_36": 784, "36_44": 785, "42_28": 786, "28_42": 787, "28_38": 788, "38_28": 789, "35_26": 790, "26_35": 791, "41_33": 792, "33_41": 793, "41_47": 794, "47_41": 795, "21_16": 796, "16_21": 797, "29_11": 798, "11_29": 799, "42_16": 800, "16_42": 801, "27_43": 802, "43_27": 803, "24_3": 804, "3_24": 805, "28_20": 806, "15_50": 807, "50_15": 808, "27_12": 809, "12_27": 810, "11_31": 811, "31_11": 812, "14_9": 813, "9_14": 814, "45_6": 815, "6_45": 816, "27_18": 817, "18_27": 818, "24_41": 819, "41_24": 820, "26_36": 821, "36_26": 822, "29_3": 823, "3_29": 824, "48_37": 825, "37_48": 826, "8_10": 827, "10_8": 828, "11_10": 829, "10_11": 830, "8_3": 831, "4_26": 832, "26_4": 833, "26_24": 834, "24_26": 835, "44_32": 836, "32_44": 837, "49_50": 838, "50_49": 839, "2_38": 840, "38_2": 841, "2_3": 842, "3_2": 843, "2_30": 844, "30_2": 845, "11_41": 846, "41_11": 847, "11_8": 848, "8_11": 849, "11_49": 850, "3_27": 851, "36_43": 852, "43_36": 853, "48_28": 854, "28_48": 855, "35_19": 856, "19_35": 857, "40_33": 858, "33_40": 859, "21_38": 860, "38_21": 861, "41_15": 862, "15_41": 863, "4_30": 864, "30_4": 865, "12_19": 866, "19_12": 867, "31_6": 868, "6_31": 869, "42_18": 870, "18_42": 871, "42_40": 872, "40_42": 873, "9_26": 874, "26_9": 875, "34_9": 876, "9_34": 877, "38_45": 878, "23_23": 879, "20_24": 880, "24_20": 881, "10_33": 882, "33_10": 883, "42_29": 884, "29_42": 885, "23_38": 886, "38_23": 887, "3_32": 888, "32_3": 889, "28_15": 890, "15_28": 891, "49_40": 892, "40_49": 893, "15_40": 894, "40_15": 895, "25_18": 896, "18_25": 897, "35_3": 898, "41_10": 899, "10_41": 900, "2_33": 901, "33_2": 902, "44_12": 903, "12_44": 904, "41_9": 905, "9_41": 906, "8_26": 907, "26_8": 908, "49_48": 909, "48_49": 910, "42_38": 911, "38_42": 912, "3_50": 913, "50_3": 914, "2_18": 915, "18_2": 916, "39_29": 917, "29_39": 918, "27_39": 919, "39_27": 920, "36_47": 921, "47_36": 922, "31_29": 923, "29_31": 924, "3_19": 925, "19_3": 926, "27_41": 927, "41_27": 928, "36_22": 929, "22_36": 930, "9_45": 931, "45_9": 932, "41_23": 933, "23_41": 934, "27_38": 935, "38_27": 936, "9_16": 937, "16_9": 938, "20_29": 939, "29_20": 940, "19_18": 941, "18_19": 942, "33_7": 943, "7_33": 944, "44_33": 945, "43_43": 946, "36_19": 947, "19_36": 948, "34_44": 949, "44_34": 950, "11_40": 951, "40_11": 952, "9_6": 953, "6_9": 954, "14_14": 955, "16_19": 956, "19_16": 957, "29_18": 958, "18_29": 959, "48_3": 960, "3_48": 961, "48_2": 962, "2_48": 963, "48_24": 964, "24_48": 965, "24_30": 966, "30_24": 967, "28_40": 968, "40_28": 969, "16_25": 970, "25_16": 971, "29_4": 972, "48_22": 973, "22_48": 974, "2_49": 975, "29_33": 976, "33_29": 977, "18_18": 978, "31_41": 979, "41_31": 980, "16_11": 981, "11_16": 982, "38_47": 983, "47_38": 984, "20_43": 985, "43_20": 986, "28_22": 987, "22_28": 988, "46_16": 989, "16_46": 990, "33_6": 991, "6_33": 992, "13_9": 993, "9_13": 994, "20_38": 995, "38_20": 996, "42_8": 997, "8_42": 998, "36_50": 999, "50_36": 1000, "16_6": 1001, "6_16": 1002, "7_31": 1003, "31_7": 1004, "32_42": 1005, "42_32": 1006, "33_38": 1007, "38_33": 1008, "44_30": 1009, "30_44": 1010, "7_30": 1011, "30_7": 1012, "49_13": 1013, "13_49": 1014, "24_43": 1015, "43_24": 1016, "6_22": 1017, "22_6": 1018, "10_12": 1019, "12_10": 1020, "36_8": 1021, "8_36": 1022, "16_18": 1023, "18_16": 1024, "42_12": 1025, "12_42": 1026, "29_12": 1027, "12_29": 1028, "38_5": 1029, "5_38": 1030, "13_15": 1031, "15_13": 1032, "29_6": 1033, "6_29": 1034, "9_15": 1035, "15_9": 1036, "22_49": 1037, "45_49": 1038, "49_45": 1039, "15_27": 1040, "27_15": 1041, "34_13": 1042, "13_34": 1043, "9_2": 1044, "2_9": 1045, "39_45": 1046, "45_39": 1047, "30_18": 1048, "18_30": 1049, "42_31": 1050, "31_42": 1051, "44_4": 1052, "13_22": 1053, "22_13": 1054, "42_47": 1055, "47_42": 1056, "24_27": 1057, "27_24": 1058, "24_4": 1059, "49_39": 1060, "39_49": 1061, "24_16": 1062, "16_24": 1063, "34_26": 1064, "26_34": 1065, "44_3": 1066, "9_40": 1067, "40_9": 1068, "26_6": 1069, "6_26": 1070, "7_3": 1071, "3_7": 1072, "13_12": 1073, "12_13": 1074, "26_3": 1075, "3_26": 1076, "44_41": 1077, "41_44": 1078, "18_49": 1079, "14_23": 1080, "23_14": 1081, "20_31": 1082, "31_20": 1083, "20_16": 1084, "16_20": 1085, "28_41": 1086, "41_28": 1087, "28_31": 1088, "31_28": 1089, "44_28": 1090, "28_44": 1091, "44_11": 1092, "11_44": 1093, "22_38": 1094, "38_22": 1095, "26_33": 1096, "33_26": 1097, "14_38": 1098, "38_14": 1099, "4_14": 1100, "14_4": 1101, "48_39": 1102, "42_39": 1103, "40_30": 1104, "30_40": 1105, "33_19": 1106, "19_33": 1107, "13_40": 1108, "40_13": 1109, "34_45": 1110, "45_34": 1111, "41_6": 1112, "6_41": 1113, "24_6": 1114, "6_24": 1115, "34_18": 1116, "18_34": 1117, "34_11": 1118, "11_34": 1119, "9_32": 1120, "32_9": 1121, "27_19": 1122, "19_27": 1123, "41_30": 1124, "30_41": 1125, "8_7": 1126, "7_8": 1127, "7_20": 1128, "20_7": 1129, "7_40": 1130, "40_7": 1131, "7_47": 1132, "47_7": 1133, "20_30": 1134, "30_20": 1135, "14_6": 1136, "6_14": 1137, "31_30": 1138, "2_28": 1139, "28_2": 1140, "20_11": 1141, "11_20": 1142, "36_14": 1143, "14_36": 1144, "30_5": 1145, "5_30": 1146, "50_50": 1147, "22_32": 1148, "32_22": 1149, "2_32": 1150, "32_2": 1151, "19_30": 1152, "30_19": 1153, "45_45": 1154, "43_38": 1155, "38_43": 1156, "43_34": 1157, "34_43": 1158, "22_18": 1159, "18_22": 1160, "42_41": 1161, "41_42": 1162, "34_47": 1163, "47_34": 1164, "27_7": 1165, "7_27": 1166, "42_23": 1167, "23_42": 1168, "9_47": 1169, "47_9": 1170, "4_45": 1171, "45_4": 1172, "46_49": 1173, "7_2": 1174, "2_7": 1175, "6_13": 1176, "13_6": 1177, "35_18": 1178, "18_35": 1179, "4_23": 1180, "23_4": 1181, "45_18": 1182, "18_45": 1183, "48_18": 1184, "18_48": 1185, "8_5": 1186, "5_8": 1187, "8_18": 1188, "18_8": 1189, "31_13": 1190, "13_31": 1191, "37_32": 1192, "32_37": 1193, "13_4": 1194, "4_13": 1195, "4_36": 1196, "36_4": 1197, "13_43": 1198, "43_13": 1199, "13_35": 1200, "35_13": 1201, "9_29": 1202, "29_9": 1203, "36_16": 1204, "16_36": 1205, "45_12": 1206, "12_45": 1207, "48_4": 1208, "13_30": 1209, "30_13": 1210, "5_32": 1211, "32_5": 1212, "3_25": 1213, "25_3": 1214, "29_48": 1215, "48_29": 1216, "3_6": 1217, "6_3": 1218, "44_25": 1219, "25_44": 1220, "23_31": 1221, "31_23": 1222, "24_22": 1223, "22_24": 1224, "29_23": 1225, "23_29": 1226, "44_10": 1227, "10_44": 1228, "31_12": 1229, "12_31": 1230, "39_44": 1231, "44_39": 1232, "43_16": 1233, "16_43": 1234, "39_50": 1235, "50_39": 1236, "41_22": 1237, "22_41": 1238, "9_12": 1239, "12_9": 1240, "3_39": 1241, "39_3": 1242, "14_3": 1243, "3_14": 1244, "24_31": 1245, "31_24": 1246, "48_5": 1247, "5_48": 1248, "11_4": 1249, "13_3": 1250, "3_13": 1251, "4_18": 1252, "18_4": 1253, "12_6": 1254, "6_12": 1255, "20_20": 1256, "24_35": 1257, "35_24": 1258, "42_2": 1259, "2_42": 1260, "7_28": 1261, "28_7": 1262, "7_14": 1263, "14_7": 1264, "40_25": 1265, "25_40": 1266, "3_47": 1267, "47_3": 1268, "16_22": 1269, "22_16": 1270, "16_4": 1271, "4_16": 1272, "29_5": 1273, "5_29": 1274, "35_45": 1275, "24_18": 1276, "18_24": 1277, "4_25": 1278, "25_4": 1279, "51_51": 1280, "16_7": 1281, "7_16": 1282, "30_6": 1283, "6_30": 1284, "15_46": 1285, "46_15": 1286, "15_30": 1287, "30_15": 1288, "4_10": 1289, "10_4": 1290, "40_31": 1291, "31_40": 1292, "44_5": 1293, "5_44": 1294, "8_45": 1295, "45_8": 1296, "20_32": 1297, "32_20": 1298, "2_25": 1299, "25_2": 1300, "5_49": 1301, "49_5": 1302, "32_36": 1303, "36_32": 1304, "18_43": 1305, "43_18": 1306, "44_22": 1307, "22_44": 1308, "37_37": 1309, "39_13": 1310, "13_39": 1311, "32_18": 1312, "18_32": 1313, "23_6": 1314, "6_23": 1315, "13_33": 1316, "33_13": 1317, "48_11": 1318, "11_48": 1319, "30_12": 1320, "12_30": 1321, "23_30": 1322, "30_23": 1323, "8_19": 1324, "19_8": 1325, "25_5": 1326, "5_25": 1327, "42_46": 1328, "46_42": 1329, "18_31": 1330, "31_18": 1331, "17_12": 1332, "12_17": 1333, "17_49": 1334, "49_17": 1335, "12_22": 1336, "22_12": 1337, "26_43": 1338, "43_26": 1339, "20_40": 1340, "40_20": 1341, "33_5": 1342, "5_33": 1343, "6_44": 1344, "44_6": 1345, "28_11": 1346, "11_28": 1347, "26_32": 1348, "32_26": 1349, "6_43": 1350, "43_6": 1351, "3_5": 1352, "5_3": 1353, "20_6": 1354, "6_20": 1355, "2_24": 1356, "24_2": 1357, "2_22": 1358, "22_2": 1359, "47_49": 1360, "4_22": 1361, "22_4": 1362, "6_11": 1363, "11_6": 1364, "10_49": 1365, "49_10": 1366, "2_34": 1367, "34_2": 1368, "30_22": 1369, "22_30": 1370, "42_48": 1371, "48_42": 1372, "20_3": 1373, "3_20": 1374, "23_3": 1375, "3_23": 1376, "31_45": 1377, "45_31": 1378, "36_45": 1379, "45_36": 1380, "19_31": 1381, "31_19": 1382, "48_23": 1383, "23_48": 1384, "48_9": 1385, "9_48": 1386, "26_15": 1387, "15_26": 1388, "5_5": 1389, "5_40": 1390, "40_5": 1391, "5_16": 1392, "16_5": 1393, "48_35": 1394, "35_48": 1395, "42_13": 1396, "13_42": 1397, "45_25": 1398, "25_45": 1399, "44_19": 1400, "19_44": 1401, "19_38": 1402, "38_19": 1403, "13_16": 1404, "16_13": 1405, "16_14": 1406, "14_16": 1407, "22_22": 1408, "15_38": 1409, "38_15": 1410, "33_14": 1411, "14_33": 1412, "45_40": 1413, "40_45": 1414, "42_45": 1415, "45_42": 1416, "36_12": 1417, "12_36": 1418, "4_50": 1419, "50_4": 1420, "14_34": 1421, "34_14": 1422, "44_16": 1423, "16_44": 1424, "2_19": 1425, "19_2": 1426, "9_11": 1427, "11_9": 1428, "35_23": 1429, "23_35": 1430, "28_14": 1431, "42_10": 1432, "10_42": 1433, "31_47": 1434, "47_31": 1435, "20_44": 1436, "44_20": 1437, "28_39": 1438, "2_43": 1439, "43_2": 1440, "34_21": 1441, "21_34": 1442, "26_29": 1443, "29_26": 1444, "13_50": 1445, "50_13": 1446, "35_2": 1447, "2_35": 1448, "33_47": 1449, "47_33": 1450, "35_22": 1451, "24_29": 1452, "29_24": 1453, "44_40": 1454, "40_44": 1455, "24_45": 1456, "45_24": 1457, "45_13": 1458, "13_45": 1459, "45_20": 1460, "20_45": 1461, "45_28": 1462, "28_45": 1463, "32_45": 1464, "45_32": 1465, "45_16": 1466, "16_45": 1467, "28_47": 1468, "47_28": 1469, "46_41": 1470, "41_46": 1471, "34_7": 1472, "7_34": 1473, "19_6": 1474, "6_19": 1475, "6_47": 1476, "47_6": 1477, "6_10": 1478, "10_6": 1479, "6_18": 1480, "18_6": 1481, "47_10": 1482, "10_47": 1483, "27_40": 1484, "40_27": 1485, "13_8": 1486, "8_13": 1487, "26_31": 1488, "31_26": 1489, "26_2": 1490, "2_26": 1491, "23_22": 1492, "22_23": 1493, "40_39": 1494, "39_40": 1495, "2_31": 1496, "31_2": 1497, "26_11": 1498, "11_26": 1499, "24_47": 1500, "47_24": 1501, "3_10": 1502, "10_3": 1503, "26_40": 1504, "40_26": 1505, "36_11": 1506, "11_36": 1507, "23_32": 1508, "32_23": 1509, "36_10": 1510, "10_36": 1511, "30_47": 1512, "47_30": 1513, "7_18": 1514, "18_7": 1515, "47_45": 1516, "45_47": 1517, "10_45": 1518, "45_10": 1519, "22_40": 1520, "40_22": 1521, "26_45": 1522, "45_26": 1523, "31_46": 1524, "46_31": 1525, "46_28": 1526, "28_46": 1527, "19_45": 1528, "45_19": 1529, "11_12": 1530, "12_11": 1531, "8_2": 1532, "2_40": 1533, "40_2": 1534, "31_22": 1535, "22_31": 1536, "44_45": 1537, "45_44": 1538, "18_40": 1539, "40_18": 1540, "3_45": 1541, "45_3": 1542, "47_20": 1543, "20_47": 1544, "31_10": 1545, "10_31": 1546, "47_23": 1547, "23_47": 1548, "11_22": 1549, "22_11": 1550, "13_38": 1551, "38_13": 1552, "2_6": 1553, "6_2": 1554, "27_10": 1555, "10_27": 1556, "23_18": 1557, "18_23": 1558, "13_47": 1559, "47_13": 1560, "44_7": 1561, "7_44": 1562, "9_7": 1563, "7_9": 1564, "41_13": 1565, "13_41": 1566, "41_26": 1567, "26_41": 1568, "7_11": 1569, "11_7": 1570, "41_39": 1571, "39_41": 1572, "23_7": 1573, "7_23": 1574, "19_7": 1575, "7_19": 1576, "46_7": 1577, "7_46": 1578, "41_19": 1579, "19_41": 1580, "5_6": 1581, "6_5": 1582, "20_41": 1583, "41_20": 1584, "26_7": 1585, "7_26": 1586, "27_11": 1587, "11_27": 1588, "2_11": 1589, "11_2": 1590, "26_47": 1591, "47_26": 1592, "13_18": 1593, "18_13": 1594, "46_46": 1595, "36_46": 1596, "46_36": 1597, "13_2": 1598, "2_13": 1599, "33_46": 1600, "46_33": 1601, "3_46": 1602, "46_3": 1603, "6_48": 1604, "48_6": 1605, "41_48": 1606, "48_41": 1607, "30_14": 1608, "14_30": 1609, "8_43": 1610, "43_8": 1611, "43_31": 1612, "31_43": 1613, "43_29": 1614, "29_43": 1615, "43_49": 1616, "49_43": 1617, "43_14": 1618, "14_43": 1619, "43_48": 1620, "48_43": 1621, "43_32": 1622, "32_43": 1623, "43_33": 1624, "33_43": 1625, "43_7": 1626, "7_43": 1627, "43_5": 1628, "5_43": 1629, "43_19": 1630, "19_43": 1631, "43_39": 1632, "39_43": 1633, "12_7": 1634, "7_12": 1635, "12_23": 1636, "23_12": 1637, "12_20": 1638, "20_12": 1639, "12_39": 1640, "39_12": 1641, "13_19": 1642, "19_13": 1643, "36_48": 1644, "48_36": 1645, "26_16": 1646, "16_26": 1647, "26_19": 1648, "19_26": 1649, "23_19": 1650, "19_23": 1651, "22_19": 1652, "19_22": 1653, "17_17": 1654, "24_17": 1655, "17_24": 1656, "17_9": 1657, "9_17": 1658, "17_27": 1659, "27_17": 1660, "17_32": 1661, "32_17": 1662, "17_28": 1663, "28_17": 1664, "17_36": 1665, "36_17": 1666, "33_32": 1667, "32_33": 1668, "3_17": 1669, "17_3": 1670, "17_2": 1671, "2_17": 1672, "17_23": 1673, "23_17": 1674, "44_17": 1675, "17_44": 1676, "17_30": 1677, "30_17": 1678, "17_19": 1679, "19_17": 1680, "14_17": 1681, "17_14": 1682, "17_22": 1683, "22_17": 1684, "17_8": 1685, "8_17": 1686, "15_18": 1687, "18_15": 1688, "23_50": 1689, "50_23": 1690, "39_15": 1691, "15_39": 1692, "2_50": 1693, "50_2": 1694, "15_2": 1695, "2_15": 1696, "15_3": 1697, "3_15": 1698, "49_15": 1699, "15_49": 1700, "15_8": 1701, "8_15": 1702, "15_44": 1703, "44_15": 1704, "50_27": 1705, "27_50": 1706, "50_46": 1707, "46_50": 1708, "50_44": 1709, "44_50": 1710, "39_33": 1711, "33_39": 1712, "28_50": 1713, "50_28": 1714, "50_37": 1715, "37_50": 1716, "15_20": 1717, "20_15": 1718, "37_24": 1719, "24_37": 1720, "37_36": 1721, "36_37": 1722, "37_27": 1723, "27_37": 1724, "37_23": 1725, "23_37": 1726, "16_23": 1727, "23_16": 1728, "37_19": 1729, "19_37": 1730, "23_45": 1731, "45_23": 1732, "23_2": 1733, "2_23": 1734, "37_8": 1735, "8_37": 1736, "19_21": 1737, "21_19": 1738, "28_21": 1739, "21_28": 1740, "36_21": 1741, "21_36": 1742, "49_21": 1743, "21_49": 1744, "33_21": 1745, "21_33": 1746, "27_21": 1747, "21_27": 1748, "21_24": 1749, "24_21": 1750, "21_3": 1751, "3_21": 1752, "21_18": 1753, "18_21": 1754, "30_21": 1755, "21_30": 1756, "21_48": 1757, "48_21": 1758, "21_29": 1759, "29_21": 1760, "21_44": 1761, "44_21": 1762, "21_13": 1763, "13_21": 1764, "51_17": 1765, "17_51": 1766, "3_16": 1767, "16_3": 1768, "26_50": 1769, "50_26": 1770, "50_8": 1771, "8_50": 1772, "51_40": 1773, "40_51": 1774, "51_5": 1775, "5_51": 1776, "25_9": 1777, "9_25": 1778, "50_6": 1779, "6_50": 1780, "50_38": 1781, "38_50": 1782, "50_40": 1783, "40_50": 1784, "50_16": 1785, "16_50": 1786, "50_31": 1787, "31_50": 1788, "50_12": 1789, "12_50": 1790, "10_22": 1791, "22_10": 1792, "50_48": 1793, "48_50": 1794, "24_7": 1795, "7_24": 1796, "51_12": 1797, "12_51": 1798, "50_19": 1799, "19_50": 1800, "50_45": 1801, "45_50": 1802, "50_30": 1803, "30_50": 1804, "50_18": 1805, "18_50": 1806, "50_32": 1807, "32_50": 1808, "50_42": 1809, "42_50": 1810, "50_47": 1811, "47_50": 1812, "46_34": 1813, "34_46": 1814, "46_27": 1815, "27_46": 1816, "46_38": 1817, "38_46": 1818, "46_19": 1819, "19_46": 1820, "50_22": 1821, "22_50": 1822, "50_10": 1823, "10_50": 1824, "51_16": 1825, "16_51": 1826, "40_46": 1827, "46_40": 1828, "40_19": 1829, "19_40": 1830, "51_36": 1831, "36_51": 1832, "23_5": 1833, "5_23": 1834, "22_14": 1835, "14_22": 1836, "23_43": 1837, "43_23": 1838, "13_5": 1839, "5_13": 1840, "20_5": 1841, "5_20": 1842, "14_5": 1843, "5_14": 1844, "2_5": 1845, "5_2": 1846, "42_5": 1847, "5_42": 1848, "24_5": 1849, "5_24": 1850, "39_25": 1851, "25_39": 1852, "23_25": 1853, "25_23": 1854, "51_18": 1855, "18_51": 1856, "18_17": 1857, "17_18": 1858, "51_22": 1859, "22_51": 1860, "50_11": 1861, "11_50": 1862, "14_27": 1863, "27_14": 1864, "36_39": 1865, "39_10": 1866, "10_39": 1867, "29_2": 1868, "2_29": 1869, "22_39": 1870, "39_22": 1871, "13_46": 1872, "46_13": 1873, "9_39": 1874, "2_14": 1875, "14_2": 1876, "43_42": 1877, "42_43": 1878, "14_29": 1879, "29_14": 1880, "39_30": 1881, "30_39": 1882, "34_25": 1883, "25_34": 1884, "49_25": 1885, "25_49": 1886, "2_12": 1887, "12_2": 1888, "39_24": 1889, "24_39": 1890, "23_39": 1891, "39_23": 1892, "39_31": 1893, "31_39": 1894, "39_16": 1895, "16_39": 1896, "39_26": 1897, "26_39": 1898, "39_21": 1899, "21_39": 1900, "9_10": 1901, "10_9": 1902, "47_16": 1903, "16_47": 1904, "14_32": 1905, "32_14": 1906, "14_26": 1907, "26_14": 1908, "14_12": 1909, "12_14": 1910, "18_39": 1911, "39_18": 1912, "2_10": 1913, "10_2": 1914, "13_32": 1915, "32_13": 1916, "35_17": 1917, "17_35": 1918, "26_10": 1919, "10_26": 1920, "19_47": 1921, "47_19": 1922, "30_43": 1923, "43_30": 1924, "22_43": 1925, "43_22": 1926, "23_40": 1927, "40_23": 1928, "24_10": 1929, "10_24": 1930, "4_21": 1931, "21_4": 1932, "47_18": 1933, "18_47": 1934, "14_41": 1935, "41_14": 1936, "37_25": 1937, "25_37": 1938, "20_50": 1939, "50_20": 1940, "0_0": 1941, "1_1": 1942}