{"PAD": 0, "UNK": 1, "concept_person_charlie_king": 2, "concept_nonprofitorganization_national_action_network": 3, "concept_ceo_muhtar_kent": 4, "concept_biotechcompany_coca_cola": 5, "concept_ceo_jamie_dimon": 6, "concept_bank_jp_morgan_chase": 7, "concept_politicianus_david_smith": 8, "concept_city_sinclair": 9, "concept_person_abbas": 10, "concept_nongovorganization_representatives": 11, "concept_ceo_steve_case": 12, "concept_blog_america_online": 13, "concept_person_lang_cheng": 14, "concept_organization_immigration_bureau": 15, "concept_person_karzai": 16, "concept_company_pakistan": 17, "concept_nongovorganization_fatah_leadership": 18, "concept_writer_greenspan": 19, "concept_bank_us_federal_reserve": 20, "concept_ceo_stephen_bennett": 21, "concept_company_intuit": 22, "concept_personeurope_julie_aigner_clark": 23, "concept_company_baby_einstein": 24, "concept_ceo_mark_v__hurd": 25, "concept_university_hewlett_packard": 26, "concept_ceo_sheldon_adelson": 27, "concept_biotechcompany_las_vegas_sands_corp_": 28, "concept_governmentorganization_central_bank": 29, "concept_personafrica_paul_volcker": 30, "concept_bank_federal_reserve": 31, "concept_ceo_linda_mcmahon": 32, "concept_company_world_wrestling_entertainment": 33, "concept_personaustralia_phil_jones": 34, "concept_televisionnetwork_cbs": 35, "concept_company_revolution_health_com": 36, "concept_personmexico_ryan_whitney": 37, "concept_politicalparty_movement": 38, "concept_biotechcompany_pa": 39, "concept_ceo_robert_iger": 40, "concept_company_walt_disney": 41, "concept_ceo_trip_hawkins": 42, "concept_company_electronic_arts": 43, "concept_governmentorganization_national_security_council": 44, "concept_personafrica_joe_tucci": 45, "concept_musicartist_emc": 46, "concept_professor_aart_j__de_geus": 47, "concept_company_synopsys": 48, "concept_politician_richard_j__daley": 49, "concept_biotechcompany_chicago": 50, "concept_politicianus_mikhail_gorbachev": 51, "concept_organization_soviet": 52, "concept_politicianus_john_fleming": 53, "concept_continent_europe": 54, "concept_person_lanni": 55, "concept_biotechcompany_mgm_mirage": 56, "concept_personus_david_geffen": 57, "concept_company_asylum": 58, "concept_country_vatican": 59, "concept_person_ramush_haradinaj": 60, "concept_country_kosovo": 61, "concept_professor_randy_smith": 62, "concept_organization_tigers": 63, "concept_person_brian_france": 64, "concept_sportsleague_nascar": 65, "concept_person_john_l__castello": 66, "concept_biotechcompany_xoma": 67, "concept_company_power": 68, "concept_person_eric_sevareid": 69, "concept_person_elon_musk": 70, "concept_automobilemaker_tesla_motors": 71, "concept_person_clive_davis": 72, "concept_recordlabel_bmg_": 73, "concept_ceo_john_silvester_varley": 74, "concept_bank_barclays_global_investors": 75, "concept_person_larry_ellison": 76, "concept_company_oracle001": 77, "concept_person_david_n__dinkins": 78, "concept_organization_manhattan_borough": 79, "concept_automobilemaker_request": 80, "concept_personaustralia_yasser_arafat": 81, "concept_terroristorganization_palestinian_authority": 82, "concept_ceo_paul_allen": 83, "concept_company_microsoft_corporation": 84, "concept_comedian_george_jones": 85, "concept_company_borders": 86, "concept_writer_luca": 87, "concept_winery_ferrari": 88, "concept_ceo_jeffrey_immelt": 89, "concept_bank_general_electric": 90, "concept_ceo_hugh_hefner": 91, "concept_company_playboy_enterprises": 92, "concept_ceo_richard_notebaert": 93, "concept_company_qwest_communications_international": 94, "concept_terroristorganization_wing": 95, "concept_terroristorganization_rival_fatah_faction": 96, "concept_ceo_john_thain": 97, "concept_retailstore_merrill": 98, "concept_writer_joshua_nkomo": 99, "concept_politicalparty_zimbabwe_african_peoples_union": 100, "concept_male_lou_brock": 101, "concept_sportsteam_tampa_bay_devil_rays": 102, "concept_personcanada_silvio_berlusconi": 103, "concept_automobilemaker_italian": 104, "concept_politicalparty_congressional_republicans": 105, "concept_personeurope_scott_carson": 106, "concept_bank_boeing": 107, "concept_person_connie_chung": 108, "concept_company_cnn__pbs": 109, "concept_personus_steve_ballmer": 110, "concept_university_microsoft": 111, "concept_writer_wayne_pacelle": 112, "concept_nonprofitorganization_humane_society": 113, "concept_nongovorganization_senate_judiciary_committee": 114, "concept_ceo_robert_rubin": 115, "concept_company_citigroup": 116, "concept_musicartist_faction": 117, "concept_coach_sarah_palin": 118, "concept_city_alaska": 119, "concept_actor_manfred_eicher": 120, "concept_recordlabel_ecm": 121, "concept_journalist_andy_rooney": 122, "concept_person_castello": 123, "concept_person_nguyen_duc_kien": 124, "concept_organization_economics_affairs_and_budget_commission": 125, "concept_politicalparty_senate_democrats": 126, "concept_governmentorganization_court": 127, "concept_ceo_alan_greenspan": 128, "concept_bank_former_federal_reserve": 129, "concept_person_katsuaki_watanabe": 130, "concept_automobilemaker_toyota_motor_corporation": 131, "concept_coach_armen_keteyian": 132, "concept_person_iran": 133, "concept_stateorprovince_un": 134, "concept_female_sheila_bair": 135, "concept_governmentorganization_federal_deposit_insurance": 136, "concept_personaustralia_robert_johnson": 137, "concept_radiostation_bet": 138, "concept_politicianus_linda_mcmahon": 139, "concept_company_wwe": 140, "concept_politicianus_dick_cheney": 141, "concept_retailstore_halliburton": 142, "concept_person_xu_haifeng": 143, "concept_organization_chinese_national_shooting_team": 144, "concept_ceo_rich_karlgaard": 145, "concept_company_forbes001": 146, "concept_terroristorganization_palestinian_government": 147, "concept_bank_administration": 148, "concept_politicianus_robert_parkinson": 149, "concept_musicartist_baxter": 150, "concept_ceo_robert_crandall": 151, "concept_musicartist_american": 152, "concept_person_steve_mcpherson": 153, "concept_city_abc": 154, "concept_governmentorganization_office": 155, "concept_personeurope_azim_premji": 156, "concept_biotechcompany_wipro": 157, "concept_personaustralia_james_murdoch": 158, "concept_company_fox": 159, "concept_person_kibamba_kasereka": 160, "concept_terroristorganization_mai_mai_militia": 161, "concept_bank_j_p__morgan___co_": 162, "concept_politician_walter_veltroni": 163, "concept_city_rome": 164, "concept_personeurope_disney": 165, "concept_recordlabel_walt_disney": 166, "concept_politicianus_rudolph_giuliani": 167, "concept_city_new_york": 168, "concept_company_british_sky_broadcasting": 169, "concept_professor_nova_spivack": 170, "concept_company_radar_networks": 171, "concept_governmentorganization_epa": 172, "concept_terroristorganization_palestinian_leadership": 173, "concept_mlauthor_alan_schwartz": 174, "concept_bank_bear_stearns_companies": 175, "concept_politicsblog_presence": 176, "concept_professor_service": 177, "concept_company_pixar": 178, "concept_ceo_thomas_m__ryan": 179, "concept_biotechcompany_cvs_caremark": 180, "concept_personus_jeff_bezos": 181, "concept_governmentorganization_amazon_com": 182, "concept_personus_avi_arad": 183, "concept_biotechcompany_marvel": 184, "concept_ceo_michael_capellas": 185, "concept_company_compaq_presario": 186, "concept_tradeunion_security": 187, "concept_ceo_c__robert_henrikson": 188, "concept_company_metlife": 189, "concept_person_mukesh_ambani": 190, "concept_bank_reliance_industries_limited": 191, "concept_ceo_gary_rodkin": 192, "concept_biotechcompany_conagra": 193, "concept_person_arthur_mutambara": 194, "concept_politicalparty_movement_for_democratic_change": 195, "concept_visualartist_charles_davidson": 196, "concept_company_noble_energy": 197, "concept_person_sarkozy": 198, "concept_city_neuilly": 199, "concept_nongovorganization_mdc": 200, "concept_professor_peter_moore": 201, "concept_company_ea": 202, "concept_professor_richard_stallman": 203, "concept_nonprofitorganization_free_software_foundation": 204, "concept_governmentorganization_fdic": 205, "concept_recordlabel_j_records": 206, "concept_politician_kaine": 207, "concept_publication_richmond": 208, "concept_ceo_kevin_w__sharer": 209, "concept_biotechcompany_amgen": 210, "concept_person_yang": 211, "concept_website_yahoo_mail": 212, "concept_writer_bill_geist": 213, "concept_personus_franz_humer": 214, "concept_winery_roche": 215, "concept_person_derwall": 216, "concept_organization_west_germany": 217, "concept_person_ted_leonsis": 218, "concept_company_aol": 219, "concept_terroristorganization_hamas": 220, "concept_personmexico_david_martin": 221, "concept_person_henry_ford": 222, "concept_company_ford_motor": 223, "concept_politicianus_kevin_rudd": 224, "concept_country_australia": 225, "concept_coach_glen_murray": 226, "concept_city_winnipeg": 227, "concept_personus_richard_clark": 228, "concept_biotechcompany_merck___co": 229, "concept_personnorthamerica_kevin_reilly": 230, "concept_company_nbc": 231, "concept_politicianus_al_gore": 232, "concept_country_us": 233, "concept_coach_bernie_ecclestone": 234, "concept_sportsleague_formula_one": 235, "concept_person_wen_jiabao": 236, "concept_biotechcompany_china": 237, "concept_professor_john_hill": 238, "concept_governmentorganization_fmcsa": 239, "concept_person_roone_arledge": 240, "concept_ceo_richard": 241, "concept_company_virgin_airlines": 242, "concept_person_rendell": 243, "concept_county_philadelphia": 244, "concept_company_arista": 245, "concept_personaustralia_clay_johnson": 246, "concept_organization_transition_team": 247, "concept_personcanada_ian_davis": 248, "concept_company_mckinsey": 249, "concept_ceo_hans_paul_b__rkner": 250, "concept_university_boston_consulting_group": 251, "concept_terroristorganization_fatah_security_forces": 252, "concept_personnorthamerica_neil_bogart": 253, "concept_city_casablanca": 254, "concept_politicalparty_palestine_authority": 255, "concept_person_don_wildmon": 256, "concept_sportsleague_afa": 257, "concept_director_charles_kuralt": 258, "concept_personus_rockefeller": 259, "concept_company_standard_oil": 260, "concept_ceo_david_gergen": 261, "concept_retailstore_united_technologies": 262, "concept_company_qwest": 263, "concept_politician_jobs": 264, "concept_person_fred_kaplan": 265, "concept_magazine_slate": 266, "concept_person_richard_fain": 267, "concept_company_royal_caribbean_cruises": 268, "concept_person_les_moonves": 269, "concept_professor_mike_eskew": 270, "concept_biotechcompany_united_parcel_service": 271, "concept_company_virgin_galactic": 272, "concept_terroristorganization_fatah_movement": 273, "concept_personaustralia_bill_wilson": 274, "concept_company_aa": 275, "concept_ceo_mark_parker": 276, "concept_company_nike": 277, "concept_personeurope_clint_eastwood": 278, "concept_city_carmel_by_the_sea": 279, "concept_ceo_norbert_reithofer": 280, "concept_company_bmw__mercedes_benz": 281, "concept_female_ed_rendell": 282, "concept_city_home": 283, "concept_person_hu_jintao001": 284, "concept_person_fidel": 285, "concept_publication_people_": 286, "concept_governmentorganization_authority": 287, "concept_person_welch": 288, "concept_company_ge": 289, "concept_person_wozniak": 290, "concept_biotechcompany_apple": 291, "concept_person_ed_whitacre": 292, "concept_company_american_management_systems": 293, "concept_city_lego": 294, "concept_personeurope_john_johnson001": 295, "concept_bank_fannie_mae": 296, "concept_ceo_august_a__busch_iv": 297, "concept_company_anheuser_busch_companies001": 298, "concept_person_al_avila": 299, "concept_company_iran": 300, "concept_musicartist_thursday": 301, "concept_person_indra_nooyi": 302, "concept_biotechcompany_pepsico": 303, "concept_ceo_buffett": 304, "concept_bank_omaha": 305, "concept_person_mike_lynch": 306, "concept_terroristorganization_autonomy": 307, "concept_personaustralia_paul_allen": 308, "concept_person_steven": 309, "concept_company_apple002": 310, "concept_personnorthamerica_patricia_russo": 311, "concept_university_lucent_technologies": 312, "concept_governmentorganization_united_states_congress": 313, "concept_ceo_abigail_johnson": 314, "concept_company_fidelity_investments": 315, "concept_governmentorganization_republican_national_committee": 316, "concept_governmentorganization_defense_department": 317, "concept_ceo_james_w__owens": 318, "concept_bank_caterpillar_inc": 319, "concept_person_carly_fiorina001": 320, "concept_ceo_james_goodnight": 321, "concept_company_sas_institute": 322, "concept_ceo_david_sarnoff": 323, "concept_recordlabel_rca_victor": 324, "concept_personus_joe_maddon": 325, "concept_sportsteam_tampa_bay_rays": 326, "concept_politicianus_giuliani": 327, "concept_city_nyc": 328, "concept_nongovorganization_republican_senators": 329, "concept_person_michel_sidibe": 330, "concept_politicalparty_unaids": 331, "concept_politicianus_ben_bernanke": 332, "concept_governmentorganization_fed": 333, "concept_personaustralia_david_nagel": 334, "concept_company_palmsource": 335, "concept_personus_george_eastman": 336, "concept_magazine_kodak": 337, "concept_bank_citizens": 338, "concept_ceo_bob_diamond": 339, "concept_bank_barclays": 340, "concept_person_ahmadinejad": 341, "concept_governmentorganization_government": 342, "concept_coach_michael_powell": 343, "concept_company_fcc": 344, "concept_person_levon_ter_petrosyan": 345, "concept_country_armenia": 346, "concept_writer_lester_bangs": 347, "concept_publication_creem": 348, "concept_company_ea_": 349, "concept_company_credibility": 350, "concept_writer_bernard_goldberg": 351, "concept_politicianus_j__edgar_hoover": 352, "concept_governmentorganization_fbi": 353, "concept_director_zucker": 354, "concept_company_nbcu": 355, "concept_personasia_hamid_karzai": 356, "concept_organization_transitional_administration": 357, "concept_person_alexy_ii": 358, "concept_organization_russian_orthodox_church": 359, "concept_ceo_jack_welch": 360, "concept_personnorthamerica_kenneth_d__lewis": 361, "concept_country___america": 362, "concept_person_cole": 363, "concept_organization_maui_land_and_pineapple": 364, "concept_country_afghanistan": 365, "concept_person_ron_meyer": 366, "concept_recordlabel_universal": 367, "concept_person_richard_parsons": 368, "concept_televisionstation_time_warner_cable": 369, "concept_scientist_mitch_kapor": 370, "concept_city_lotus": 371, "concept_ceo_evan_g__greenberg": 372, "concept_company_ace_limited": 373, "concept_professor_david_yu": 374, "concept_company_betfair": 375, "concept_person_peter_munk": 376, "concept_biotechcompany_barrick_gold_corporation": 377, "concept_bank_bear_stearns___co_": 378, "concept_person_home001": 379, "concept_university_google": 380, "concept_ceo_kenneth_lewis": 381, "concept_ceo_andrew_liveris": 382, "concept_biotechcompany_dow_chemical_co_": 383, "concept_geopoliticallocation_agencies": 384, "concept_ceo_reggie_fils_aime": 385, "concept_person_batsman": 386, "concept_country_south_africa": 387, "concept_radiostation_wwdc": 388, "concept_personeurope_allan_moss": 389, "concept_bank_macquarie_bank": 390, "concept_personasia_chew_choon_seng": 391, "concept_company_singapore_airline": 392, "concept_ceo_randall_l__stephenson": 393, "concept_female_sarah_caldwell": 394, "concept_organization_opera_company_of_boston": 395, "concept_terroristorganization_iranian_government": 396, "concept_terroristorganization_rival_fatah_party": 397, "concept_personcanada_dmx": 398, "concept_recordlabel_bloodline_records": 399, "concept_journalist_richard_anderson": 400, "concept_biotechcompany_delta_air_lines_inc_": 401, "concept_person_peter_lynch": 402, "concept_company_winn_dixie": 403, "concept_ceo_gregory_boyce": 404, "concept_company_peabody_energy": 405, "concept_chef_kalle_lasn": 406, "concept_publication_adbusters": 407, "concept_athlete_bob_lutz": 408, "concept_automobilemaker_gm": 409, "concept_person_israel_hernandez": 410, "concept_governmentorganization_u_s__and_foreign_commercial_service": 411, "concept_journalist_aubrey_mcclendon": 412, "concept_company_chesapeake_energy": 413, "concept_model_zhang": 414, "concept_organization_china_hydropower_engineering_society": 415, "concept_personaustralia_kevin_rose": 416, "concept_website_digg": 417, "concept_country_party": 418, "concept_governmentorganization_homeland_security": 419, "concept_person_lyor_cohen": 420, "concept_biotechcompany_sony_corp": 421, "concept_sportsteam_revolution": 422, "concept_company_merill_lynch": 423, "concept_ceo_carol_meyrowitz": 424, "concept_company_tjx": 425, "concept_person_bruce_iglauer": 426, "concept_recordlabel_alligator_records": 427, "concept_ceo_john_donahoe": 428, "concept_company_ebay002": 429, "concept_person_oscar_wyatt": 430, "concept_city_texas": 431, "concept_personeurope_sam_walton": 432, "concept_company_wal_mart": 433, "concept_personeurope_bob_johnson": 434, "concept_terroristorganization_west_bank": 435, "concept_politicianus_mccain": 436, "concept_nongovorganization_indian_affairs_committee": 437, "concept_personafrica_doug_morris": 438, "concept_coach_john_mara": 439, "concept_sportsteam_new_york_giants": 440, "concept_person_dr__dre": 441, "concept_recordlabel_aftermath_entertainment": 442, "concept_comedian_vice_president_dick_cheney": 443, "concept_nongovorganization_federal_reserve_board": 444, "concept_person_antoinette_batumubwira": 445, "concept_country_burundi": 446, "concept_personus_jim_johnson": 447, "concept_person_aubrey_sarvis": 448, "concept_nongovorganization_sldn": 449, "concept_stateorprovince_paypal": 450, "concept_ceo_glenn_a__britt": 451, "concept_company_time_warner": 452, "concept_politicianus_charlie_crist": 453, "concept_city_florida": 454, "concept_ceo_brian_roberts": 455, "concept_politicsblog_c_a": 456, "concept_ceo_andrea_jung": 457, "concept_city_avon": 458, "concept_male_malcolm_walker": 459, "concept_island_iceland": 460, "concept_journalist_ed_bradley": 461, "concept_nongovorganization_u_s_": 462, "concept_person_cheney": 463, "concept_biotechcompany_halliburton": 464, "concept_governmentorganization_fema": 465, "concept_actor_daniel_schorr": 466, "concept_person_hanna_gronkiewicz_waltz": 467, "concept_visualizablething_warsaw": 468, "concept_personus_james_dimon": 469, "concept_bank_jpmorgan": 470, "concept_company_qwest_communications": 471, "concept_personnorthamerica_ed_levine": 472, "concept_blog_serious_eats": 473, "concept_country_cuba": 474, "concept_criminal_mark_shuttleworth": 475, "concept_company_canonical": 476, "concept_writer_bill_gertz": 477, "concept_website_washington_times": 478, "concept_person_tong_thi_phong": 479, "concept_organization_commission_for_mass_mobilization": 480, "concept_person_guy_oseary": 481, "concept_magazine_maverick": 482, "concept_personus_richard_egan": 483, "concept_company_emc001": 484, "concept_ceo_shantanu_narayen": 485, "concept_company_adobe": 486, "concept_person_kenneth_lay": 487, "concept_company_enron_and_worldcom": 488, "concept_person_sarah001": 489, "concept_city_wasilla": 490, "concept_ceo_sheldon_erikson": 491, "concept_winery_cameron": 492, "concept_person_carlos_slim_helu001": 493, "concept_company_telmex": 494, "concept_comedian_leslie_moonves": 495, "concept_biotechcompany_control": 496, "concept_country_u_n__security_council": 497, "concept_geopoliticallocation_iraq": 498, "concept_person_roger_mudd": 499, "concept_governmentorganization_doj": 500, "concept_ceo_richard_davis": 501, "concept_bank_us_bank": 502, "concept_personus_mark_shapiro": 503, "concept_sportsteam_flags": 504, "concept_recordlabel_arista_records": 505, "concept_judge_mr_": 506, "concept_personeurope_shawn_fanning": 507, "concept_biotechcompany_napster": 508, "concept_city_name": 509, "concept_biotechcompany_boeing_co": 510, "concept_ceo_ivan_seidenberg": 511, "concept_company_verizon_communications": 512, "concept_terroristorganization_plo": 513, "concept_model_joe_quesada": 514, "concept_company_cbs_corp_": 515, "concept_person_nguyen_van_an": 516, "concept_stateorprovince_na": 517, "concept_writer_c_k__prahalad": 518, "concept_university_university_of_michigan": 519, "concept_musicartist_allies": 520, "concept_ceo_tod_nielsen": 521, "concept_company_borland": 522, "concept_journalist_tony_george": 523, "concept_sportsleague_irl": 524, "concept_person_sills": 525, "concept_organization_city_opera": 526, "concept_politicalparty_central_government": 527, "concept_person_meg_whitman": 528, "concept_company_ebay001": 529, "concept_professor_david_levy": 530, "concept_politicsblog_turner_sports": 531, "concept_person_edward_r__murrow": 532, "concept_governmentorganization_environmental_protection_agency": 533, "concept_athlete_sam_allen": 534, "concept_automobilemaker_deere": 535, "concept_criminal_louis_b__mayer": 536, "concept_politician_nicolas_sarkozy": 537, "concept_sportsteam_france": 538, "concept_person_carol_bartz": 539, "concept_company_yahoo_web_hosting": 540, "concept_governmentorganization_rule": 541, "concept_politicianus_howard_dean": 542, "concept_nongovorganization_dnc": 543, "concept_person_dee_hock": 544, "concept_stateorprovince_visa": 545, "concept_city_status": 546, "concept_ceo_henry_paulson": 547, "concept_company_goldman_sachs001": 548, "concept_person_bill": 549, "concept_person_g_g__ware": 550, "concept_organization_the_bond_and_taxation_committee_of_the_state_chamber_of_commerce": 551, "concept_person_nathan_bouscher": 552, "concept_politicalparty_cidi": 553, "concept_nongovorganization_forces": 554, "concept_company_news_corp001": 555, "concept_politicianus_george_lucas": 556, "concept_magazine_lucasarts": 557, "concept_person_hua_guofeng": 558, "concept_organization_chinese": 559, "concept_politicianus_john_engler": 560, "concept_stateorprovince_michigan": 561, "concept_bank_oracle_corporation": 562, "concept_person_patricia_dunn": 563, "concept_sportsleague_wwe": 564, "concept_terroristorganization_secular_fatah_faction": 565, "concept_governmentorganization_state_department": 566, "concept_person_fabrice_tourre": 567, "concept_nongovorganization_opposition": 568, "concept_ceo_josef_ackermann": 569, "concept_bank_deutsche_bank_ag": 570, "concept_personcanada_james_mullen": 571, "concept_professionalorganization_biogen_idec": 572, "concept_company_nbc_universal001": 573, "concept_mountain_fox": 574, "concept_ceo_mike_s__zafirovski": 575, "concept_company_nortel001": 576, "concept_writer_walter_isaacson": 577, "concept_politicsblog_aspen_institute": 578, "concept_sportsleague_indy_racing_league": 579, "concept_nonprofitorganization_wwf": 580, "concept_actor_fidel_castro": 581, "concept_ceo_dick_fuld": 582, "concept_organization_lehman": 583, "concept_governmentorganization_commission": 584, "concept_sportsteam_harvard_divinity_school": 585, "concept_person_mcpherson": 586, "concept_coach_manny_diaz": 587, "concept_city_west_palm_beach": 588, "concept_personus_ken_lewis": 589, "concept_nongovorganization_committee": 590, "concept_personus_warren_buffet": 591, "concept_ceo_william_green": 592, "concept_biotechcompany_accenture": 593, "concept_ceo_james_ziemer": 594, "concept_automobilemaker_harley_davidson": 595, "concept_ceo_david_j__lesar": 596, "concept_person_brian_lamb": 597, "concept_nongovorganization_c_span": 598, "concept_governmentorganization_justice_department": 599, "concept_governmentorganization_courts": 600, "concept_geopoliticallocation_bolton": 601, "concept_person_hugh_grant": 602, "concept_governmentorganization_monsanto": 603, "concept_politicalparty_palestinian_national_authority": 604, "concept_ceo_eric_schmidt": 605, "concept_governmentorganization_u_s__congress": 606, "concept_personus_roger_smith": 607, "concept_company_general_motors001": 608, "concept_person_charles_kuralt": 609, "concept_person_jeffrey_skilling": 610, "concept_company_disney": 611, "concept_male_doyle": 612, "concept_biotechcompany_eolas": 613, "concept_winery_sky": 614, "concept_professor_jerry_kathman": 615, "concept_nongovorganization_lpk": 616, "concept_company_virgin_atlantic_airways": 617, "concept_company_sony": 618, "concept_bank_deutsche_bank": 619, "concept_company_yahoo001": 620, "concept_politicianus_eric_sevareid": 621, "concept_ceo_ron_perelman": 622, "concept_company_revlon": 623, "concept_biotechcompany_dow_chemical": 624, "concept_biotechcompany_newscorp": 625, "concept_personeurope_jerry_colangelo": 626, "concept_sportsteam_suns": 627, "concept_terroristorganization_fatah_party": 628, "concept_personaustralia_mike_jackson": 629, "concept_biotechcompany_autonation": 630, "concept_person_ter_petrosyan": 631, "concept_country_republic_of_armenia": 632, "concept_writer_byron_york": 633, "concept_newspaper_national_review": 634, "concept_person_kanaan": 635, "concept_organization_agr": 636, "concept_personafrica_jonathan_schwartz": 637, "concept_company_sun_microsystems001": 638, "concept_personus_jann_wenner": 639, "concept_website_rolling_stone_magazine": 640, "concept_personus_scott_pelley": 641, "concept_automobilemaker_toyota": 642, "concept_person_levy_mwanawasa": 643, "concept_organization_zambian": 644, "concept_professor_david_cole": 645, "concept_sportsteam_borders": 646, "concept_automobilemaker_toyota_motor": 647, "concept_person_perenchio": 648, "concept_city_univision": 649, "concept_website_change": 650, "concept_ceo_robert_wright": 651, "concept_professionalorganization_cia": 652, "concept_company_spacex": 653, "concept_person_levon_ter__petrosyan": 654, "concept_personnorthamerica_bob_stevens": 655, "concept_university_lockheed_martin": 656, "concept_male_david_miller": 657, "concept_biotechcompany_toronto": 658, "concept_person_disney": 659, "concept_musicartist_toy": 660, "concept_terroristorganization_rival_fatah_movement": 661, "concept_ceo_richard_m__daley": 662, "concept_person_nina_tassler": 663, "concept_ceo_peter_thiel": 664, "concept_personus_richard_taylor": 665, "concept_organization_international_hydropower_association": 666, "concept_ceo_larry_probst": 667, "concept_university_lehman_brothers": 668, "concept_professor_dan_gilbert": 669, "concept_magazine_quicken_loans": 670, "concept_city_tehran": 671, "concept_company_next_computer": 672, "concept_celebrity_lesley_stahl": 673, "concept_person_stanley_friedman": 674, "concept_organization_bronx_democratic": 675, "concept_ceo_gary_kelly": 676, "concept_geopoliticallocation_southwest": 677, "concept_female_anne_lauvergeon": 678, "concept_company_areva": 679, "concept_ceo_richard_bowen": 680, "concept_city_taylor": 681, "concept_ceo_larry_page": 682, "concept_geopoliticalorganization_policies": 683, "concept_person_gerald_meyers": 684, "concept_organization_american_motors_corp_": 685, "concept_personnorthamerica_dean_scarborough": 686, "concept_company_avery_dennison": 687, "concept_terroristorganization_fatah": 688, "concept_writer_zainab_salbi": 689, "concept_nonprofitorganization_women_for_women_international": 690, "concept_governmentorganization_energy_department": 691, "concept_ceo_f__duane_ackerman": 692, "concept_company_bellsouth": 693, "concept_person_sean_mcmanus": 694, "concept_person_sergey_brin001": 695, "concept_person_scott_cook": 696, "concept_magazine_intuit": 697, "concept_politicalparty_u_n_": 698, "concept_politicianus_palin": 699, "concept_musicartist_town": 700, "concept_ceo_steve_odland": 701, "concept_biotechcompany_office_depot": 702, "concept_terroristorganization_fatah_forces": 703, "concept_ceo_jeffrey_katzenberg": 704, "concept_personmexico_antonio_villaraigosa": 705, "concept_company_los_angeles": 706, "concept_company_change__org": 707, "concept_governmentorganization_agency": 708, "concept_politicalparty_treasury_department": 709, "concept_ceo_isaac_larian": 710, "concept_company_mga_entertainment": 711, "concept_personnorthamerica_alan_boeckmann": 712, "concept_biotechcompany_fluor": 713, "concept_sportsteam_wipro_technologies": 714, "concept_person_millard_s__drexler": 715, "concept_city_gap": 716, "concept_ceo_ellen_j__kullman": 717, "concept_bank_dupont": 718, "concept_politicianus_bill_wilson": 719, "concept_stateorprovince_aa": 720, "concept_athlete_calvin_johnson": 721, "concept_terroristorganization_k": 722, "concept_personaustralia_david_brown": 723, "concept_company_owens_corning": 724, "concept_professor_john_ward": 725, "concept_biotechcompany_csx_corporation": 726, "concept_person_ken_lay": 727, "concept_person_suharto": 728, "concept_organization_indonesian": 729, "concept_journalist_jim_lehrer": 730, "concept_company_pbs": 731, "concept_person_robbie_bach": 732, "concept_person_ron_kutz": 733, "concept_organization_dallas_dodge_chrysler_jeep": 734, "concept_ceo_michael_eisner": 735, "concept_politicalparty_moderates": 736, "concept_terroristorganization_fatah_faction": 737, "concept_nongovorganization_rival_fatah": 738, "concept_ceo_michael_geoghegan": 739, "concept_company_hsbc": 740, "concept_politicianus_john_brock": 741, "concept_biotechcompany_coca_cola_enterprises": 742, "concept_person_michael_schonberg": 743, "concept_organization_dreyfus": 744, "concept_ceo_james_p__gorman": 745, "concept_biotechcompany_morgan_stanley": 746, "concept_person_julius_nyerere": 747, "concept_country_tanzania": 748, "concept_person_stephen": 749, "concept_writer_david_m__cote": 750, "concept_bank_honeywell": 751, "concept_personeurope_william_paley": 752, "concept_ceo_larry_kellner": 753, "concept_company_continental_airlines001": 754, "concept_sportsteam_end": 755, "concept_politicianus_david_yepsen": 756, "concept_newspaper_des_moines_register": 757, "concept_comedian_john_surma": 758, "concept_biotechcompany_united_states_steel": 759, "concept_terroristorganization_moderate_fatah_party": 760, "concept_criminal_george_buckley": 761, "concept_biotechcompany_n3m": 762, "concept_recordlabel_columbia": 763, "concept_personus_pierre_omidyar": 764, "concept_person_george_f__colony": 765, "concept_company_forrester_research": 766, "concept_city_members": 767, "concept_terroristorganization_fateh": 768, "concept_journalist_randy_peterson": 769, "concept_scientist_ingvar_kamprad": 770, "concept_company_ikea": 771, "concept_company_enron": 772, "concept_politician_gavin_newsom": 773, "concept_county_san_francisco": 774, "concept_country_countries": 775, "concept_musicartist_news": 776, "concept_bank_banks": 777, "concept_person_ed_bradley": 778, "concept_ceo_sergey_brin": 779, "concept_person_tony_blankley": 780, "concept_blog_alligator": 781, "concept_comedian_warren_littlefield": 782, "concept_terroristorganization_n2005_election": 783, "concept_professor_john_howard": 784, "concept_politicianus_newt_gingrich": 785, "concept_politicalparty_house": 786, "concept_person_chen": 787, "concept_website_youtube": 788, "concept_personasia_xie_fuzhan": 789, "concept_organization_nbs": 790, "concept_ceo_stephen_a__schwarzman": 791, "concept_county_blackstone": 792, "concept_personaustralia_carlos_slim_helu": 793, "concept_personus_rex_tillerson": 794, "concept_biotechcompany_exxon_mobil": 795, "concept_politicianus_miller": 796, "concept_bank_delphi": 797, "concept_person_charles_prince": 798, "concept_ceo_louis_c__camilleri": 799, "concept_biotechcompany_altria_group": 800, "concept_ceo_brian_moynihan": 801, "concept_bank_bank_america": 802, "concept_ceo_henning_kagermann": 803, "concept_biotechcompany_sap_ag": 804, "concept_ceo_robert_stevens": 805, "concept_professionalorganization_lockheed_martin_corporation": 806, "concept_ceo_helge_lund": 807, "concept_company_statoil": 808, "concept_ceo_chua_sock_koong": 809, "concept_company_singtel": 810, "concept_professor_michel_tilmant": 811, "concept_bank_ing": 812, "concept_person_aline_isaacson": 813, "concept_nonprofitorganization_glsen": 814, "concept_person_mugabe": 815, "concept_organization_zanu": 816, "concept_person_toomas_hendrik_ilves": 817, "concept_country_estonia": 818, "concept_country_united_states": 819, "concept_person_ingrid_newkirk": 820, "concept_nongovorganization_peta": 821, "concept_ceo_girish_paranjpe": 822, "concept_ceo_edgar_bronfman": 823, "concept_recordlabel_warner": 824, "concept_ceo_martin_winterkorn": 825, "concept_bank_volkswagen_of_america": 826, "concept_ceo_solomon_trujillo": 827, "concept_company_telstra": 828, "concept_ceo_c__michael_armstrong": 829, "concept_ceo_louis_gallois": 830, "concept_company_eads": 831, "concept_ceo_carlos_ghosn": 832, "concept_company_nissan_north_america": 833, "concept_politician_guiliani": 834, "concept_ceo_kris_gopalakrishnan": 835, "concept_biotechcompany_infosys_technologies_limited": 836, "concept_ceo_vineet_nayar": 837, "concept_biotechcompany_hcl_technologies": 838, "concept_person_o_reilly": 839, "concept_company_chevron001": 840, "concept_visualartist_white": 841, "concept_newspaper_record": 842, "concept_ceo_atsutoshi_nishida": 843, "concept_biotechcompany_toshiba": 844, "concept_ceo_marten_mickos_n": 845, "concept_company_mysql_ab": 846, "concept_politician_alex_sink": 847, "concept_person_xiao_haopeng": 848, "concept_organization_chinese_shooting_squad": 849, "concept_ceo_roger_ailes": 850, "concept_governmentorganization_fox_news": 851, "concept_politician_mohammad_khatami": 852, "concept_country_iran": 853, "concept_person_nguyen_phu_trong": 854, "concept_organization_national_assembly__na__of_vietnam": 855, "concept_ceo_jerry_yang": 856, "concept_person_mohamed_elmasry": 857, "concept_tradeunion_canadian_islamic_congress": 858, "concept_country_turkey": 859, "concept_person_state": 860, "concept_country_left_parties": 861, "concept_ceo_n_chandrasekaran": 862, "concept_company_tata_consultancy_services__tcs_": 863, "concept_ceo_barry_meyer": 864, "concept_company_warner_bros_": 865, "concept_ceo_flavio_briatore": 866, "concept_bank_renault_sa": 867, "concept_ceo_b_m": 868, "concept_company_mgm": 869, "concept_ceo_richard_wagoner": 870, "concept_company_general_motors": 871, "concept_person_eckhard_cordes": 872, "concept_organization_mercedes_car_group": 873, "concept_person_nur_misuari": 874, "concept_nongovorganization_mnlf": 875, "concept_politician_robert_coury": 876, "concept_magazine_mylan": 877, "concept_journalist_bryce_miller": 878, "concept_journalist_david_westin": 879, "concept_ceo_alan_mulally": 880, "concept_company_ford_motor_company001": 881, "concept_ceo_david_rockefeller": 882, "concept_bank_chase_manhattan": 883, "concept_ceo_garo_h__armen": 884, "concept_biotechcompany_antigenics_inc": 885, "concept_ceo_donald_graham": 886, "concept_company_tnt_post": 887, "concept_ceo_douglas_r__conant": 888, "concept_island_campbell_soup": 889, "concept_person_christodoulos": 890, "concept_organization_greek_orthodox_church": 891, "concept_journalist_lesley_stahl": 892, "concept_automobilemaker_renault": 893, "concept_person_richard_f__velky": 894, "concept_organization_schaghticokes": 895, "concept_ceo_fred_hassan": 896, "concept_biotechcompany_schering": 897, "concept_ceo_mukesh_ambani": 898, "concept_company_reliance_industries": 899, "concept_ceo_montie_brewer": 900, "concept_company_air_canada": 901, "concept_person_kwame_nkrumah": 902, "concept_organization_ghanian": 903, "concept_person_joseph_m__tucci": 904, "concept_ceo_lee_iacocca": 905, "concept_company_chrysler_llc__": 906, "concept_person_john__honey_fitz__fitzgerald": 907, "concept_city_boston": 908, "concept_person_samuel_d__isaly": 909, "concept_organization_orbimed_advisors": 910, "concept_person_stan_sigman": 911, "concept_winery_cingular": 912, "concept_person_brian_reed": 913, "concept_organization_puccini_group": 914, "concept_ceo_jimmy_wales": 915, "concept_bank_contact_us": 916, "concept_journalist_phil_sheridan": 917, "concept_newspaper_philadelphia_inquirer": 918, "concept_person_jeroen_van_der_veer": 919, "concept_bank_royal_dutch_shell": 920, "concept_country_syria": 921, "concept_ceo_fred_goodwin": 922, "concept_bank_royal_bank_of_scotland": 923, "concept_ceo_kun_hee_lee": 924, "concept_company_samsung": 925, "concept_ceo_kumar_birla": 926, "concept_company_hindalco": 927, "concept_ceo_peter_chernin": 928, "concept_journalist_gloria_borger": 929, "concept_ceo_ted_waitt": 930, "concept_biotechcompany_gateway_2000": 931, "concept_ceo_vinod_khosla": 932, "concept_company_sun": 933, "concept_ceo_bob_nardelli": 934, "concept_company_home_depot": 935, "concept_ceo_vijay_mallya": 936, "concept_university_ub": 937, "concept_website_the_washington_post": 938, "concept_person_slobodan_milosevic": 939, "concept_organization_yugoslav": 940, "concept_person_juergen_hubbert": 941, "concept_politician_robert_mugabe": 942, "concept_country_zimbabwe": 943, "concept_person_matt_mullenweg": 944, "concept_blog_wordpress": 945, "concept_journalist_charles_osgood": 946, "concept_ceo_tj_rodgers": 947, "concept_winery_cypress": 948, "concept_ceo_takeo_fukui": 949, "concept_automobilemaker_honda_motor_co__ltd": 950, "concept_ceo_gary_forsee": 951, "concept_company_sprint_nextel": 952, "concept_ceo_ratan_tata": 953, "concept_terroristorganization_militants": 954, "concept_ceo_sandy_weill": 955, "concept_company_aditya_birla_group": 956, "concept_person_susan_newman": 957, "concept_organization_it": 958, "concept_person_jean_todt": 959, "concept_ceo_mary_sammons": 960, "concept_company_rite_aid": 961, "concept_person_raymond_gilmartin": 962, "concept_ceo_terry_semel": 963, "concept_ceo_micky_arison": 964, "concept_company_carnival_cruises": 965, "concept_country_israel": 966, "concept_bank_line": 967, "concept_journalist_warren_anderson": 968, "concept_company_union_carbide": 969, "concept_ceo_peter_altabef": 970, "concept_company_perot_systems": 971, "concept_person_herbert_chitepo": 972, "concept_politicalparty_zimbabwe_african_national_union": 973, "concept_ceo_bill_ford": 974, "concept_governmentorganization_ford_foundation": 975, "concept_politician_mahmoud_abbas": 976, "concept_ceo_bernard_l__madoff": 977, "concept_ceo_bruce_chizen": 978, "concept_journalist_steve_kroft": 979, "concept_ceo_james_cayne": 980, "concept_ceo_olli_pekka_kallasvuo": 981, "concept_biotechcompany_nokia_siemens": 982, "concept_organization_carnival_cruise_lines": 983, "concept_person_ronald_kolka": 984, "concept_company_chrysler": 985, "concept_tradeunion_agreement": 986, "concept_person_thoraya_obaid": 987, "concept_organization_population_fund": 988, "concept_person_lee_r__raymond": 989, "concept_petroleumrefiningcompany_exxon_mobil_corp_": 990, "concept_journalist_trudy_rubin": 991, "concept_ceo_rodger_o__riney": 992, "concept_company_scottrade": 993, "concept_ceo_gerard_arpey": 994, "concept_company_american_airlines001": 995, "concept_ceo_lakshmi_mittal": 996, "concept_company_arcelormittal": 997, "concept_ceo_patricia_woertz": 998, "concept_biotechcompany_archer_daniels_midland": 999, "concept_ceo_jorma_ollila": 1000, "concept_person_jeff_skilling": 1001, "concept_journalist_bill_plante": 1002, "concept_ceo_ferdinand_piech": 1003, "concept_ceo_rem_vyakhirev": 1004, "concept_biotechcompany_gazprom_and_rosneft": 1005, "concept_ceo_charlie_ergen": 1006, "concept_company_dish_network_corporation": 1007, "concept_personeurope_donald_trump": 1008, "concept_company_trump_organization": 1009, "concept_ceo_howard_schultz": 1010, "concept_restaurant_starbucks_coffee_company": 1011, "concept_visualartist_john_thompson": 1012, "concept_bank_symantec": 1013, "concept_person_dave_dombrowski": 1014, "concept_ceo_narendra_patni": 1015, "concept_biotechcompany_patni_computer_systems": 1016, "concept_ceo_bharat_desai": 1017, "concept_biotechcompany_syntel_inc": 1018, "concept_ceo_nicholas_chabraja": 1019, "concept_company_general_dynamics": 1020, "concept_journalist_bob_ford": 1021, "concept_person_v_p__singh": 1022, "concept_musicartist_indian": 1023, "concept_ceo_sergio_marchionne": 1024, "concept_automobilemaker_fiat_spa": 1025, "concept_ceo_john_chidsey": 1026, "concept_company_burger_king_hldgs": 1027, "concept_politician_ed_koch": 1028, "concept_ceo_john_riccitiello": 1029, "concept_company_ea_mobile": 1030, "concept_automobilemaker_chrysler_llc": 1031, "concept_ceo_gordon_nixon": 1032, "concept_biotechcompany_royal_bank_of_canada": 1033, "concept_personafrica_jorge_ramos": 1034, "concept_ceo_dieter_zetsche": 1035, "concept_automobilemaker_mercedes_benz": 1036, "concept_person_archbishop_christodoulos": 1037, "concept_politician_frank_walter_steinmeier": 1038, "concept_organization_german": 1039, "concept_terroristorganization_secular_fatah": 1040, "concept_ceo_willie_walsh": 1041, "concept_company_british_airways": 1042, "concept_person_ski_jump_guru": 1043, "concept_sportsteam_germany": 1044, "concept_ceo_evan_williams": 1045, "concept_company_twitter": 1046, "concept_ceo_stephen_hester": 1047, "concept_bank_royal_bank": 1048, "concept_ceo_jerald_g__fishman": 1049, "concept_biotechcompany_analog_devices": 1050, "concept_ceo_richard_grasso": 1051, "concept_bank_new_york_stock_exchange": 1052, "concept_ceo_andy_grove": 1053, "concept_company_intel": 1054, "concept_city_place": 1055, "concept_journalist_thom_loverro": 1056, "concept_country_west_indies": 1057, "concept_ceo_mel_karmazin": 1058, "concept_biotechcompany_sirius_satellite_radio": 1059, "concept_city_nokia": 1060, "concept_ceo_boone_pickens": 1061, "concept_tradeunion_oil": 1062, "concept_ceo_chad_hurley": 1063, "concept_website_youtube_last_year": 1064, "concept_ceo_s_ramadorai": 1065, "concept_ceo_paul_d__house": 1066, "concept_company_tim_hortons": 1067, "concept_ceo_wolfgang_mayrhuber": 1068, "concept_company_lufthansa": 1069, "concept_person_zoran_djindjic": 1070, "concept_recordlabel_serbia": 1071, "concept_ceo_steven_appleton": 1072, "concept_biotechcompany_micron_technology": 1073, "concept_ceo_fritz_henderson": 1074, "concept_university_ba": 1075, "concept_ceo_millard_drexler": 1076, "concept_company_j__crew": 1077, "concept_retailstore_ford": 1078, "concept_politician_hickenlooper": 1079, "concept_city_denver": 1080, "concept_person_t__boone_pickens": 1081, "concept_person_mark_hackard": 1082, "concept_nongovorganization_nixon_center": 1083, "concept_ceo_ted_turner": 1084, "concept_televisionstation_tbs": 1085, "concept_ceo_jeff_bewkes": 1086, "concept_geopoliticallocation_middle_east": 1087, "concept_personus_craig_newmark": 1088, "concept_company_craigslist": 1089, "concept_politicsblog_supporter": 1090, "concept_ceo_donato_a__montanaro": 1091, "concept_bank_tradeking": 1092, "concept_automobilemaker_volkswagen": 1093, "concept_person_willie_brown": 1094, "concept_ceo_steve_luczo": 1095, "concept_biotechcompany_seagate_technology": 1096, "concept_ceo_john_chambers": 1097, "concept_biotechcompany_cisco_systems_inc_": 1098, "concept_personnorthamerica_daniel_dimicco": 1099, "concept_company_nucor": 1100, "concept_ceo_hiroshi_okuda": 1101, "concept_person_trong": 1102, "concept_organization_central_theoretical_council": 1103, "concept_ceo_jean_claude_trichet": 1104, "concept_bank_european_central_bank": 1105, "concept_ceo_lee_raymond": 1106, "concept_automobilemaker_victory": 1107, "concept_automobilemaker_contact": 1108, "concept_professor_chad_deaton": 1109, "concept_biotechcompany_baker_hughes": 1110, "concept_country_southern_african_country": 1111, "concept_ceo_thomas_middelhoff": 1112, "concept_company_bertelsmann_ag": 1113, "concept_politician_karl_lueger": 1114, "concept_city_vienna": 1115, "concept_biotechcompany_cisco_systems_inc": 1116, "concept_person_ralph_reed": 1117, "concept_professionalorganization_christian_coalition": 1118, "concept_ceo_glenn_f__tilton": 1119, "concept_recordlabel_ual_corporation": 1120, "concept_ceo_jac_nasser": 1121, "concept_person_nikolai_khromov": 1122, "concept_organization_russia_s_olympic_team": 1123, "concept_ceo_herb_kelleher": 1124, "concept_person_philippe_val": 1125, "concept_terroristorganization_charlie_hebdo": 1126, "concept_celebrity_anna_wintour": 1127, "concept_magazine_vogue": 1128, "concept_company_arcelor_mittal": 1129, "concept_restaurant_burger_king": 1130, "concept_person_i": 1131, "concept_organization_the_boston_public_school_system": 1132, "concept_ceo_richard_fairbank": 1133, "concept_company_capital_one_financial": 1134, "concept_politician_kitty_piercy": 1135, "concept_city_eugene": 1136, "concept_ceo_l_a__reid": 1137, "concept_recordlabel_def_jam_records": 1138, "concept_ceo_asa_candler": 1139, "concept_person_molly_moore": 1140, "concept_city_washington_d_c": 1141, "concept_politicsblog_perspective": 1142, "concept_book_new": 1143, "concept_crustacean_nit": 1144, "concept_university_unc_asheville": 1145, "concept_physicalaction_organs": 1146, "concept_website_blood": 1147, "concept_drug_u_s__food_and_drug_administration": 1148, "concept_date_n2004": 1149, "concept_athlete_orlovsky": 1150, "49.1166700000000,18.4333300000000": 1151, "concept_governmentorganization_consumer": 1152, "concept_eventoutcome_result": 1153, "concept_city_attractions": 1154, "concept_beverage_new": 1155, "concept_politicaloffice_new": 1156, "concept_hotel_cardamom_county": 1157, "27.0858000000000,80.3140000000000": 1158, "concept_hotel_nh_grand_hotel_krasnapolsky": 1159, "52.3724000000000,4.8941500000000": 1160, "concept_building_dedicated": 1161, "concept_date_n2000": 1162, "concept_country_offing": 1163, "-53.8333300000000,-70.3833300000000": 1164, "concept_island_orzola": 1165, "29.2166700000000,-13.4500000000000": 1166, "concept_visualizablething_fontainebleau": 1167, "concept_city_vegas": 1168, "concept_traditionalgame_vegas": 1169, "concept_crustacean_kid": 1170, "concept_disease_problems": 1171, "concept_disease_disorder": 1172, "concept_disease_syndrome": 1173, "concept_disease_allergies": 1174, "concept_biotechcompany_american_diabetes_association": 1175, "concept_academicfield_health": 1176, "concept_island_kornati": 1177, "43.8863400000000,15.3782850000000": 1178, "concept_buildingmaterial_bend": 1179, "concept_physicalaction_oregon": 1180, "concept_politicsissue_oregon": 1181, "concept_county_johannes_kepler_university": 1182, "48.3379200000000,14.3207100000000": 1183, "concept_professionalorganization_hsbc_arena": 1184, "concept_airport_buffalo": 1185, "concept_city_friedman": 1186, "concept_stateorprovince_times": 1187, "concept_website_new_york_times": 1188, "concept_politicsblog_ny_times": 1189, "concept_musicartist_times": 1190, "concept_island_mound_key": 1191, "26.5511900000000,-81.9825933333333": 1192, "concept_politicalparty_national_treasury": 1193, "39.6191500000000,-105.7958400000000": 1194, "concept_personcanada_vaughan": 1195, "concept_publication_ontario": 1196, "concept_recordlabel_alligator": 1197, "concept_criminal_arson": 1198, "concept_dateliteral_n2007": 1199, "concept_visualizableobject_dome": 1200, "concept_visualizablescene_observatory": 1201, "concept_buildingfeature_display": 1202, "concept_date_n2003": 1203, "concept_dateliteral_n2006": 1204, "concept_mountainrange_mynydd_preseli": 1205, "51.9583300000000,-4.7833300000000": 1206, "concept_criminal_robert_drummond": 1207, "38.7279000000000,-90.3879000000000": 1208, "concept_person_american_children": 1209, "concept_hotel_animal_kingdom_lodge": 1210, "28.3486000000000,-81.5619000000000": 1211, "concept_city_heathrow": 1212, "concept_city_london_city": 1213, "concept_kitchenitem_tender": 1214, "concept_dateliteral_n2002": 1215, "concept_dateliteral_n2005": 1216, "concept_university_oberlin": 1217, "concept_city_kansas": 1218, "concept_park_republic_square": 1219, "35.1317100000000,-106.5783600000000": 1220, "concept_videogamesystem_ngage": 1221, "-3.2413900000000,30.6602800000000": 1222, "concept_company_kiev": 1223, "concept_date_n2001": 1224, "concept_athlete_ukraine": 1225, "concept_park_roswell": 1226, "concept_county_new_mexico": 1227, "concept_reptile_new_mexico": 1228, "concept_publication_vista": 1229, "concept_buildingfeature_window": 1230, "concept_buildingfeature_windows": 1231, "concept_videogame_mac": 1232, "concept_software_microsoft_windows": 1233, "concept_mountain_salcantay": 1234, "-13.3563914285714,-72.3469428571428": 1235, "concept_writer_vizenor": 1236, "47.0080100000000,-95.8131000000000": 1237, "concept_musicartist_takeo_fukui": 1238, "concept_automobilemaker_honda": 1239, "concept_monument_durrington_walls": 1240, "51.1923900000000,-1.7868200000000": 1241, "concept_bodypart_pathways": 1242, "concept_artery_brain": 1243, "concept_weapon_sam": 1244, "concept_sportsequipment_wheel": 1245, "concept_weapon_run": 1246, "concept_county_trinity_seminary": 1247, "42.5206000000000,-83.0860000000000": 1248, "concept_writer_sulpicia": 1249, "41.7833300000000,-3.3666700000000": 1250, "concept_weapon_rpk": 1251, "26.2752000000000,59.3940000000000": 1252, "concept_trainstation_tri_c": 1253, "37.3602200000000,-120.5640800000000": 1254, "concept_personus_adolf_hitler": 1255, "concept_book_mein_kampf": 1256, "concept_attraction_boardwalk": 1257, "concept_building_vegas": 1258, "concept_island_scott": 1259, "concept_athlete_wta": 1260, "concept_crustacean_tv": 1261, "concept_journalist_walter_cronkite": 1262, "concept_olympics_walter_cronkite": 1263, "concept_automobilemaker_westfield": 1264, "concept_radiostation_new_jersey": 1265, "concept_actor_smoking": 1266, "concept_religion_shahada": 1267, "21.5083350000000,74.3833350000000": 1268, "concept_agent_belarus": 1269, "concept_writer_arrow": 1270, "concept_movie_click": 1271, "concept_person_norman001": 1272, "concept_city_york": 1273, "concept_bird_brancher": 1274, "47.4333300000000,4.0000000000000": 1275, "concept_automobilemodel_same_year": 1276, "concept_mammal_clients": 1277, "concept_disease_injury": 1278, "concept_disease_illnesses": 1279, "concept_disease_illness": 1280, "concept_disease_disorders": 1281, "concept_disease_injuries": 1282, "concept_disease_disabilities": 1283, "concept_chemical_rainfall": 1284, "concept_comedian_mohsin_khan": 1285, "33.9901200000000,71.5516700000000": 1286, "concept_trail_le_meridien_budapest": 1287, "47.4978000000000,19.0516000000000": 1288, "concept_academicfield_account": 1289, "concept_date_n2009": 1290, "concept_dateliteral_n2008": 1291, "concept_weatherphenomenon_water": 1292, "concept_university_wake_forest_university": 1293, 