{"PAD": 0, "DUMMY_START_RELATION": 1, "UNK": 2, "3_47": 3, "6_37": 4, "75_31": 5, "29_69": 6, "75_47": 7, "8_31": 8, "3_72": 9, "3_65": 10, "72_47": 11, "3_69": 12, "10_47": 13, "4_47": 14, "52_31": 15, "48_47": 16, "8_72": 17, "3_31": 18, "3_67": 19, "3_56": 20, "29_47": 21, "66_72": 22, "4_67": 23, "4_65": 24, "29_65": 25, "24_31": 26, "45_31": 27, "70_31": 28, "50_47": 29, "10_65": 30, "3_60": 31, "40_47": 32, "59_47": 33, "47_47": 34, "66_31": 35, "6_31": 36, "47_69": 37, "37_47": 38, "65_47": 39, "13_47": 40, "68_55": 41, "4_31": 42, "25_47": 43, "52_47": 44, "3_10": 45, "43_47": 46, "61_67": 47, "43_31": 48, "32_31": 49, "75_67": 50, "31_4": 51, "69_65": 52, "65_69": 53, "8_8": 54, "70_39": 55, "39_70": 56, "26_53": 57, "53_26": 58, "33_68": 59, "68_33": 60, "40_40": 61, "69_69": 62, "58_73": 63, "73_58": 64, "58_16": 65, "16_58": 66, "31_69": 67, "69_31": 68, "31_10": 69, "10_31": 70, "52_61": 71, "61_52": 72, "66_76": 73, "76_66": 74, "33_73": 75, "73_33": 76, "38_10": 77, "10_38": 78, "38_65": 79, "65_38": 80, "47_35": 81, "35_47": 82, "50_50": 83, "50_57": 84, "57_50": 85, "58_68": 86, "68_58": 87, "4_32": 88, "32_4": 89, "4_70": 90, "70_4": 91, "30_4": 92, "4_30": 93, "71_70": 94, "70_71": 95, "26_26": 96, "31_26": 97, "26_31": 98, "31_31": 99, "47_31": 100, "31_47": 101, "33_16": 102, "16_33": 103, "65_53": 104, "53_65": 105, "65_65": 106, "10_37": 107, "37_10": 108, "64_64": 109, "64_27": 110, "27_64": 111, "64_66": 112, "66_64": 113, "52_45": 114, "45_52": 115, "39_39": 116, "70_70": 117, "65_70": 118, "70_65": 119, "30_16": 120, "16_30": 121, "52_59": 122, "59_52": 123, "52_57": 124, "57_52": 125, "52_52": 126, "48_69": 127, "69_48": 128, "50_54": 129, "54_50": 130, "60_60": 131, "52_27": 132, "27_52": 133, "47_3": 134, "30_73": 135, "73_30": 136, "30_68": 137, "68_30": 138, "72_53": 139, "53_72": 140, "72_26": 141, "26_72": 142, "72_65": 143, "65_72": 144, "72_5": 145, "5_72": 146, "10_12": 147, "12_10": 148, "24_9": 149, "9_24": 150, "42_24": 151, "24_42": 152, "10_10": 153, "24_24": 154, "52_70": 155, "70_52": 156, "49_4": 157, "4_49": 158, "3_12": 159, "12_3": 160, "3_9": 161, "9_3": 162, "10_3": 163, "56_3": 164, "35_65": 165, "65_35": 166, "52_15": 167, "15_52": 168, "45_10": 169, "10_45": 170, "63_10": 171, "10_63": 172, "63_28": 173, "28_63": 174, "63_50": 175, "50_63": 176, "29_70": 177, "70_29": 178, "26_65": 179, "65_26": 180, "26_5": 181, "5_26": 182, "48_8": 183, "8_48": 184, "48_68": 185, "68_48": 186, "64_40": 187, "40_64": 188, "32_24": 189, "24_32": 190, "33_21": 191, "21_33": 192, "59_4": 193, "4_59": 194, "65_5": 195, "5_65": 196, "70_26": 197, "26_70": 198, "70_38": 199, "38_70": 200, "38_53": 201, "53_38": 202, "35_34": 203, "34_35": 204, "67_4": 205, "64_50": 206, "50_64": 207, "64_4": 208, "4_64": 209, "24_49": 210, "49_24": 211, "55_31": 212, "31_55": 213, "41_41": 214, "5_5": 215, "4_50": 216, "50_4": 217, "49_2": 218, "2_49": 219, "49_41": 220, "41_49": 221, "70_10": 222, "10_70": 223, "58_49": 224, "49_58": 225, "66_66": 226, "37_37": 227, "57_31": 228, "31_57": 229, "3_3": 230, "27_48": 231, "48_27": 232, "4_52": 233, "52_4": 234, "4_45": 235, "45_4": 236, "64_65": 237, "65_64": 238, "64_72": 239, "72_64": 240, "45_66": 241, "66_45": 242, "45_15": 243, "15_45": 244, "45_67": 245, "67_45": 246, "41_71": 247, "71_41": 248, "54_54": 249, "54_57": 250, "57_54": 251, "47_72": 252, "32_10": 253, "10_32": 254, "33_34": 255, "34_33": 256, "24_3": 257, "3_24": 258, "57_44": 259, "44_57": 260, "4_44": 261, "44_4": 262, "29_49": 263, "49_29": 264, "5_53": 265, "53_5": 266, "33_13": 267, "13_33": 268, "75_50": 269, "50_75": 270, "75_3": 271, "3_75": 272, "75_65": 273, "65_75": 274, "35_31": 275, "31_35": 276, "44_32": 277, "32_44": 278, "44_44": 279, "44_64": 280, "64_44": 281, "44_76": 282, "76_44": 283, "10_24": 284, "24_10": 285, "10_51": 286, "51_10": 287, "64_10": 288, "10_64": 289, "49_19": 290, "19_49": 291, "30_53": 292, "53_30": 293, "36_17": 294, "17_36": 295, "29_46": 296, "46_29": 297, "72_50": 298, "50_72": 299, "72_72": 300, "47_4": 301, "47_57": 302, "57_47": 303, "47_51": 304, "51_47": 305, "4_12": 306, "12_4": 307, "26_50": 308, "50_26": 309, "72_70": 310, "70_72": 311, "49_66": 312, "66_49": 313, "24_4": 314, "4_24": 315, "10_9": 316, "9_10": 317, "70_16": 318, "16_70": 319, "45_45": 320, "29_66": 321, "66_29": 322, "71_61": 323, "61_71": 324, "65_46": 325, "46_65": 326, "7_57": 327, "57_7": 328, "24_67": 329, "67_24": 330, "69_5": 331, "5_69": 332, "6_29": 333, "29_6": 334, "49_49": 335, "29_16": 336, "16_29": 337, "33_49": 338, "49_33": 339, "36_15": 340, "15_36": 341, "25_25": 342, "38_60": 343, "60_38": 344, "38_38": 345, "70_66": 346, "66_70": 347, "20_34": 348, "34_20": 349, "3_50": 350, "50_3": 351, "10_59": 352, "59_10": 353, "41_27": 354, "27_41": 355, "41_8": 356, "8_41": 357, "41_47": 358, "47_41": 359, "41_40": 360, "40_41": 361, "41_67": 362, "67_41": 363, "41_50": 364, "50_41": 365, "41_61": 366, "61_41": 367, "18_18": 368, "27_4": 369, "4_27": 370, "45_34": 371, "34_45": 372, "57_26": 373, "26_57": 374, "72_31": 375, "31_72": 376, "50_65": 377, "65_50": 378, "50_5": 379, "5_50": 380, "50_38": 381, "38_50": 382, "50_10": 383, "10_50": 384, "50_40": 385, "40_50": 386, "50_69": 387, "69_50": 388, "50_53": 389, "53_50": 390, "49_15": 391, "15_49": 392, "32_32": 393, "32_46": 394, "46_32": 395, "32_56": 396, "56_32": 397, "29_20": 398, "20_29": 399, "4_4": 400, "29_32": 401, "32_29": 402, "72_40": 403, "40_72": 404, "67_50": 405, "50_67": 406, "38_59": 407, "59_38": 408, "34_34": 409, "54_32": 410, "32_54": 411, "54_26": 412, "26_54": 413, "41_2": 414, "2_41": 415, "67_53": 416, "53_67": 417, "67_65": 418, "65_67": 419, "67_67": 420, "67_72": 421, "72_67": 422, "65_4": 423, "24_28": 424, "28_24": 425, "69_67": 426, "67_69": 427, "49_68": 428, "68_49": 429, "69_10": 430, "10_69": 431, "50_31": 432, "31_50": 433, "32_43": 434, "43_32": 435, "25_66": 436, "66_25": 437, "7_10": 438, "10_7": 439, "72_10": 440, "10_72": 441, "72_44": 442, "44_72": 443, "72_4": 444, "4_72": 445, "7_69": 446, "69_7": 447, "31_32": 448, "53_53": 449, "4_51": 450, "51_4": 451, "6_24": 452, "24_6": 453, "6_49": 454, "49_6": 455, "12_12": 456, "12_31": 457, "31_12": 458, "29_3": 459, "3_29": 460, "35_10": 461, "10_35": 462, "67_3": 463, "31_3": 464, "8_53": 465, "53_8": 466, "32_66": 467, "66_32": 468, "30_70": 469, "70_30": 470, "34_4": 471, "4_34": 472, "52_48": 473, "48_52": 474, "52_39": 475, "39_52": 476, "56_56": 477, "51_51": 478, "58_29": 479, "29_58": 480, "58_57": 481, "57_58": 482, "32_47": 483, "47_32": 484, "9_65": 485, "65_9": 486, "72_22": 487, "22_72": 488, "66_18": 489, "18_66": 490, "54_31": 491, "31_54": 492, "32_52": 493, "52_32": 494, "32_57": 495, "57_32": 496, "15_34": 497, "34_15": 498, "8_66": 499, "66_8": 500, "69_47": 501, "3_28": 502, "28_3": 503, "51_31": 504, "31_51": 505, "8_67": 506, "67_8": 507, "8_65": 508, "65_8": 509, "68_29": 510, "29_68": 511, "29_29": 512, "52_54": 513, "54_52": 514, "50_52": 515, "52_50": 516, "50_44": 517, "44_50": 518, "50_27": 519, "27_50": 520, "50_12": 521, "12_50": 522, "47_50": 523, "50_9": 524, "9_50": 525, "47_10": 526, "69_60": 527, "60_69": 528, "29_59": 529, "59_29": 530, "6_6": 531, "6_71": 532, "71_6": 533, "10_46": 534, "46_10": 535, "72_3": 536, "3_34": 537, "34_3": 538, "24_43": 539, "43_24": 540, "63_56": 541, "56_63": 542, "8_73": 543, "73_8": 544, "8_70": 545, "70_8": 546, "29_4": 547, "4_29": 548, "23_23": 549, "23_28": 550, "28_23": 551, "4_43": 552, "43_4": 553, "24_73": 554, "73_24": 555, "55_55": 556, "31_45": 557, "50_59": 558, "59_50": 559, "23_61": 560, "61_23": 561, "37_67": 562, "67_37": 563, "37_56": 564, "56_37": 565, "37_69": 566, "69_37": 567, "37_31": 568, "31_37": 569, "32_39": 570, "39_32": 571, "57_57": 572, "40_27": 573, "27_40": 574, "40_10": 575, "10_40": 576, "33_25": 577, "25_33": 578, "52_49": 579, "49_52": 580, "70_46": 581, "46_70": 582, "49_12": 583, "12_49": 584, "49_71": 585, "71_49": 586, "71_31": 587, "31_71": 588, "71_66": 589, "66_71": 590, "71_71": 591, "49_45": 592, "45_49": 593, "30_18": 594, "18_30": 595, "47_40": 596, "48_31": 597, "31_48": 598, "14_65": 599, "65_14": 600, "64_38": 601, "38_64": 602, "64_17": 603, "17_64": 604, "40_67": 605, "67_40": 606, "40_4": 607, "4_40": 608, "49_30": 609, "30_49": 610, "49_31": 611, "31_49": 612, "29_28": 613, "28_29": 614, "3_26": 615, "26_3": 616, "3_57": 617, "57_3": 618, "3_32": 619, "32_3": 620, "3_44": 621, "44_3": 622, "36_45": 623, "45_36": 624, "61_50": 625, "50_61": 626, "20_16": 627, "16_20": 628, "40_65": 629, "65_40": 630, "52_66": 631, "66_52": 632, "37_68": 633, "68_37": 634, "69_53": 635, "53_69": 636, "32_70": 637, "70_32": 638, "18_53": 639, "53_18": 640, "40_8": 641, "8_40": 642, "40_53": 643, "53_40": 644, "23_52": 645, "52_23": 646, "39_72": 647, "72_39": 648, "27_27": 649, "48_10": 650, "10_48": 651, "55_10": 652, "10_55": 653, "13_8": 654, "8_13": 655, "20_20": 656, "54_4": 657, "4_54": 658, "3_64": 659, "64_3": 660, "3_40": 661, "40_3": 662, "69_72": 663, "72_69": 664, "5_39": 665, "39_5": 666, "72_46": 667, "46_72": 668, "15_53": 669, "53_15": 670, "29_26": 671, "26_29": 672, "7_26": 673, "26_7": 674, "65_37": 675, "37_65": 676, "3_21": 677, "21_3": 678, "15_59": 679, "59_15": 680, "34_18": 681, "18_34": 682, "13_12": 683, "12_13": 684, "24_56": 685, "56_24": 686, "64_8": 687, "8_64": 688, "64_41": 689, "41_64": 690, "64_47": 691, "47_64": 692, "38_26": 693, "26_38": 694, "34_32": 695, "32_34": 696, "6_4": 697, "4_6": 698, "38_5": 699, "5_38": 700, "32_26": 701, "26_32": 702, "65_10": 703, "29_8": 704, "8_29": 705, "69_26": 706, "26_69": 707, "22_22": 708, "38_69": 709, "69_38": 710, "65_29": 711, "26_67": 712, "67_26": 713, "18_50": 714, "50_18": 715, "18_4": 716, "4_18": 717, "71_2": 718, "2_71": 719, "71_23": 720, "23_71": 721, "71_24": 722, "24_71": 723, "47_56": 724, "56_47": 725, "29_24": 726, "24_29": 727, "72_8": 728, "47_65": 729, "40_24": 730, "24_40": 731, "29_53": 732, "53_29": 733, "32_55": 734, "55_32": 735, "44_40": 736, "40_44": 737, "33_24": 738, "24_33": 739, "38_47": 740, "47_38": 741, "26_22": 742, "22_26": 743, "49_70": 744, "70_49": 745, "48_13": 746, "13_48": 747, "50_45": 748, "45_50": 749, "29_39": 750, "39_29": 751, "49_63": 752, "63_49": 753, "8_49": 754, "49_8": 755, "34_26": 756, "26_34": 757, "18_20": 758, "20_18": 759, "27_65": 760, "65_27": 761, "17_73": 762, "73_17": 763, "24_65": 764, "65_24": 765, "24_13": 766, "13_24": 767, "34_39": 768, "39_34": 769, "16_31": 770, "31_16": 771, "47_12": 772, "12_47": 773, "64_49": 774, "49_64": 775, "64_32": 776, "32_64": 777, "64_2": 778, "2_64": 779, "42_42": 780, "38_4": 781, "4_38": 782, "14_50": 783, "50_14": 784, "32_45": 785, "45_32": 786, "52_8": 787, "8_52": 788, "52_29": 789, "29_52": 790, "10_4": 791, "4_10": 792, "54_29": 793, "29_54": 794, "35_35": 795, "35_63": 796, "63_35": 797, "75_75": 798, "75_53": 799, "53_75": 800, "41_23": 801, "23_41": 802, "41_11": 803, "11_41": 804, "67_31": 805, "31_67": 806, "9_9": 807, "15_4": 808, "4_15": 809, "15_15": 810, "7_50": 811, "50_7": 812, "10_60": 813, "60_10": 814, "58_70": 815, "70_58": 816, "52_64": 817, "64_52": 818, "50_28": 819, "28_50": 820, "32_6": 821, "6_32": 822, "57_72": 823, "72_57": 824, "32_76": 825, "76_32": 826, "47_60": 827, "60_47": 828, "24_61": 829, "61_24": 830, "21_15": 831, "15_21": 832, "32_68": 833, "68_32": 834, "46_69": 835, "69_46": 836, "46_37": 837, "37_46": 838, "8_24": 839, "24_8": 840, "13_13": 841, "68_46": 842, "46_68": 843, "70_2": 844, "2_70": 845, "15_65": 846, "65_15": 847, "72_27": 848, "27_72": 849, "74_34": 850, "34_74": 851, "3_6": 852, "6_3": 853, "48_12": 854, "12_48": 855, "17_46": 856, "46_17": 857, "17_38": 858, "38_17": 859, "74_68": 860, "68_74": 861, "20_32": 862, "32_20": 863, "41_19": 864, "19_41": 865, "24_57": 866, "57_24": 867, "55_65": 868, "65_55": 869, "23_25": 870, "25_23": 871, "50_32": 872, "32_50": 873, "50_60": 874, "60_50": 875, "66_65": 876, "65_66": 877, "65_39": 878, "39_65": 879, "41_10": 880, "10_41": 881, "69_27": 882, "27_69": 883, "55_47": 884, "47_55": 885, "55_51": 886, "51_55": 887, "29_57": 888, "57_29": 889, "33_33": 890, "58_3": 891, "3_58": 892, "33_15": 893, "15_33": 894, "30_67": 895, "67_30": 896, "5_46": 897, "46_5": 898, "66_10": 899, "10_66": 900, "4_57": 901, "57_4": 902, "55_50": 903, "50_55": 904, "48_39": 905, "39_48": 906, "38_72": 907, "72_38": 908, "3_49": 909, "49_3": 910, "4_71": 911, "71_4": 912, "31_6": 913, "21_4": 914, "4_21": 915, "30_19": 916, "19_30": 917, "66_24": 918, "24_66": 919, "49_23": 920, "23_49": 921, "54_72": 922, "72_54": 923, "45_48": 924, "48_45": 925, "45_8": 926, "8_45": 927, "70_50": 928, "50_70": 929, "28_54": 930, "54_28": 931, "4_33": 932, "33_4": 933, "55_53": 934, "53_55": 935, "55_67": 936, "67_55": 937, "49_73": 938, "73_49": 939, "50_46": 940, "46_50": 941, "43_39": 942, "39_43": 943, "3_61": 944, "61_3": 945, "46_46": 946, "49_55": 947, "55_49": 948, "24_15": 949, "15_24": 950, "12_57": 951, "57_12": 952, "12_51": 953, "51_12": 954, "3_13": 955, "13_3": 956, "70_11": 957, "11_70": 958, "26_46": 959, "46_26": 960, "26_28": 961, "28_26": 962, "10_67": 963, "67_10": 964, "66_67": 965, "67_66": 966, "26_47": 967, "47_26": 968, "22_70": 969, "70_22": 970, "22_65": 971, "65_22": 972, "31_8": 973, "31_53": 974, "53_31": 975, "31_63": 976, "63_31": 977, "72_75": 978, "75_72": 979, "4_56": 980, "56_4": 981, "33_8": 982, "8_33": 983, "69_70": 984, "70_69": 985, "43_65": 986, "65_43": 987, "72_73": 988, "73_72": 989, "34_71": 990, "71_34": 991, "29_51": 992, "51_29": 993, "4_26": 994, "26_4": 995, "24_70": 996, "70_24": 997, "45_64": 998, "64_45": 999, "29_67": 1000, "67_29": 1001, "25_20": 1002, "20_25": 1003, "32_49": 1004, "49_32": 1005, "30_58": 1006, "58_30": 1007, "27_70": 1008, "70_27": 1009, "50_49": 1010, "49_50": 1011, "10_56": 1012, "56_10": 1013, "10_44": 1014, "44_10": 1015, "10_57": 1016, "57_10": 1017, "10_75": 1018, "75_10": 1019, "10_18": 1020, "18_10": 1021, "64_53": 1022, "53_64": 1023, "43_43": 1024, "10_53": 1025, "53_10": 1026, "32_53": 1027, "53_32": 1028, "12_16": 1029, "16_12": 1030, "8_59": 1031, "59_8": 1032, "25_70": 1033, "70_25": 1034, "25_3": 1035, "3_25": 1036, "25_65": 1037, "65_25": 1038, "45_29": 1039, "29_45": 1040, "35_37": 1041, "37_35": 1042, "35_28": 1043, "28_35": 1044, "21_70": 1045, "70_21": 1046, "38_40": 1047, "40_38": 1048, "57_45": 1049, "45_57": 1050, "29_61": 1051, "61_29": 1052, "24_55": 1053, "55_24": 1054, "31_75": 1055, "75_56": 1056, "56_75": 1057, "49_72": 1058, "72_49": 1059, "70_15": 1060, "15_70": 1061, "51_3": 1062, "3_51": 1063, "18_7": 1064, "7_18": 1065, "42_10": 1066, "10_42": 1067, "37_70": 1068, "70_37": 1069, "7_31": 1070, "31_7": 1071, "4_28": 1072, "28_4": 1073, "48_70": 1074, "70_48": 1075, "34_21": 1076, "21_34": 1077, "69_56": 1078, "56_69": 1079, "70_73": 1080, "73_70": 1081, "63_34": 1082, "34_63": 1083, "70_59": 1084, "59_70": 1085, "64_57": 1086, "57_64": 1087, "70_45": 1088, "45_70": 1089, "45_24": 1090, "24_45": 1091, "45_53": 1092, "53_45": 1093, "50_30": 1094, "30_50": 1095, "23_26": 1096, "26_23": 1097, "12_34": 1098, "34_12": 1099, "12_56": 1100, "56_12": 1101, "22_38": 1102, "38_22": 1103, "47_67": 1104, "67_47": 1105, "29_76": 1106, "76_29": 1107, "70_34": 1108, "34_70": 1109, "4_3": 1110, "3_4": 1111, "49_46": 1112, "46_49": 1113, "7_8": 1114, "8_7": 1115, "30_45": 1116, "45_30": 1117, "23_31": 1118, "31_23": 1119, "74_72": 1120, "72_74": 1121, "24_16": 1122, "16_24": 1123, "71_10": 1124, "10_71": 1125, "73_15": 1126, "15_73": 1127, "69_64": 1128, "64_69": 1129, "23_2": 1130, "2_23": 1131, "54_65": 1132, "65_54": 1133, "5_14": 1134, "14_5": 1135, "48_3": 1136, "3_48": 1137, "46_53": 1138, "53_46": 1139, "15_48": 1140, "48_15": 1141, "36_65": 1142, "65_36": 1143, "45_65": 1144, "65_45": 1145, "48_72": 1146, "72_48": 1147, "65_56": 1148, "56_65": 1149, "3_30": 1150, "30_3": 1151, "30_71": 1152, "71_30": 1153, "12_65": 1154, "65_12": 1155, "29_44": 1156, "44_29": 1157, "66_47": 1158, "47_66": 1159, "40_69": 1160, "69_40": 1161, "21_59": 1162, "59_21": 1163, "47_13": 1164, "13_59": 1165, "59_13": 1166, "63_53": 1167, "53_63": 1168, "63_26": 1169, "26_63": 1170, "63_4": 1171, "4_63": 1172, "7_44": 1173, "44_7": 1174, "26_64": 1175, "64_26": 1176, "66_50": 1177, "50_66": 1178, "9_4": 1179, "4_9": 1180, "48_49": 1181, "49_48": 1182, "49_57": 1183, "57_49": 1184, "18_26": 1185, "26_18": 1186, "48_4": 1187, "4_48": 1188, "34_68": 1189, "68_34": 1190, "4_37": 1191, "37_4": 1192, "44_26": 1193, "26_44": 1194, "5_70": 1195, "70_5": 1196, "69_34": 1197, "34_69": 1198, "28_31": 1199, "31_28": 1200, "26_10": 1201, "10_26": 1202, "66_4": 1203, "4_66": 1204, "42_61": 1205, "61_42": 1206, "28_28": 1207, "26_6": 1208, "6_26": 1209, "10_34": 1210, "34_10": 1211, "43_46": 1212, "46_43": 1213, "9_39": 1214, "39_9": 1215, "24_39": 1216, "39_24": 1217, "54_16": 1218, "16_54": 1219, "40_26": 1220, "26_40": 1221, "64_5": 1222, "5_64": 1223, "22_53": 1224, "53_22": 1225, "27_29": 1226, "29_27": 1227, "40_12": 1228, "12_40": 1229, "34_24": 1230, "24_34": 1231, "3_15": 1232, "15_3": 1233, "27_10": 1234, "10_27": 1235, "46_61": 1236, "61_46": 1237, "18_67": 1238, "67_18": 1239, "34_73": 1240, "73_34": 1241, "52_73": 1242, "73_52": 1243, "50_15": 1244, "15_50": 1245, "30_30": 1246, "70_19": 1247, "19_70": 1248, "70_68": 1249, "68_70": 1250, "70_6": 1251, "6_70": 1252, "70_64": 1253, "64_70": 1254, "60_65": 1255, "65_60": 1256, "44_69": 1257, "69_44": 1258, "44_65": 1259, "65_44": 1260, "44_27": 1261, "27_44": 1262, "72_66": 1263, "72_18": 1264, "18_72": 1265, "49_34": 1266, "34_49": 1267, "23_72": 1268, "72_23": 1269, "23_12": 1270, "12_23": 1271, "19_24": 1272, "24_19": 1273, "8_16": 1274, "16_8": 1275, "60_34": 1276, "34_60": 1277, "37_73": 1278, "73_37": 1279, "29_15": 1280, "15_29": 1281, "74_67": 1282, "67_74": 1283, "52_55": 1284, "55_52": 1285, "32_18": 1286, "18_32": 1287, "32_38": 1288, "38_32": 1289, "64_36": 1290, "36_64": 1291, "49_53": 1292, "53_49": 1293, "48_50": 1294, "50_48": 1295, "48_65": 1296, "65_48": 1297, "34_29": 1298, "29_34": 1299, "41_66": 1300, "66_41": 1301, "41_25": 1302, "25_41": 1303, "4_69": 1304, "69_4": 1305, "41_69": 1306, "69_41": 1307, "41_12": 1308, "12_41": 1309, "8_32": 1310, "32_8": 1311, "39_68": 1312, "68_39": 1313, "64_24": 1314, "24_64": 1315, "47_44": 1316, "44_47": 1317, "10_28": 1318, "28_10": 1319, "67_34": 1320, "34_67": 1321, "32_61": 1322, "61_32": 1323, "27_53": 1324, "53_27": 1325, "65_31": 1326, "31_65": 1327, "17_32": 1328, "32_17": 1329, "4_5": 1330, "5_4": 1331, "31_52": 1332, "6_68": 1333, "68_6": 1334, "47_74": 1335, "74_47": 1336, "75_55": 1337, "55_75": 1338, "32_72": 1339, "72_32": 1340, "26_39": 1341, "39_26": 1342, "57_46": 1343, "46_57": 1344, "3_70": 1345, "70_3": 1346, "53_28": 1347, "28_53": 1348, "31_24": 1349, "29_71": 1350, "71_29": 1351, "29_12": 1352, "12_29": 1353, "45_3": 1354, "3_45": 1355, "45_19": 1356, "19_45": 1357, "43_75": 1358, "75_43": 1359, "7_29": 1360, "29_7": 1361, "52_12": 1362, "12_52": 1363, "57_63": 1364, "63_57": 1365, "30_41": 1366, "41_30": 1367, "57_56": 1368, "56_57": 1369, "29_73": 1370, "73_29": 1371, "49_67": 1372, "67_49": 1373, "21_72": 1374, "72_21": 1375, "12_20": 1376, "20_12": 1377, "24_53": 1378, "53_24": 1379, "42_3": 1380, "3_42": 1381, "33_45": 1382, "45_33": 1383, "33_55": 1384, "55_33": 1385, "61_68": 1386, "68_61": 1387, "34_51": 1388, "51_34": 1389, "35_53": 1390, "53_35": 1391, "48_34": 1392, "34_48": 1393, "49_76": 1394, "76_49": 1395, "32_27": 1396, "27_32": 1397, "52_3": 1398, "3_52": 1399, "35_69": 1400, "69_35": 1401, "24_54": 1402, "54_24": 1403, "43_67": 1404, "67_43": 1405, "35_72": 1406, "72_35": 1407, "7_7": 1408, "32_30": 1409, "30_32": 1410, "38_61": 1411, "61_38": 1412, "34_19": 1413, "19_34": 1414, "10_16": 1415, "16_10": 1416, "5_28": 1417, "28_5": 1418, "5_73": 1419, "73_5": 1420, "5_71": 1421, "71_5": 1422, "5_13": 1423, "13_5": 1424, "33_6": 1425, "6_33": 1426, "3_27": 1427, "27_3": 1428, "3_66": 1429, "66_3": 1430, "68_18": 1431, "18_68": 1432, "36_69": 1433, "69_36": 1434, "12_32": 1435, "32_12": 1436, "30_15": 1437, "15_30": 1438, "38_39": 1439, "39_38": 1440, "70_57": 1441, "57_70": 1442, "18_31": 1443, "31_18": 1444, "70_61": 1445, "61_70": 1446, "4_13": 1447, "13_4": 1448, "31_70": 1449, "48_55": 1450, "55_48": 1451, "21_69": 1452, "69_21": 1453, "66_5": 1454, "5_66": 1455, "66_68": 1456, "68_66": 1457, "21_50": 1458, "50_21": 1459, "37_34": 1460, "34_37": 1461, "58_19": 1462, "19_58": 1463, "48_26": 1464, "26_48": 1465, "71_25": 1466, "25_71": 1467, "71_26": 1468, "26_71": 1469, "49_18": 1470, "18_49": 1471, "73_16": 1472, "16_73": 1473, "33_10": 1474, "10_33": 1475, "48_18": 1476, "18_48": 1477, "52_38": 1478, "38_52": 1479, "57_28": 1480, "28_57": 1481, "71_72": 1482, "72_71": 1483, "56_26": 1484, "26_56": 1485, "56_72": 1486, "72_56": 1487, "56_73": 1488, "73_56": 1489, "56_50": 1490, "50_56": 1491, "40_2": 1492, "2_40": 1493, "58_45": 1494, "45_58": 1495, "34_17": 1496, "17_34": 1497, "57_55": 1498, "55_57": 1499, "23_19": 1500, "19_23": 1501, "66_27": 1502, "27_66": 1503, "32_16": 1504, "16_32": 1505, "5_45": 1506, "45_5": 1507, "31_43": 1508, "31_56": 1509, "56_31": 1510, "44_18": 1511, "18_44": 1512, "43_66": 1513, "66_43": 1514, "33_66": 1515, "66_33": 1516, "34_53": 1517, "53_34": 1518, "58_31": 1519, "31_58": 1520, "52_26": 1521, "26_52": 1522, "18_59": 1523, "59_18": 1524, "38_67": 1525, "67_38": 1526, "30_24": 1527, "24_30": 1528, "42_4": 1529, "4_42": 1530, "51_15": 1531, "15_51": 1532, "65_21": 1533, "21_65": 1534, "65_3": 1535, "52_65": 1536, "65_52": 1537, "30_12": 1538, "12_30": 1539, "52_18": 1540, "18_52": 1541, "28_25": 1542, "25_28": 1543, "18_64": 1544, "64_18": 1545, "26_24": 1546, "24_26": 1547, "66_63": 1548, "63_66": 1549, "34_66": 1550, "66_34": 1551, "57_61": 1552, "61_57": 1553, "57_51": 1554, "51_57": 1555, "57_9": 1556, "9_57": 1557, "4_55": 1558, "55_4": 1559, "51_59": 1560, "59_51": 1561, "6_16": 1562, "16_6": 1563, "70_76": 1564, "76_70": 1565, "28_49": 1566, "49_28": 1567, "31_60": 1568, "60_31": 1569, "43_50": 1570, "50_43": 1571, "67_68": 1572, "68_67": 1573, "23_4": 1574, "4_23": 1575, "75_12": 1576, "12_75": 1577, "6_18": 1578, "18_6": 1579, "49_26": 1580, "26_49": 1581, "64_55": 1582, "55_64": 1583, "26_15": 1584, "15_26": 1585, "38_16": 1586, "16_38": 1587, "47_52": 1588, "32_67": 1589, "67_32": 1590, "42_12": 1591, "12_42": 1592, "64_67": 1593, "67_64": 1594, "69_57": 1595, "57_69": 1596, "69_63": 1597, "63_69": 1598, "69_28": 1599, "28_69": 1600, "69_17": 1601, "17_69": 1602, "70_54": 1603, "54_70": 1604, "49_54": 1605, "54_49": 1606, "47_37": 1607, "28_12": 1608, "12_28": 1609, "49_25": 1610, "25_49": 1611, "43_10": 1612, "10_43": 1613, "55_60": 1614, "60_55": 1615, "40_15": 1616, "15_40": 1617, "40_66": 1618, "66_40": 1619, "18_47": 1620, "47_18": 1621, "33_65": 1622, "65_33": 1623, "19_25": 1624, "25_19": 1625, "8_26": 1626, "26_8": 1627, "74_4": 1628, "4_74": 1629, "34_65": 1630, "65_34": 1631, "40_25": 1632, "25_40": 1633, "29_13": 1634, "13_29": 1635, "25_24": 1636, "24_25": 1637, "50_8": 1638, "8_50": 1639, "50_71": 1640, "71_50": 1641, "52_72": 1642, "72_52": 1643, "70_67": 1644, "67_70": 1645, "5_49": 1646, "49_5": 1647, "72_43": 1648, "43_72": 1649, "74_53": 1650, "53_74": 1651, "34_59": 1652, "59_34": 1653, "43_70": 1654, "70_43": 1655, "43_64": 1656, "64_43": 1657, "67_27": 1658, "27_67": 1659, "3_59": 1660, "59_3": 1661, "3_33": 1662, "33_3": 1663, "43_3": 1664, "3_43": 1665, "6_42": 1666, "42_6": 1667, "47_63": 1668, "63_47": 1669, "52_56": 1670, "56_52": 1671, "27_18": 1672, "18_27": 1673, "15_18": 1674, "18_15": 1675, "29_50": 1676, "50_29": 1677, "10_76": 1678, "76_10": 1679, "23_70": 1680, "70_23": 1681, "47_53": 1682, "53_47": 1683, "64_30": 1684, "30_64": 1685, "24_12": 1686, "12_24": 1687, "48_48": 1688, "32_63": 1689, "63_32": 1690, "66_26": 1691, "26_66": 1692, "21_73": 1693, "73_21": 1694, "52_34": 1695, "34_52": 1696, "50_58": 1697, "58_50": 1698, "50_76": 1699, "76_50": 1700, "48_29": 1701, "29_48": 1702, "25_10": 1703, "10_25": 1704, "21_53": 1705, "53_21": 1706, "30_28": 1707, "28_30": 1708, "8_76": 1709, "76_8": 1710, "54_12": 1711, "12_54": 1712, "7_70": 1713, "70_7": 1714, "50_73": 1715, "73_50": 1716, "48_73": 1717, "73_48": 1718, "69_3": 1719, "39_45": 1720, "45_39": 1721, "6_28": 1722, "28_6": 1723, "52_24": 1724, "24_52": 1725, "66_12": 1726, "12_66": 1727, "64_15": 1728, "15_64": 1729, "57_76": 1730, "76_57": 1731, "37_53": 1732, "53_37": 1733, "43_57": 1734, "57_43": 1735, "29_2": 1736, "2_29": 1737, "61_65": 1738, "65_61": 1739, "37_38": 1740, "38_37": 1741, "44_53": 1742, "53_44": 1743, "54_63": 1744, "63_54": 1745, "40_71": 1746, "71_40": 1747, "48_24": 1748, "24_48": 1749, "73_31": 1750, "31_73": 1751, "73_66": 1752, "66_73": 1753, "38_27": 1754, "27_38": 1755, "32_69": 1756, "69_32": 1757, "21_64": 1758, "64_21": 1759, "52_37": 1760, "37_52": 1761, "30_8": 1762, "8_30": 1763, "3_7": 1764, "7_3": 1765, "75_5": 1766, "5_75": 1767, "75_52": 1768, "52_75": 1769, "57_53": 1770, "53_57": 1771, "72_9": 1772, "9_72": 1773, "58_71": 1774, "71_58": 1775, "36_38": 1776, "38_36": 1777, "8_25": 1778, "25_8": 1779, "47_43": 1780, "41_6": 1781, "6_41": 1782, "9_69": 1783, "69_9": 1784, "54_45": 1785, "45_54": 1786, "12_70": 1787, "70_12": 1788, "12_67": 1789, "67_12": 1790, "72_45": 1791, "45_72": 1792, "57_42": 1793, "42_57": 1794, "57_18": 1795, "18_57": 1796, "57_66": 1797, "66_57": 1798, "12_37": 1799, "37_12": 1800, "71_67": 1801, "67_71": 1802, "6_15": 1803, "15_6": 1804, "50_35": 1805, "35_50": 1806, "6_25": 1807, "25_6": 1808, "50_24": 1809, "24_50": 1810, "31_66": 1811, "40_5": 1812, "5_40": 1813, "64_46": 1814, "46_64": 1815, "64_31": 1816, "31_64": 1817, "16_16": 1818, "8_4": 1819, "4_8": 1820, "12_53": 1821, "53_12": 1822, "12_45": 1823, "45_12": 1824, "12_19": 1825, "19_12": 1826, "72_51": 1827, "51_72": 1828, "24_59": 1829, "59_24": 1830, "10_13": 1831, "13_10": 1832, "51_67": 1833, "67_51": 1834, "51_28": 1835, "28_51": 1836, "51_37": 1837, "37_51": 1838, "51_56": 1839, "56_51": 1840, "51_53": 1841, "53_51": 1842, "29_30": 1843, "30_29": 1844, "70_18": 1845, "18_70": 1846, "66_56": 1847, "56_66": 1848, "26_45": 1849, "45_26": 1850, "44_31": 1851, "31_44": 1852, "8_15": 1853, "15_8": 1854, "7_67": 1855, "67_7": 1856, "3_53": 1857, "53_3": 1858, "20_70": 1859, "70_20": 1860, "6_30": 1861, "30_6": 1862, "53_56": 1863, "56_53": 1864, "73_27": 1865, "27_73": 1866, "4_53": 1867, "53_4": 1868, "6_45": 1869, "45_6": 1870, "27_49": 1871, "49_27": 1872, "21_48": 1873, "48_21": 1874, "54_34": 1875, "34_54": 1876, "49_7": 1877, "7_49": 1878, "64_71": 1879, "71_64": 1880, "15_17": 1881, "17_15": 1882, "13_31": 1883, "31_13": 1884, "35_60": 1885, "60_35": 1886, "2_2": 1887, "23_45": 1888, "45_23": 1889, "49_16": 1890, "16_49": 1891, "40_31": 1892, "31_40": 1893, "68_65": 1894, "65_68": 1895, "12_55": 1896, "55_12": 1897, "28_72": 1898, "72_28": 1899, "49_74": 1900, "74_49": 1901, "76_53": 1902, "53_76": 1903, "38_46": 1904, "46_38": 1905, "3_8": 1906, "8_3": 1907, "12_27": 1908, "27_12": 1909, "12_8": 1910, "8_12": 1911, "64_76": 1912, "76_64": 1913, "64_56": 1914, "56_64": 1915, "44_66": 1916, "66_44": 1917, "18_65": 1918, "65_18": 1919, "45_25": 1920, "25_45": 1921, "58_2": 1922, "2_58": 1923, "35_40": 1924, "40_35": 1925, "24_51": 1926, "51_24": 1927, "70_53": 1928, "53_70": 1929, "30_48": 1930, "48_30": 1931, "30_25": 1932, "25_30": 1933, "54_56": 1934, "56_54": 1935, "20_31": 1936, "31_20": 1937, "54_8": 1938, "8_54": 1939, "28_59": 1940, "59_28": 1941, "66_15": 1942, "15_66": 1943, "3_74": 1944, "74_3": 1945, "20_4": 1946, "4_20": 1947, "10_68": 1948, "68_10": 1949, "16_66": 1950, "66_16": 1951, "26_17": 1952, "17_26": 1953, "51_58": 1954, "58_51": 1955, "51_13": 1956, "13_51": 1957, "74_73": 1958, "73_74": 1959, "67_25": 1960, "25_67": 1961, "58_8": 1962, "8_58": 1963, "57_68": 1964, "68_57": 1965, "3_20": 1966, "20_3": 1967, "57_67": 1968, "67_57": 1969, "5_16": 1970, "16_5": 1971, "53_48": 1972, "48_53": 1973, "53_23": 1974, "23_53": 1975, "53_71": 1976, "71_53": 1977, "6_61": 1978, "61_6": 1979, "29_56": 1980, "56_29": 1981, "64_59": 1982, "59_64": 1983, "54_55": 1984, "55_54": 1985, "35_55": 1986, "55_35": 1987, "44_35": 1988, "35_44": 1989, "7_72": 1990, "72_7": 1991, "15_31": 1992, "31_15": 1993, "24_68": 1994, "68_24": 1995, "52_30": 1996, "30_52": 1997, "9_31": 1998, "31_9": 1999, "58_34": 2000, "34_58": 2001, "8_57": 2002, "57_8": 2003, "29_18": 2004, "18_29": 2005, "42_7": 2006, "7_42": 2007, "42_31": 2008, "31_42": 2009, "68_4": 2010, "4_68": 2011, "64_29": 2012, "29_64": 2013, "64_7": 2014, "7_64": 2015, "14_72": 2016, "72_14": 2017, "49_51": 2018, "51_49": 2019, "60_26": 2020, "26_60": 2021, "4_35": 2022, "35_4": 2023, "40_75": 2024, "75_40": 2025, "8_18": 2026, "18_8": 2027, "29_38": 2028, "38_29": 2029, "32_25": 2030, "25_32": 2031, "74_10": 2032, "10_74": 2033, "3_5": 2034, "5_3": 2035, "19_9": 2036, "9_19": 2037, "45_69": 2038, "69_45": 2039, "17_72": 2040, "72_17": 2041, "48_35": 2042, "35_48": 2043, "18_25": 2044, "25_18": 2045, "46_4": 2046, "4_46": 2047, "64_48": 2048, "48_64": 2049, "42_26": 2050, "26_42": 2051, "10_5": 2052, "5_10": 2053, "51_9": 2054, "9_51": 2055, "37_72": 2056, "72_37": 2057, "19_18": 2058, "18_19": 2059, "59_65": 2060, "65_59": 2061, "72_15": 2062, "15_72": 2063, "7_65": 2064, "65_7": 2065, "8_71": 2066, "71_8": 2067, "30_72": 2068, "72_30": 2069, "12_72": 2070, "72_12": 2071, "13_28": 2072, "28_13": 2073, "17_65": 2074, "65_17": 2075, "52_58": 2076, "58_52": 2077, "49_38": 2078, "38_49": 2079, "30_34": 2080, "34_30": 2081, "19_68": 2082, "68_19": 2083, "74_74": 2084, "13_65": 2085, "65_13": 2086, "10_20": 2087, "20_10": 2088, "61_4": 2089, "4_61": 2090, "49_39": 2091, "39_49": 2092, "23_24": 2093, "24_23": 2094, "32_60": 2095, "60_32": 2096, "18_61": 2097, "61_18": 2098, "75_54": 2099, "54_75": 2100, "33_70": 2101, "70_33": 2102, "41_65": 2103, "65_41": 2104, "43_2": 2105, "2_43": 2106, "8_44": 2107, "44_8": 2108, "32_58": 2109, "58_32": 2110, "40_49": 2111, "49_40": 2112, "35_24": 2113, "24_35": 2114, "36_24": 2115, "24_36": 2116, "7_47": 2117, "47_7": 2118, "7_54": 2119, "54_7": 2120, "7_32": 2121, "32_7": 2122, "23_6": 2123, "6_23": 2124, "74_29": 2125, "29_74": 2126, "5_17": 2127, "17_5": 2128, "58_23": 2129, "23_58": 2130, "25_48": 2131, "48_25": 2132, "3_37": 2133, "37_3": 2134, "54_3": 2135, "3_54": 2136, "10_61": 2137, "61_10": 2138, "3_68": 2139, "68_3": 2140, "21_10": 2141, "10_21": 2142, "49_59": 2143, "59_49": 2144, "32_28": 2145, "28_32": 2146, "42_49": 2147, "49_42": 2148, "44_56": 2149, "56_44": 2150, "47_48": 2151, "48_67": 2152, "67_48": 2153, "57_65": 2154, "65_57": 2155, "27_26": 2156, "26_27": 2157, "27_59": 2158, "59_27": 2159, "58_58": 2160, "26_73": 2161, "73_26": 2162, "43_48": 2163, "48_43": 2164, "52_13": 2165, "13_52": 2166, "6_67": 2167, "67_6": 2168, "59_48": 2169, "48_59": 2170, "38_31": 2171, "31_38": 2172, "38_35": 2173, "35_38": 2174, "18_69": 2175, "69_18": 2176, "69_39": 2177, "39_69": 2178, "3_71": 2179, "71_3": 2180, "34_25": 2181, "25_34": 2182, "27_23": 2183, "23_27": 2184, "65_63": 2185, "63_65": 2186, "10_58": 2187, "58_10": 2188, "47_28": 2189, "28_47": 2190, "48_56": 2191, "56_48": 2192, "48_42": 2193, "42_48": 2194, "3_55": 2195, "55_3": 2196, "8_23": 2197, "23_8": 2198, "29_43": 2199, "43_29": 2200, "29_55": 2201, "55_29": 2202, "20_19": 2203, "19_20": 2204, "55_59": 2205, "59_55": 2206, "64_9": 2207, "9_64": 2208, "58_24": 2209, "24_58": 2210, "38_73": 2211, "73_38": 2212, "38_3": 2213, "3_38": 2214, "43_26": 2215, "26_43": 2216, "36_70": 2217, "70_36": 2218, "36_46": 2219, "46_36": 2220, "36_72": 2221, "72_36": 2222, "29_23": 2223, "23_29": 2224, "3_39": 2225, "39_3": 2226, "19_29": 2227, "29_19": 2228, "62_62": 2229, "52_68": 2230, "68_52": 2231, "35_26": 2232, "26_35": 2233, "29_31": 2234, "31_29": 2235, "15_67": 2236, "67_15": 2237, "55_56": 2238, "56_55": 2239, "25_68": 2240, "68_25": 2241, "41_34": 2242, "34_41": 2243, "60_3": 2244, "50_6": 2245, "6_50": 2246, "50_17": 2247, "17_50": 2248, "24_20": 2249, "20_24": 2250, "33_48": 2251, "48_33": 2252, "59_23": 2253, "23_59": 2254, "54_25": 2255, "25_54": 2256, "71_32": 2257, "32_71": 2258, "39_53": 2259, "53_39": 2260, "66_53": 2261, "53_66": 2262, "54_68": 2263, "68_54": 2264, "58_65": 2265, "65_58": 2266, "6_20": 2267, "20_6": 2268, "34_31": 2269, "31_34": 2270, "13_39": 2271, "39_13": 2272, "45_76": 2273, "76_45": 2274, "17_17": 2275, "55_63": 2276, "63_55": 2277, "66_39": 2278, "39_66": 2279, "15_25": 2280, "25_15": 2281, "37_26": 2282, "26_37": 2283, "39_36": 2284, "36_39": 2285, "35_56": 2286, "56_35": 2287, "40_54": 2288, "54_40": 2289, "52_16": 2290, "16_52": 2291, "34_16": 2292, "16_34": 2293, "67_56": 2294, "56_67": 2295, "67_60": 2296, "60_67": 2297, "67_63": 2298, "63_67": 2299, "45_28": 2300, "28_45": 2301, "8_27": 2302, "27_8": 2303, "6_59": 2304, "59_6": 2305, "5_27": 2306, "27_5": 2307, "14_14": 2308, "43_25": 2309, "25_43": 2310, "34_46": 2311, "46_34": 2312, "42_2": 2313, "2_42": 2314, "34_57": 2315, "57_34": 2316, "51_50": 2317, "50_51": 2318, "68_53": 2319, "53_68": 2320, "49_13": 2321, "13_49": 2322, "66_55": 2323, "55_66": 2324, "29_9": 2325, "9_29": 2326, "50_34": 2327, "34_50": 2328, "5_35": 2329, "35_5": 2330, "21_24": 2331, "24_21": 2332, "21_52": 2333, "52_21": 2334, "21_66": 2335, "66_21": 2336, "21_18": 2337, "18_21": 2338, "15_27": 2339, "27_15": 2340, "3_35": 2341, "35_3": 2342, "40_61": 2343, "61_40": 2344, "49_61": 2345, "61_49": 2346, "40_48": 2347, "48_40": 2348, "68_68": 2349, "54_13": 2350, "13_54": 2351, "57_40": 2352, "40_57": 2353, "8_34": 2354, "34_8": 2355, "45_16": 2356, "16_45": 2357, "66_6": 2358, "6_66": 2359, "29_72": 2360, "72_29": 2361, "59_41": 2362, "41_59": 2363, "8_61": 2364, "61_8": 2365, "72_16": 2366, "16_72": 2367, "28_73": 2368, "73_28": 2369, "63_63": 2370, "63_72": 2371, "72_63": 2372, "63_37": 2373, "37_63": 2374, "63_12": 2375, "12_63": 2376, "63_60": 2377, "60_63": 2378, "69_61": 2379, "61_69": 2380, "14_64": 2381, "64_14": 2382, "21_43": 2383, "43_21": 2384, "48_71": 2385, "71_48": 2386, "26_61": 2387, "61_26": 2388, "67_59": 2389, "59_67": 2390, "47_75": 2391, "75_9": 2392, "9_75": 2393, "75_64": 2394, "64_75": 2395, "34_61": 2396, "61_34": 2397, "11_10": 2398, "10_11": 2399, "11_8": 2400, "8_11": 2401, "30_33": 2402, "33_30": 2403, "41_28": 2404, "28_41": 2405, "46_73": 2406, "73_46": 2407, "42_15": 2408, "15_42": 2409, "37_16": 2410, "16_37": 2411, "35_12": 2412, "12_35": 2413, "35_57": 2414, "57_35": 2415, "10_73": 2416, "73_10": 2417, "67_54": 2418, "54_67": 2419, "52_28": 2420, "28_52": 2421, "55_69": 2422, "69_55": 2423, "18_45": 2424, "45_18": 2425, "43_54": 2426, "54_43": 2427, "15_71": 2428, "71_15": 2429, "15_23": 2430, "23_15": 2431, "20_71": 2432, "71_20": 2433, "42_47": 2434, "47_42": 2435, "52_67": 2436, "67_52": 2437, "58_48": 2438, "48_58": 2439, "45_7": 2440, "7_45": 2441, "45_37": 2442, "37_45": 2443, "45_55": 2444, "55_45": 2445, "61_15": 2446, "15_61": 2447, "58_67": 2448, "67_58": 2449, "16_68": 2450, "68_16": 2451, "30_65": 2452, "65_30": 2453, "43_56": 2454, "56_43": 2455, "6_48": 2456, "48_6": 2457, "9_53": 2458, "53_9": 2459, "3_73": 2460, "73_3": 2461, "76_18": 2462, "18_76": 2463, "76_46": 2464, "46_76": 2465, "7_4": 2466, "4_7": 2467, "37_55": 2468, "55_37": 2469, "45_63": 2470, "63_45": 2471, "45_46": 2472, "46_45": 2473, "48_63": 2474, "63_48": 2475, "24_18": 2476, "18_24": 2477, "4_16": 2478, "16_4": 2479, "72_60": 2480, "60_72": 2481, "21_54": 2482, "54_21": 2483, "67_35": 2484, "35_67": 2485, "10_49": 2486, "49_10": 2487, "10_17": 2488, "17_10": 2489, "10_23": 2490, "23_10": 2491, "60_4": 2492, "4_60": 2493, "18_46": 2494, "46_18": 2495, "45_27": 2496, "27_45": 2497, "66_42": 2498, "42_66": 2499, "13_50": 2500, "50_13": 2501, "30_66": 2502, "66_30": 2503, "46_14": 2504, "14_46": 2505, "59_73": 2506, "73_59": 2507, "52_5": 2508, "5_52": 2509, "19_28": 2510, "28_19": 2511, "18_74": 2512, "74_18": 2513, "5_34": 2514, "34_5": 2515, "36_5": 2516, "5_36": 2517, "37_44": 2518, "44_37": 2519, "37_40": 2520, "40_37": 2521, "37_50": 2522, "50_37": 2523, "70_55": 2524, "55_70": 2525, "54_46": 2526, "46_54": 2527, "8_55": 2528, "55_8": 2529, "74_39": 2530, "39_74": 2531, "54_61": 2532, "61_54": 2533, "61_53": 2534, "53_61": 2535, "23_18": 2536, "18_23": 2537, "21_29": 2538, "29_21": 2539, "18_5": 2540, "5_18": 2541, "68_73": 2542, "73_68": 2543, "66_46": 2544, "46_66": 2545, "6_73": 2546, "73_6": 2547, "32_19": 2548, "19_32": 2549, "45_9": 2550, "9_45": 2551, "33_54": 2552, "54_33": 2553, "15_32": 2554, "32_15": 2555, "43_69": 2556, "69_43": 2557, "30_21": 2558, "21_30": 2559, "54_18": 2560, "18_54": 2561, "41_31": 2562, "31_41": 2563, "6_7": 2564, "7_6": 2565, "49_35": 2566, "35_49": 2567, "21_8": 2568, "8_21": 2569, "21_57": 2570, "57_21": 2571, "54_19": 2572, "19_54": 2573, "57_30": 2574, "30_57": 2575, "3_2": 2576, "2_3": 2577, "49_17": 2578, "17_49": 2579, "29_17": 2580, "17_29": 2581, "74_65": 2582, "65_74": 2583, "58_42": 2584, "42_58": 2585, "73_4": 2586, "4_73": 2587, "27_47": 2588, "47_27": 2589, "32_73": 2590, "73_32": 2591, "57_37": 2592, "37_57": 2593, "32_35": 2594, "35_32": 2595, "38_48": 2596, "48_38": 2597, "57_27": 2598, "27_57": 2599, "57_5": 2600, "5_57": 2601, "57_36": 2602, "36_57": 2603, "18_3": 2604, "3_18": 2605, "39_46": 2606, "46_39": 2607, "43_53": 2608, "53_43": 2609, "65_23": 2610, "23_65": 2611, "52_60": 2612, "60_52": 2613, "59_16": 2614, "16_59": 2615, "15_16": 2616, "16_15": 2617, "32_13": 2618, "13_32": 2619, "43_49": 2620, "49_43": 2621, "19_19": 2622, "59_59": 2623, "9_66": 2624, "66_9": 2625, "52_10": 2626, "10_52": 2627, "28_15": 2628, "15_28": 2629, "48_32": 2630, "32_48": 2631, "48_66": 2632, "66_48": 2633, "58_4": 2634, "4_58": 2635, "49_9": 2636, "9_49": 2637, "50_22": 2638, "22_50": 2639, "33_53": 2640, "53_33": 2641, "44_70": 2642, "70_44": 2643, "4_25": 2644, "25_4": 2645, "29_10": 2646, "10_29": 2647, "34_72": 2648, "72_34": 2649, "36_66": 2650, "66_36": 2651, "57_13": 2652, "13_57": 2653, "5_67": 2654, "67_5": 2655, "28_34": 2656, "34_28": 2657, "8_37": 2658, "37_8": 2659, "6_57": 2660, "57_6": 2661, "23_57": 2662, "57_23": 2663, "15_57": 2664, "57_15": 2665, "30_31": 2666, "31_30": 2667, "49_56": 2668, "56_49": 2669, "54_35": 2670, "35_54": 2671, "48_57": 2672, "57_48": 2673, "71_57": 2674, "57_71": 2675, "59_57": 2676, "57_59": 2677, "59_63": 2678, "63_59": 2679, "73_57": 2680, "57_73": 2681, "54_47": 2682, "47_54": 2683, "54_71": 2684, "71_54": 2685, "20_57": 2686, "57_20": 2687, "54_69": 2688, "69_54": 2689, "42_32": 2690, "32_42": 2691, "25_57": 2692, "57_25": 2693, "34_56": 2694, "56_34": 2695, "6_56": 2696, "56_6": 2697, "54_44": 2698, "44_54": 2699, "74_24": 2700, "24_74": 2701, "74_8": 2702, "8_74": 2703, "15_74": 2704, "74_15": 2705, "10_8": 2706, "8_10": 2707, "74_69": 2708, "69_74": 2709, "55_74": 2710, "74_55": 2711, "74_66": 2712, "66_74": 2713, "74_58": 2714, "58_74": 2715, "74_35": 2716, "35_74": 2717, "74_48": 2718, "48_74": 2719, "74_16": 2720, "16_74": 2721, "74_30": 2722, "30_74": 2723, "74_31": 2724, "31_74": 2725, "74_38": 2726, "38_74": 2727, "74_21": 2728, "21_74": 2729, "34_55": 2730, "55_34": 2731, "19_31": 2732, "31_19": 2733, "24_47": 2734, "47_24": 2735, "47_29": 2736, "66_69": 2737, "69_66": 2738, "58_47": 2739, "47_58": 2740, "42_72": 2741, "72_42": 2742, "24_72": 2743, "72_24": 2744, "30_47": 2745, "47_30": 2746, "33_47": 2747, "47_33": 2748, "9_34": 2749, "34_9": 2750, "9_7": 2751, "7_9": 2752, "9_67": 2753, "67_9": 2754, "18_56": 2755, "56_18": 2756, "9_60": 2757, "60_9": 2758, "9_55": 2759, "55_9": 2760, "21_67": 2761, "67_21": 2762, "9_32": 2763, "32_9": 2764, "67_61": 2765, "67_73": 2766, "73_67": 2767, "58_18": 2768, "18_58": 2769, "67_75": 2770, "55_18": 2771, "18_55": 2772, "67_16": 2773, "16_67": 2774, "33_18": 2775, "18_33": 2776, "43_18": 2777, "18_43": 2778, "42_67": 2779, "67_42": 2780, "23_67": 2781, "67_23": 2782, "60_53": 2783, "53_60": 2784, "56_60": 2785, "60_56": 2786, "70_47": 2787, "47_70": 2788, "8_47": 2789, "47_8": 2790, "49_47": 2791, "47_49": 2792, "23_69": 2793, "69_23": 2794, "25_31": 2795, "31_25": 2796, "42_69": 2797, "69_42": 2798, "42_63": 2799, "63_42": 2800, "42_18": 2801, "18_42": 2802, "23_73": 2803, "73_23": 2804, "42_55": 2805, "55_42": 2806, "25_26": 2807, "26_25": 2808, "6_72": 2809, "72_6": 2810, "58_72": 2811, "72_58": 2812, "70_35": 2813, "35_70": 2814, "42_16": 2815, "16_42": 2816, "42_30": 2817, "30_42": 2818, "42_37": 2819, "37_42": 2820, "42_68": 2821, "68_42": 2822, "42_73": 2823, "73_42": 2824, "30_26": 2825, "26_30": 2826, "58_63": 2827, "63_58": 2828, "23_56": 2829, "56_23": 2830, "42_56": 2831, "56_42": 2832, "42_74": 2833, "74_42": 2834, "20_73": 2835, "73_20": 2836, "33_63": 2837, "63_33": 2838, "59_31": 2839, "31_59": 2840, "33_72": 2841, "72_33": 2842, "48_7": 2843, "7_48": 2844, "47_34": 2845, "34_47": 2846, "48_16": 2847, "16_48": 2848, "30_55": 2849, "55_30": 2850, "48_37": 2851, "37_48": 2852, "28_18": 2853, "18_28": 2854, "28_55": 2855, "55_28": 2856, "28_56": 2857, "56_28": 2858, "58_56": 2859, "56_58": 2860, "28_37": 2861, "37_28": 2862, "28_16": 2863, "16_28": 2864, "28_48": 2865, "48_28": 2866, "28_67": 2867, "67_28": 2868, "28_68": 2869, "68_28": 2870, "33_58": 2871, "58_33": 2872, "28_74": 2873, "74_28": 2874, "68_8": 2875, "8_68": 2876, "21_56": 2877, "56_21": 2878, "6_74": 2879, "74_6": 2880, "56_74": 2881, "74_56": 2882, "60_74": 2883, "74_60": 2884, "35_66": 2885, "66_35": 2886, "26_74": 2887, "74_26": 2888, "37_60": 2889, "60_37": 2890, "70_13": 2891, "13_70": 2892, "57_74": 2893, "74_57": 2894, "18_9": 2895, "9_18": 2896, "63_74": 2897, "74_63": 2898, "18_35": 2899, "35_18": 2900, "61_61": 2901, "55_72": 2902, "72_55": 2903, "59_74": 2904, "74_59": 2905, "70_74": 2906, "74_70": 2907, "37_74": 2908, "74_37": 2909, "32_74": 2910, "74_32": 2911, "56_45": 2912, "45_56": 2913, "33_31": 2914, "31_33": 2915, "63_9": 2916, "9_63": 2917, "45_73": 2918, "73_45": 2919, "47_45": 2920, "45_47": 2921, "18_71": 2922, "71_18": 2923, "43_8": 2924, "8_43": 2925, "72_13": 2926, "13_72": 2927, "21_21": 2928, "6_19": 2929, "19_6": 2930, "54_74": 2931, "74_54": 2932, "20_67": 2933, "67_20": 2934, "18_13": 2935, "13_18": 2936, "50_74": 2937, "74_50": 2938, "56_33": 2939, "33_56": 2940, "18_60": 2941, "60_18": 2942, "63_73": 2943, "73_63": 2944, "47_9": 2945, "9_47": 2946, "43_74": 2947, "74_43": 2948, "49_69": 2949, "69_49": 2950, "49_60": 2951, "60_49": 2952, "34_6": 2953, "6_34": 2954, "33_32": 2955, "32_33": 2956, "71_43": 2957, "43_71": 2958, "67_19": 2959, "19_67": 2960, "32_51": 2961, "51_32": 2962, "12_60": 2963, "60_12": 2964, "12_43": 2965, "43_12": 2966, "8_28": 2967, "28_8": 2968, "12_18": 2969, "18_12": 2970, "8_51": 2971, "51_8": 2972, "66_51": 2973, "51_66": 2974, "8_56": 2975, "56_8": 2976, "16_51": 2977, "51_16": 2978, "30_51": 2979, "51_30": 2980, "66_28": 2981, "28_66": 2982, "12_71": 2983, "71_12": 2984, "12_59": 2985, "59_12": 2986, "70_51": 2987, "51_70": 2988, "68_51": 2989, "51_68": 2990, "12_69": 2991, "69_12": 2992, "12_26": 2993, "26_12": 2994, "70_28": 2995, "28_70": 2996, "51_63": 2997, "63_51": 2998, "68_31": 2999, "31_68": 3000, "12_61": 3001, "61_12": 3002, "12_68": 3003, "68_12": 3004, "17_67": 3005, "67_17": 3006, "6_51": 3007, "51_6": 3008, "54_51": 3009, "51_54": 3010, "33_29": 3011, "29_33": 3012, "23_34": 3013, "34_23": 3014, "21_31": 3015, "31_21": 3016, "30_56": 3017, "56_30": 3018, "13_63": 3019, "63_13": 3020, "23_16": 3021, "16_23": 3022, "8_6": 3023, "6_8": 3024, "8_20": 3025, "20_8": 3026, "13_66": 3027, "66_13": 3028, "21_25": 3029, "25_21": 3030, "25_29": 3031, "29_25": 3032, "43_6": 3033, "6_43": 3034, "25_74": 3035, "74_25": 3036, "9_48": 3037, "48_9": 3038, "21_6": 3039, "6_21": 3040, "21_23": 3041, "23_21": 3042, "32_23": 3043, "23_32": 3044, "25_59": 3045, "59_25": 3046, "42_29": 3047, "29_42": 3048, "42_8": 3049, "8_42": 3050, "42_23": 3051, "23_42": 3052, "67_13": 3053, "13_67": 3054, "13_23": 3055, "23_13": 3056, "12_33": 3057, "33_12": 3058, "12_5": 3059, "5_12": 3060, "38_12": 3061, "12_38": 3062, "68_21": 3063, "21_68": 3064, "32_21": 3065, "21_32": 3066, "59_7": 3067, "7_59": 3068, "59_58": 3069, "58_59": 3070, "25_52": 3071, "52_25": 3072, "42_52": 3073, "52_42": 3074, "59_66": 3075, "66_59": 3076, "6_52": 3077, "52_6": 3078, "58_21": 3079, "21_58": 3080, "16_53": 3081, "53_16": 3082, "72_76": 3083, "76_72": 3084, "76_9": 3085, "9_76": 3086, "76_76": 3087, "76_26": 3088, "26_76": 3089, "46_9": 3090, "9_46": 3091, "76_24": 3092, "24_76": 3093, "26_9": 3094, "9_26": 3095, "76_48": 3096, "48_76": 3097, "76_5": 3098, "5_76": 3099, "76_38": 3100, "38_76": 3101, "76_65": 3102, "65_76": 3103, "76_17": 3104, "17_76": 3105, "76_16": 3106, "16_76": 3107, "76_6": 3108, "6_76": 3109, "24_7": 3110, "7_24": 3111, "76_55": 3112, "55_76": 3113, "76_47": 3114, "47_76": 3115, "8_9": 3116, "9_8": 3117, "76_51": 3118, "51_76": 3119, "34_64": 3120, "64_34": 3121, "76_27": 3122, "27_76": 3123, "21_9": 3124, "9_21": 3125, "9_30": 3126, "30_9": 3127, "42_9": 3128, "9_42": 3129, "58_9": 3130, "9_58": 3131, "70_9": 3132, "9_70": 3133, "51_61": 3134, "61_51": 3135, "25_61": 3136, "61_25": 3137, "8_19": 3138, "19_8": 3139, "66_61": 3140, "61_66": 3141, "8_5": 3142, "5_8": 3143, "8_38": 3144, "38_8": 3145, "25_72": 3146, "72_25": 3147, "6_12": 3148, "12_6": 3149, "15_12": 3150, "12_15": 3151, "66_19": 3152, "19_66": 3153, "30_61": 3154, "61_30": 3155, "43_61": 3156, "61_43": 3157, "59_61": 3158, "61_59": 3159, "34_7": 3160, "7_34": 3161, "73_61": 3162, "61_73": 3163, "48_61": 3164, "61_48": 3165, "19_61": 3166, "61_19": 3167, "19_57": 3168, "57_19": 3169, "19_52": 3170, "52_19": 3171, "19_42": 3172, "42_19": 3173, "19_7": 3174, "7_19": 3175, "19_48": 3176, "48_19": 3177, "19_26": 3178, "26_19": 3179, "19_16": 3180, "16_19": 3181, "11_11": 3182, "71_11": 3183, "11_71": 3184, "11_24": 3185, "24_11": 3186, "11_29": 3187, "29_11": 3188, "11_65": 3189, "65_11": 3190, "23_11": 3191, "11_23": 3192, "48_11": 3193, "11_48": 3194, "32_11": 3195, "11_32": 3196, "49_65": 3197, "65_49": 3198, "11_49": 3199, "49_11": 3200, "11_66": 3201, "66_11": 3202, "11_6": 3203, "6_11": 3204, "59_71": 3205, "71_59": 3206, "11_15": 3207, "15_11": 3208, "11_61": 3209, "61_11": 3210, "33_11": 3211, "11_33": 3212, "11_13": 3213, "13_11": 3214, "11_59": 3215, "59_11": 3216, "11_68": 3217, "68_11": 3218, "11_42": 3219, "42_11": 3220, "11_34": 3221, "34_11": 3222, "11_26": 3223, "26_11": 3224, "11_4": 3225, "4_11": 3226, "54_11": 3227, "11_54": 3228, "41_68": 3229, "68_41": 3230, "41_70": 3231, "70_41": 3232, "41_29": 3233, "29_41": 3234, "32_41": 3235, "41_32": 3236, "43_41": 3237, "41_43": 3238, "48_23": 3239, "23_48": 3240, "48_2": 3241, "2_48": 3242, "41_15": 3243, "15_41": 3244, "41_48": 3245, "48_41": 3246, "41_58": 3247, "58_41": 3248, "43_13": 3249, "13_43": 3250, "4_41": 3251, "41_4": 3252, "41_72": 3253, "72_41": 3254, "41_26": 3255, "26_41": 3256, "41_53": 3257, "53_41": 3258, "41_24": 3259, "24_41": 3260, "2_24": 3261, "24_2": 3262, "32_59": 3263, "59_32": 3264, "2_34": 3265, "34_2": 3266, "2_14": 3267, "14_2": 3268, "42_34": 3269, "34_42": 3270, "42_41": 3271, "41_42": 3272, "6_2": 3273, "2_6": 3274, "41_3": 3275, "3_41": 3276, "28_71": 3277, "71_28": 3278, "20_23": 3279, "23_20": 3280, "20_49": 3281, "49_20": 3282, "38_71": 3283, "71_38": 3284, "71_74": 3285, "74_71": 3286, "33_71": 3287, "71_33": 3288, "14_70": 3289, "70_14": 3290, "19_50": 3291, "50_19": 3292, "14_23": 3293, "23_14": 3294, "14_24": 3295, "24_14": 3296, "14_19": 3297, "19_14": 3298, "38_19": 3299, "19_38": 3300, "14_61": 3301, "61_14": 3302, "19_13": 3303, "13_19": 3304, "14_13": 3305, "13_14": 3306, "19_59": 3307, "59_19": 3308, "14_49": 3309, "49_14": 3310, "58_69": 3311, "69_58": 3312, "15_68": 3313, "68_15": 3314, "33_67": 3315, "67_33": 3316, "13_53": 3317, "53_13": 3318, "44_52": 3319, "52_44": 3320, "50_16": 3321, "16_50": 3322, "48_22": 3323, "22_48": 3324, "66_22": 3325, "22_66": 3326, "49_22": 3327, "22_49": 3328, "8_22": 3329, "22_8": 3330, "15_22": 3331, "22_15": 3332, "58_46": 3333, "46_58": 3334, "22_45": 3335, "45_22": 3336, "24_22": 3337, "22_24": 3338, "72_68": 3339, "68_72": 3340, "22_68": 3341, "68_22": 3342, "22_42": 3343, "42_22": 3344, "22_71": 3345, "71_22": 3346, "22_16": 3347, "16_22": 3348, "23_22": 3349, "22_23": 3350, "22_5": 3351, "5_22": 3352, "34_22": 3353, "22_34": 3354, "4_22": 3355, "22_4": 3356, "43_68": 3357, "68_43": 3358, "22_32": 3359, "32_22": 3360, "22_10": 3361, "10_22": 3362, "22_29": 3363, "29_22": 3364, "62_11": 3365, "11_62": 3366, "48_17": 3367, "17_48": 3368, "36_48": 3369, "48_36": 3370, "30_2": 3371, "2_30": 3372, "71_14": 3373, "14_71": 3374, "2_26": 3375, "26_2": 3376, "62_69": 3377, "69_62": 3378, "62_17": 3379, "17_62": 3380, "36_34": 3381, "34_36": 3382, "36_29": 3383, "29_36": 3384, "64_16": 3385, "16_64": 3386, "2_67": 3387, "67_2": 3388, "2_72": 3389, "72_2": 3390, "2_31": 3391, "31_2": 3392, "2_55": 3393, "55_2": 3394, "2_19": 3395, "19_2": 3396, "2_8": 3397, "8_2": 3398, "2_69": 3399, "69_2": 3400, "2_38": 3401, "38_2": 3402, "2_18": 3403, "18_2": 3404, "2_32": 3405, "32_2": 3406, "2_66": 3407, "66_2": 3408, "13_9": 3409, "9_13": 3410, "60_73": 3411, "73_60": 3412, "2_5": 3413, "5_2": 3414, "71_51": 3415, "51_71": 3416, "71_21": 3417, "21_71": 3418, "62_70": 3419, "70_62": 3420, "36_67": 3421, "67_36": 3422, "36_6": 3423, "6_36": 3424, "23_66": 3425, "66_23": 3426, "2_61": 3427, "61_2": 3428, "2_53": 3429, "53_2": 3430, "2_59": 3431, "59_2": 3432, "2_68": 3433, "68_2": 3434, "71_69": 3435, "69_71": 3436, "46_2": 3437, "2_46": 3438, "71_16": 3439, "16_71": 3440, "71_56": 3441, "56_71": 3442, "36_49": 3443, "49_36": 3444, "71_45": 3445, "45_71": 3446, "2_65": 3447, "65_2": 3448, "2_21": 3449, "21_2": 3450, "2_33": 3451, "33_2": 3452, "2_56": 3453, "56_2": 3454, "2_47": 3455, "47_2": 3456, "2_60": 3457, "60_2": 3458, 