{"PAD": 0, "DUMMY_START_RELATION": 1, "UNK": 2, "50_31": 3, "32_31": 4, "32_56": 5, "57_31": 6, "54_55": 7, "7_70": 8, "54_31": 9, "49_31": 10, "32_55": 11, "32_63": 12, "29_31": 13, "54_63": 14, "32_35": 15, "57_72": 16, "66_31": 17, "54_56": 18, "57_56": 19, "32_47": 20, "32_60": 21, "58_31": 22, "44_31": 23, "24_18": 24, "45_72": 25, "57_55": 26, "72_31": 27, "49_72": 28, "32_72": 29, "29_56": 30, "66_56": 31, "68_73": 32, "57_47": 33, "34_56": 34, "32_18": 35, "32_6": 36, "24_8": 37, "60_60": 38, "48_56": 39, "45_45": 40, "65_31": 41, "70_72": 42, "66_55": 43, "24_31": 44, "70_31": 45, "26_31": 46, "50_47": 47, "9_31": 48, "49_34": 49, "50_67": 50, "45_31": 51, "57_67": 52, "24_56": 53, "50_60": 54, "49_18": 55, "44_56": 56, "50_72": 57, "48_15": 58, "4_31": 59, "32_67": 60, "52_31": 61, "45_56": 62, "45_63": 63, "26_18": 64, "32_69": 65, "7_31": 66, "44_18": 67, "45_18": 68, "47_31": 69, "66_29": 70, "32_24": 71, "45_69": 72, "72_72": 73, "54_69": 74, "45_55": 75, "30_55": 76, "49_55": 77, "54_47": 78, "66_18": 79, "57_63": 80, "70_47": 81, "24_67": 82, "54_18": 83, "44_63": 84, "52_60": 85, "32_26": 86, "54_72": 87, "70_18": 88, "45_50": 89, "70_67": 90, "52_72": 91, "54_67": 92, "3_56": 93, "30_67": 94, "4_67": 95, "57_10": 96, "57_18": 97, "54_6": 98, "30_60": 99, "26_56": 100, "45_67": 101, "21_18": 102, "54_59": 103, "69_56": 104, "42_31": 105, "32_10": 106, "54_15": 107, "50_56": 108, "66_72": 109, "31_4": 110, "69_65": 111, "65_69": 112, "8_8": 113, "70_39": 114, "39_70": 115, "26_53": 116, "53_26": 117, "33_68": 118, "68_33": 119, "40_40": 120, "69_69": 121, "58_73": 122, "73_58": 123, "58_16": 124, "16_58": 125, "31_69": 126, "69_31": 127, "31_10": 128, "10_31": 129, "52_61": 130, "61_52": 131, "66_76": 132, "76_66": 133, "33_73": 134, "73_33": 135, "38_10": 136, "10_38": 137, "38_65": 138, "65_38": 139, "47_35": 140, "35_47": 141, "50_50": 142, "50_57": 143, "57_50": 144, "58_68": 145, "68_58": 146, "4_32": 147, "32_4": 148, "4_70": 149, "70_4": 150, "30_4": 151, "4_30": 152, "71_70": 153, "70_71": 154, "26_26": 155, "31_26": 156, "31_31": 157, "31_47": 158, "33_16": 159, "16_33": 160, "65_53": 161, "53_65": 162, "65_65": 163, "10_37": 164, "37_10": 165, "64_64": 166, "64_27": 167, "27_64": 168, "64_66": 169, "66_64": 170, "52_45": 171, "45_52": 172, "39_39": 173, "70_70": 174, "65_70": 175, "70_65": 176, "30_16": 177, "16_30": 178, "52_59": 179, "59_52": 180, "52_57": 181, "57_52": 182, "52_52": 183, "48_69": 184, "69_48": 185, "50_54": 186, "54_50": 187, "52_27": 188, "27_52": 189, "3_47": 190, "47_3": 191, "30_73": 192, "73_30": 193, "30_68": 194, "68_30": 195, "72_53": 196, "53_72": 197, "72_26": 198, "26_72": 199, "72_65": 200, "65_72": 201, "72_5": 202, "5_72": 203, "10_12": 204, "12_10": 205, "24_9": 206, "9_24": 207, "42_24": 208, "24_42": 209, "10_10": 210, "24_24": 211, "52_70": 212, "70_52": 213, "49_4": 214, "4_49": 215, "3_12": 216, "12_3": 217, "3_9": 218, "9_3": 219, "3_10": 220, "10_3": 221, "56_3": 222, "35_65": 223, "65_35": 224, "52_15": 225, "15_52": 226, "45_10": 227, "10_45": 228, "63_10": 229, "10_63": 230, "63_28": 231, "28_63": 232, "63_50": 233, "50_63": 234, "29_70": 235, "70_29": 236, "26_65": 237, "65_26": 238, "26_5": 239, "5_26": 240, "48_8": 241, "8_48": 242, "48_68": 243, "68_48": 244, "64_40": 245, "40_64": 246, "24_32": 247, "33_21": 248, "21_33": 249, "59_4": 250, "4_59": 251, "65_5": 252, "5_65": 253, "70_26": 254, "26_70": 255, "70_38": 256, "38_70": 257, "38_53": 258, "53_38": 259, "35_34": 260, "34_35": 261, "67_4": 262, "64_50": 263, "50_64": 264, "64_4": 265, "4_64": 266, "24_49": 267, "49_24": 268, "55_31": 269, "31_55": 270, "41_41": 271, "5_5": 272, "4_50": 273, "50_4": 274, "49_2": 275, "2_49": 276, "49_41": 277, "41_49": 278, "70_10": 279, "10_70": 280, "58_49": 281, "49_58": 282, "66_66": 283, "37_37": 284, "3_3": 285, "27_48": 286, "48_27": 287, "4_52": 288, "52_4": 289, "4_45": 290, "45_4": 291, "64_65": 292, "65_64": 293, "64_72": 294, "72_64": 295, "45_66": 296, "66_45": 297, "45_15": 298, "15_45": 299, "67_45": 300, "41_71": 301, "71_41": 302, "47_47": 303, "54_54": 304, "54_57": 305, "57_54": 306, "47_72": 307, "72_47": 308, "10_32": 309, "33_34": 310, "34_33": 311, "24_3": 312, "3_24": 313, "57_44": 314, "44_57": 315, "4_44": 316, "44_4": 317, "29_49": 318, "49_29": 319, "5_53": 320, "53_5": 321, "33_13": 322, "13_33": 323, "75_50": 324, "50_75": 325, "75_3": 326, "3_75": 327, "75_65": 328, "65_75": 329, "35_31": 330, "31_35": 331, "44_32": 332, "32_44": 333, "44_44": 334, "44_64": 335, "64_44": 336, "44_76": 337, "76_44": 338, "10_24": 339, "24_10": 340, "10_51": 341, "51_10": 342, "64_10": 343, "10_64": 344, "49_19": 345, "19_49": 346, "30_53": 347, "53_30": 348, "36_17": 349, "17_36": 350, "29_46": 351, "46_29": 352, "72_50": 353, "47_4": 354, "4_47": 355, "47_57": 356, "47_51": 357, "51_47": 358, "4_12": 359, "12_4": 360, "26_50": 361, "50_26": 362, "72_70": 363, "49_66": 364, "66_49": 365, "24_4": 366, "4_24": 367, "10_9": 368, "9_10": 369, "70_16": 370, "16_70": 371, "29_66": 372, "71_61": 373, "61_71": 374, "65_46": 375, "46_65": 376, "7_57": 377, "57_7": 378, "67_24": 379, "69_5": 380, "5_69": 381, "6_29": 382, "29_6": 383, "49_49": 384, "29_16": 385, "16_29": 386, "33_49": 387, "49_33": 388, "36_15": 389, "15_36": 390, "25_25": 391, "38_60": 392, "60_38": 393, "38_38": 394, "70_66": 395, "66_70": 396, "20_34": 397, "34_20": 398, "3_50": 399, "50_3": 400, "10_59": 401, "59_10": 402, "41_27": 403, "27_41": 404, "41_8": 405, "8_41": 406, "41_47": 407, "47_41": 408, "41_40": 409, "40_41": 410, "41_67": 411, "67_41": 412, "41_50": 413, "50_41": 414, "41_61": 415, "61_41": 416, "18_18": 417, "27_4": 418, "4_27": 419, "45_34": 420, "34_45": 421, "57_26": 422, "26_57": 423, "31_72": 424, "50_65": 425, "65_50": 426, "50_5": 427, "5_50": 428, "50_38": 429, "38_50": 430, "50_10": 431, "10_50": 432, "50_40": 433, "40_50": 434, "50_69": 435, "69_50": 436, "50_53": 437, "53_50": 438, "49_15": 439, "15_49": 440, "32_32": 441, "32_46": 442, "46_32": 443, "56_32": 444, "29_20": 445, "20_29": 446, "4_4": 447, "29_32": 448, "32_29": 449, "72_40": 450, "40_72": 451, "67_50": 452, "38_59": 453, "59_38": 454, "34_34": 455, "54_32": 456, "32_54": 457, "54_26": 458, "26_54": 459, "41_2": 460, "2_41": 461, "67_53": 462, "53_67": 463, "67_65": 464, "65_67": 465, "67_67": 466, "67_72": 467, "72_67": 468, "4_65": 469, "65_4": 470, "24_28": 471, "28_24": 472, "69_67": 473, "67_69": 474, "49_68": 475, "68_49": 476, "69_10": 477, "10_69": 478, "32_43": 479, "43_32": 480, "25_66": 481, "66_25": 482, "7_10": 483, "10_7": 484, "72_10": 485, "10_72": 486, "72_44": 487, "44_72": 488, "72_4": 489, "4_72": 490, "7_69": 491, "69_7": 492, "53_53": 493, "4_51": 494, "51_4": 495, "6_24": 496, "24_6": 497, "6_49": 498, "49_6": 499, "12_12": 500, "12_31": 501, "31_12": 502, "29_3": 503, "3_29": 504, "35_10": 505, "10_35": 506, "3_67": 507, "67_3": 508, "3_31": 509, "31_3": 510, "8_53": 511, "53_8": 512, "32_66": 513, "66_32": 514, "30_70": 515, "70_30": 516, "34_4": 517, "4_34": 518, "52_48": 519, "48_52": 520, "52_39": 521, "39_52": 522, "56_56": 523, "51_51": 524, "58_29": 525, "29_58": 526, "58_57": 527, "57_58": 528, "9_65": 529, "65_9": 530, "72_22": 531, "22_72": 532, "18_66": 533, "32_52": 534, "52_32": 535, "32_57": 536, "57_32": 537, "15_34": 538, "34_15": 539, "8_66": 540, "66_8": 541, "47_69": 542, "69_47": 543, "3_28": 544, "28_3": 545, "51_31": 546, "31_51": 547, "8_67": 548, "67_8": 549, "8_65": 550, "65_8": 551, "68_29": 552, "29_68": 553, "29_29": 554, "52_54": 555, "54_52": 556, "50_52": 557, "52_50": 558, "50_44": 559, "44_50": 560, "50_27": 561, "27_50": 562, "50_12": 563, "12_50": 564, "47_50": 565, "50_9": 566, "9_50": 567, "31_50": 568, "47_10": 569, "10_47": 570, "69_60": 571, "60_69": 572, "29_59": 573, "59_29": 574, "6_6": 575, "6_71": 576, "71_6": 577, "10_46": 578, "46_10": 579, "3_72": 580, "72_3": 581, "3_34": 582, "34_3": 583, "24_43": 584, "43_24": 585, "63_56": 586, "56_63": 587, "8_73": 588, "73_8": 589, "8_70": 590, "70_8": 591, "29_4": 592, "4_29": 593, "23_23": 594, "23_28": 595, "28_23": 596, "4_43": 597, "43_4": 598, "24_73": 599, "73_24": 600, "55_55": 601, "31_45": 602, "50_59": 603, "59_50": 604, "23_61": 605, "61_23": 606, "37_67": 607, "67_37": 608, "37_56": 609, "56_37": 610, "37_69": 611, "69_37": 612, "37_31": 613, "31_37": 614, "32_39": 615, "39_32": 616, "57_57": 617, "40_27": 618, "27_40": 619, "40_10": 620, "10_40": 621, "33_25": 622, "25_33": 623, "52_49": 624, "49_52": 625, "70_46": 626, "46_70": 627, "49_12": 628, "12_49": 629, "49_71": 630, "71_49": 631, "71_31": 632, "31_71": 633, "71_66": 634, "66_71": 635, "71_71": 636, "49_45": 637, "45_49": 638, "30_18": 639, "18_30": 640, "40_47": 641, "47_40": 642, "48_31": 643, "31_48": 644, "14_65": 645, "65_14": 646, "64_38": 647, "38_64": 648, "64_17": 649, "17_64": 650, "40_67": 651, "67_40": 652, "40_4": 653, "4_40": 654, "49_30": 655, "30_49": 656, "31_49": 657, "29_28": 658, "28_29": 659, "3_26": 660, "26_3": 661, "3_57": 662, "57_3": 663, "3_32": 664, "32_3": 665, "3_44": 666, "44_3": 667, "36_45": 668, "45_36": 669, "61_50": 670, "50_61": 671, "20_16": 672, "16_20": 673, "40_65": 674, "65_40": 675, "52_66": 676, "66_52": 677, "37_68": 678, "68_37": 679, "69_53": 680, "53_69": 681, "3_65": 682, "65_3": 683, "32_70": 684, "70_32": 685, "18_53": 686, "53_18": 687, "40_8": 688, "8_40": 689, "40_53": 690, "53_40": 691, "23_52": 692, "52_23": 693, "39_72": 694, "72_39": 695, "27_27": 696, "48_10": 697, "10_48": 698, "55_10": 699, "10_55": 700, "13_8": 701, "8_13": 702, "20_20": 703, "54_4": 704, "4_54": 705, "3_64": 706, "64_3": 707, "3_40": 708, "40_3": 709, "69_72": 710, "72_69": 711, "5_39": 712, "39_5": 713, "72_46": 714, "46_72": 715, "15_53": 716, "53_15": 717, "29_26": 718, "26_29": 719, "7_26": 720, "26_7": 721, "65_37": 722, "37_65": 723, "3_21": 724, "21_3": 725, "15_59": 726, "59_15": 727, "34_18": 728, "18_34": 729, "13_12": 730, "12_13": 731, "64_8": 732, "8_64": 733, "64_41": 734, "41_64": 735, "64_47": 736, "47_64": 737, "38_26": 738, "26_38": 739, "34_32": 740, "32_34": 741, "6_4": 742, "4_6": 743, "38_5": 744, "5_38": 745, "26_32": 746, "65_10": 747, "10_65": 748, "29_8": 749, "8_29": 750, "69_26": 751, "26_69": 752, "22_22": 753, "38_69": 754, "69_38": 755, "29_65": 756, "65_29": 757, "26_67": 758, "67_26": 759, "18_50": 760, "50_18": 761, "31_54": 762, "18_4": 763, "4_18": 764, "71_2": 765, "2_71": 766, "71_23": 767, "23_71": 768, "71_24": 769, "24_71": 770, "47_56": 771, "56_47": 772, "29_24": 773, "24_29": 774, "8_72": 775, "72_8": 776, "65_47": 777, "47_65": 778, "40_24": 779, "24_40": 780, "29_53": 781, "53_29": 782, "55_32": 783, "3_69": 784, "69_3": 785, "44_40": 786, "40_44": 787, "33_24": 788, "24_33": 789, "38_47": 790, "47_38": 791, "26_22": 792, "22_26": 793, "49_70": 794, "70_49": 795, "48_13": 796, "13_48": 797, "50_45": 798, "29_39": 799, "39_29": 800, "49_63": 801, "63_49": 802, "8_49": 803, "49_8": 804, "34_26": 805, "26_34": 806, "18_20": 807, "20_18": 808, "27_65": 809, "65_27": 810, "17_73": 811, "73_17": 812, "24_65": 813, "65_24": 814, "24_13": 815, "13_24": 816, "34_39": 817, "39_34": 818, "16_31": 819, "31_16": 820, "47_12": 821, "12_47": 822, "64_49": 823, "49_64": 824, "64_32": 825, "32_64": 826, "64_2": 827, "2_64": 828, "42_42": 829, "38_4": 830, "4_38": 831, "14_50": 832, "50_14": 833, "32_45": 834, "45_32": 835, "52_8": 836, "8_52": 837, "52_29": 838, "29_52": 839, "10_4": 840, "4_10": 841, "54_29": 842, "29_54": 843, "35_35": 844, "35_63": 845, "63_35": 846, "75_75": 847, "75_53": 848, "53_75": 849, "41_23": 850, "23_41": 851, "41_11": 852, "11_41": 853, "67_31": 854, "31_67": 855, "9_9": 856, "15_4": 857, "4_15": 858, "15_15": 859, "7_50": 860, "50_7": 861, "10_60": 862, "60_10": 863, "58_70": 864, "70_58": 865, "52_64": 866, "64_52": 867, "50_28": 868, "28_50": 869, "6_32": 870, "72_57": 871, "32_76": 872, "76_32": 873, "47_60": 874, "60_47": 875, "24_61": 876, "61_24": 877, "21_15": 878, "15_21": 879, "32_68": 880, "68_32": 881, "46_69": 882, "69_46": 883, "46_37": 884, "37_46": 885, "8_24": 886, "13_13": 887, "68_46": 888, "46_68": 889, "70_2": 890, "2_70": 891, "15_65": 892, "65_15": 893, "72_27": 894, "27_72": 895, "74_34": 896, "34_74": 897, "3_6": 898, "6_3": 899, "48_12": 900, "12_48": 901, "17_46": 902, "46_17": 903, "17_38": 904, "38_17": 905, "74_68": 906, "68_74": 907, "20_32": 908, "32_20": 909, "41_19": 910, "19_41": 911, "24_57": 912, "57_24": 913, "55_65": 914, "65_55": 915, "23_25": 916, "25_23": 917, "50_32": 918, "32_50": 919, "66_65": 920, "65_66": 921, "65_39": 922, "39_65": 923, "41_10": 924, "10_41": 925, "69_27": 926, "27_69": 927, "55_47": 928, "47_55": 929, "55_51": 930, "51_55": 931, "29_57": 932, "57_29": 933, "33_33": 934, "58_3": 935, "3_58": 936, "33_15": 937, "15_33": 938, "67_30": 939, "5_46": 940, "46_5": 941, "66_10": 942, "10_66": 943, "4_57": 944, "57_4": 945, "55_50": 946, "50_55": 947, "48_39": 948, "39_48": 949, "38_72": 950, "72_38": 951, "31_57": 952, "3_49": 953, "49_3": 954, "4_71": 955, "71_4": 956, "6_31": 957, "31_6": 958, "21_4": 959, "4_21": 960, "30_19": 961, "19_30": 962, "66_24": 963, "24_66": 964, "49_23": 965, "23_49": 966, "72_54": 967, "45_48": 968, "48_45": 969, "45_8": 970, "8_45": 971, "70_50": 972, "50_70": 973, "28_54": 974, "54_28": 975, "4_33": 976, "33_4": 977, "55_53": 978, "53_55": 979, "55_67": 980, "67_55": 981, "49_73": 982, "73_49": 983, "50_46": 984, "46_50": 985, "43_39": 986, "39_43": 987, "3_61": 988, "61_3": 989, "46_46": 990, "24_15": 991, "15_24": 992, "12_57": 993, "57_12": 994, "12_51": 995, "51_12": 996, "3_13": 997, "13_3": 998, "70_11": 999, "11_70": 1000, "26_46": 1001, "46_26": 1002, "26_28": 1003, "28_26": 1004, "10_67": 1005, "67_10": 1006, "66_67": 1007, "67_66": 1008, "26_47": 1009, "47_26": 1010, "22_70": 1011, "70_22": 1012, "22_65": 1013, "65_22": 1014, "8_31": 1015, "31_8": 1016, "31_53": 1017, "53_31": 1018, "31_63": 1019, "63_31": 1020, "72_75": 1021, "75_72": 1022, "4_56": 1023, "56_4": 1024, "33_8": 1025, "8_33": 1026, "69_70": 1027, "70_69": 1028, "43_65": 1029, "65_43": 1030, "72_73": 1031, "73_72": 1032, "34_71": 1033, "71_34": 1034, "29_51": 1035, "51_29": 1036, "4_26": 1037, "26_4": 1038, "24_70": 1039, "70_24": 1040, "45_64": 1041, "64_45": 1042, "29_67": 1043, "67_29": 1044, "25_20": 1045, "20_25": 1046, "32_49": 1047, "49_32": 1048, "30_58": 1049, "58_30": 1050, "27_70": 1051, "70_27": 1052, "50_49": 1053, "49_50": 1054, "10_56": 1055, "56_10": 1056, "10_44": 1057, "44_10": 1058, "10_57": 1059, "10_75": 1060, "75_10": 1061, "10_18": 1062, "18_10": 1063, "64_53": 1064, "53_64": 1065, "43_43": 1066, "10_53": 1067, "53_10": 1068, "32_53": 1069, "53_32": 1070, "12_16": 1071, "16_12": 1072, "8_59": 1073, "59_8": 1074, "25_70": 1075, "70_25": 1076, "25_3": 1077, "3_25": 1078, "25_65": 1079, "65_25": 1080, "45_29": 1081, "29_45": 1082, "35_37": 1083, "37_35": 1084, "35_28": 1085, "28_35": 1086, "21_70": 1087, "70_21": 1088, "38_40": 1089, "40_38": 1090, "57_45": 1091, "45_57": 1092, "29_61": 1093, "61_29": 1094, "24_55": 1095, "55_24": 1096, "75_31": 1097, "31_75": 1098, "75_56": 1099, "56_75": 1100, "70_15": 1101, "15_70": 1102, "51_3": 1103, "3_51": 1104, "18_7": 1105, "7_18": 1106, "42_10": 1107, "10_42": 1108, "37_70": 1109, "70_37": 1110, "31_7": 1111, "4_28": 1112, "28_4": 1113, "48_70": 1114, "70_48": 1115, "34_21": 1116, "21_34": 1117, "56_69": 1118, "70_73": 1119, "73_70": 1120, "63_34": 1121, "34_63": 1122, "70_59": 1123, "59_70": 1124, "64_57": 1125, "57_64": 1126, "70_45": 1127, "45_70": 1128, "45_24": 1129, "24_45": 1130, "45_53": 1131, "53_45": 1132, "50_30": 1133, "30_50": 1134, "23_26": 1135, "26_23": 1136, "12_34": 1137, "34_12": 1138, "12_56": 1139, "56_12": 1140, "22_38": 1141, "38_22": 1142, "47_67": 1143, "67_47": 1144, "29_76": 1145, "76_29": 1146, "70_34": 1147, "34_70": 1148, "4_3": 1149, "3_4": 1150, "49_46": 1151, "46_49": 1152, "7_8": 1153, "8_7": 1154, "30_45": 1155, "45_30": 1156, "23_31": 1157, "31_23": 1158, "74_72": 1159, "72_74": 1160, "24_16": 1161, "16_24": 1162, "71_10": 1163, "10_71": 1164, "73_15": 1165, "15_73": 1166, "69_64": 1167, "64_69": 1168, "23_2": 1169, "2_23": 1170, "47_32": 1171, "54_65": 1172, "65_54": 1173, "5_14": 1174, "14_5": 1175, "48_3": 1176, "3_48": 1177, "46_53": 1178, "53_46": 1179, "15_48": 1180, "36_65": 1181, "65_36": 1182, "45_65": 1183, "65_45": 1184, "48_72": 1185, "72_48": 1186, "65_56": 1187, "56_65": 1188, "3_30": 1189, "30_3": 1190, "30_71": 1191, "71_30": 1192, "12_65": 1193, "65_12": 1194, "29_44": 1195, "44_29": 1196, "66_47": 1197, "47_66": 1198, "40_69": 1199, "69_40": 1200, "21_59": 1201, "59_21": 1202, "13_47": 1203, "47_13": 1204, "13_59": 1205, "59_13": 1206, "63_53": 1207, "53_63": 1208, "63_26": 1209, "26_63": 1210, "63_4": 1211, "4_63": 1212, "7_44": 1213, "44_7": 1214, "26_64": 1215, "64_26": 1216, "66_50": 1217, "50_66": 1218, "9_4": 1219, "4_9": 1220, "48_49": 1221, "49_48": 1222, "49_57": 1223, "57_49": 1224, "18_26": 1225, "48_4": 1226, "4_48": 1227, "34_68": 1228, "68_34": 1229, "4_37": 1230, "37_4": 1231, "44_26": 1232, "26_44": 1233, "5_70": 1234, "70_5": 1235, "69_34": 1236, "34_69": 1237, "28_31": 1238, "31_28": 1239, "26_10": 1240, "10_26": 1241, "66_4": 1242, "4_66": 1243, "42_61": 1244, "61_42": 1245, "28_28": 1246, "26_6": 1247, "6_26": 1248, "10_34": 1249, "34_10": 1250, "43_46": 1251, "46_43": 1252, "9_39": 1253, "39_9": 1254, "24_39": 1255, "39_24": 1256, "54_16": 1257, "16_54": 1258, "40_26": 1259, "26_40": 1260, "64_5": 1261, "5_64": 1262, "22_53": 1263, "53_22": 1264, "27_29": 1265, "29_27": 1266, "40_12": 1267, "12_40": 1268, "34_24": 1269, "24_34": 1270, "3_15": 1271, "15_3": 1272, "27_10": 1273, "10_27": 1274, "46_61": 1275, "61_46": 1276, "18_67": 1277, "67_18": 1278, "34_73": 1279, "73_34": 1280, "52_73": 1281, "73_52": 1282, "50_15": 1283, "15_50": 1284, "30_30": 1285, "70_19": 1286, "19_70": 1287, "70_68": 1288, "68_70": 1289, "70_6": 1290, "6_70": 1291, "70_64": 1292, "64_70": 1293, "60_65": 1294, "65_60": 1295, "44_69": 1296, "69_44": 1297, "44_65": 1298, "65_44": 1299, "44_27": 1300, "27_44": 1301, "72_66": 1302, "72_18": 1303, "18_72": 1304, "34_49": 1305, "23_72": 1306, "72_23": 1307, "23_12": 1308, "12_23": 1309, "19_24": 1310, "24_19": 1311, "8_16": 1312, "16_8": 1313, "60_34": 1314, "34_60": 1315, "37_73": 1316, "73_37": 1317, "29_15": 1318, "15_29": 1319, "74_67": 1320, "67_74": 1321, "52_55": 1322, "55_52": 1323, "18_32": 1324, "32_38": 1325, "38_32": 1326, "64_36": 1327, "36_64": 1328, "49_53": 1329, "53_49": 1330, "48_50": 1331, "50_48": 1332, "48_65": 1333, "65_48": 1334, "60_50": 1335, "34_29": 1336, "29_34": 1337, "41_66": 1338, "66_41": 1339, "41_25": 1340, "25_41": 1341, "4_69": 1342, "69_4": 1343, "41_69": 1344, "69_41": 1345, "41_12": 1346, "12_41": 1347, "8_32": 1348, "32_8": 1349, "39_68": 1350, "68_39": 1351, "64_24": 1352, "24_64": 1353, "47_44": 1354, "44_47": 1355, "10_28": 1356, "28_10": 1357, "67_34": 1358, "34_67": 1359, "32_61": 1360, "61_32": 1361, "27_53": 1362, "53_27": 1363, "31_65": 1364, "17_32": 1365, "32_17": 1366, "4_5": 1367, "5_4": 1368, "31_52": 1369, "6_68": 1370, "68_6": 1371, "47_74": 1372, "74_47": 1373, "75_55": 1374, "55_75": 1375, "26_39": 1376, "39_26": 1377, "57_46": 1378, "46_57": 1379, "3_70": 1380, "70_3": 1381, "53_28": 1382, "28_53": 1383, "31_24": 1384, "29_71": 1385, "71_29": 1386, "29_12": 1387, "12_29": 1388, "45_3": 1389, "3_45": 1390, "45_19": 1391, "19_45": 1392, "43_75": 1393, "75_43": 1394, "7_29": 1395, "29_7": 1396, "52_12": 1397, "12_52": 1398, "63_57": 1399, "30_41": 1400, "41_30": 1401, "56_57": 1402, "29_73": 1403, "73_29": 1404, "49_67": 1405, "67_49": 1406, "21_72": 1407, "72_21": 1408, "12_20": 1409, "20_12": 1410, "24_53": 1411, "53_24": 1412, "42_3": 1413, "3_42": 1414, "33_45": 1415, "45_33": 1416, "33_55": 1417, "55_33": 1418, "61_68": 1419, "68_61": 1420, "34_51": 1421, "51_34": 1422, "35_53": 1423, "53_35": 1424, "48_34": 1425, "34_48": 1426, "49_76": 1427, "76_49": 1428, "32_27": 1429, "27_32": 1430, "52_3": 1431, "3_52": 1432, "35_69": 1433, "69_35": 1434, "24_54": 1435, "54_24": 1436, "43_67": 1437, "67_43": 1438, "35_72": 1439, "72_35": 1440, "7_7": 1441, "32_30": 1442, "30_32": 1443, "38_61": 1444, "61_38": 1445, "34_19": 1446, "19_34": 1447, "10_16": 1448, "16_10": 1449, "5_28": 1450, "28_5": 1451, "5_73": 1452, "73_5": 1453, "5_71": 1454, "71_5": 1455, "5_13": 1456, "13_5": 1457, "33_6": 1458, "6_33": 1459, "3_27": 1460, "27_3": 1461, "3_66": 1462, "66_3": 1463, "68_18": 1464, "18_68": 1465, "36_69": 1466, "69_36": 1467, "12_32": 1468, "32_12": 1469, "30_15": 1470, "15_30": 1471, "38_39": 1472, "39_38": 1473, "70_57": 1474, "57_70": 1475, "72_32": 1476, "18_31": 1477, "31_18": 1478, "70_61": 1479, "61_70": 1480, "4_13": 1481, "13_4": 1482, "31_70": 1483, "48_55": 1484, "55_48": 1485, "21_69": 1486, "69_21": 1487, "66_5": 1488, "5_66": 1489, "66_68": 1490, "68_66": 1491, "21_50": 1492, "50_21": 1493, "37_34": 1494, "34_37": 1495, "58_19": 1496, "19_58": 1497, "48_26": 1498, "26_48": 1499, "71_25": 1500, "25_71": 1501, "71_26": 1502, "26_71": 1503, "18_49": 1504, "73_16": 1505, "16_73": 1506, "33_10": 1507, "10_33": 1508, "48_18": 1509, "18_48": 1510, "52_38": 1511, "38_52": 1512, "57_28": 1513, "28_57": 1514, "71_72": 1515, "72_71": 1516, "56_26": 1517, "56_72": 1518, "72_56": 1519, "56_73": 1520, "73_56": 1521, "56_50": 1522, "40_2": 1523, "2_40": 1524, "58_45": 1525, "45_58": 1526, "34_17": 1527, "17_34": 1528, "55_57": 1529, "23_19": 1530, "19_23": 1531, "66_27": 1532, "27_66": 1533, "32_16": 1534, "16_32": 1535, "5_45": 1536, "45_5": 1537, "43_31": 1538, "31_43": 1539, "31_56": 1540, "56_31": 1541, "18_44": 1542, "43_66": 1543, "66_43": 1544, "33_66": 1545, "66_33": 1546, "34_53": 1547, "53_34": 1548, "31_58": 1549, "52_26": 1550, "26_52": 1551, "18_59": 1552, "59_18": 1553, "31_32": 1554, "38_67": 1555, "67_38": 1556, "30_24": 1557, "24_30": 1558, "42_4": 1559, "4_42": 1560, "51_15": 1561, "15_51": 1562, "65_21": 1563, "21_65": 1564, "52_65": 1565, "65_52": 1566, "30_12": 1567, "12_30": 1568, "52_18": 1569, "18_52": 1570, "28_25": 1571, "25_28": 1572, "18_64": 1573, "64_18": 1574, "26_24": 1575, "24_26": 1576, "66_63": 1577, "63_66": 1578, "34_66": 1579, "66_34": 1580, "57_61": 1581, "61_57": 1582, "57_51": 1583, "51_57": 1584, "57_9": 1585, "9_57": 1586, "4_55": 1587, "55_4": 1588, "51_59": 1589, "59_51": 1590, "6_16": 1591, "16_6": 1592, "70_76": 1593, "76_70": 1594, "28_49": 1595, "49_28": 1596, "31_60": 1597, "60_31": 1598, "43_50": 1599, "50_43": 1600, "67_68": 1601, "68_67": 1602, "23_4": 1603, "4_23": 1604, "75_12": 1605, "12_75": 1606, "6_18": 1607, "18_6": 1608, "49_26": 1609, "26_49": 1610, "64_55": 1611, "55_64": 1612, "26_15": 1613, "15_26": 1614, "38_16": 1615, "16_38": 1616, "52_47": 1617, "47_52": 1618, "67_32": 1619, "42_12": 1620, "12_42": 1621, "64_67": 1622, "67_64": 1623, "69_57": 1624, "57_69": 1625, "69_63": 1626, "63_69": 1627, "69_28": 1628, "28_69": 1629, "69_17": 1630, "17_69": 1631, "70_54": 1632, "54_70": 1633, "49_54": 1634, "54_49": 1635, "47_37": 1636, "37_47": 1637, "28_12": 1638, "12_28": 1639, "55_49": 1640, "49_25": 1641, "25_49": 1642, "43_10": 1643, "10_43": 1644, "55_60": 1645, "60_55": 1646, "40_15": 1647, "15_40": 1648, "40_66": 1649, "66_40": 1650, "18_47": 1651, "47_18": 1652, "33_65": 1653, "65_33": 1654, "19_25": 1655, "25_19": 1656, "8_26": 1657, "26_8": 1658, "74_4": 1659, "4_74": 1660, "34_65": 1661, "65_34": 1662, "40_25": 1663, "25_40": 1664, "29_13": 1665, "13_29": 1666, "25_24": 1667, "24_25": 1668, "50_8": 1669, "8_50": 1670, "50_71": 1671, "71_50": 1672, "72_52": 1673, "67_70": 1674, "5_49": 1675, "49_5": 1676, "72_43": 1677, "43_72": 1678, "74_53": 1679, "53_74": 1680, "34_59": 1681, "59_34": 1682, "43_70": 1683, "70_43": 1684, "43_64": 1685, "64_43": 1686, "67_27": 1687, "27_67": 1688, "3_59": 1689, "59_3": 1690, "3_33": 1691, "33_3": 1692, "43_3": 1693, "3_43": 1694, "6_42": 1695, "42_6": 1696, "47_63": 1697, "63_47": 1698, "52_56": 1699, "56_52": 1700, "27_18": 1701, "18_27": 1702, "15_18": 1703, "18_15": 1704, "29_50": 1705, "50_29": 1706, "10_76": 1707, "76_10": 1708, "23_70": 1709, "70_23": 1710, "47_53": 1711, "53_47": 1712, "64_30": 1713, "30_64": 1714, "24_12": 1715, "12_24": 1716, "48_48": 1717, "66_26": 1718, "26_66": 1719, "21_73": 1720, "73_21": 1721, "52_34": 1722, "34_52": 1723, "50_58": 1724, "58_50": 1725, "50_76": 1726, "76_50": 1727, "48_29": 1728, "29_48": 1729, "25_10": 1730, "10_25": 1731, "21_53": 1732, "53_21": 1733, "30_28": 1734, "28_30": 1735, "8_76": 1736, "76_8": 1737, "54_12": 1738, "12_54": 1739, "70_7": 1740, "50_73": 1741, "73_50": 1742, "48_73": 1743, "73_48": 1744, "39_45": 1745, "45_39": 1746, "6_28": 1747, "28_6": 1748, "52_24": 1749, "24_52": 1750, "66_12": 1751, "12_66": 1752, "64_15": 1753, "15_64": 1754, "57_76": 1755, "76_57": 1756, "37_53": 1757, "53_37": 1758, "43_57": 1759, "57_43": 1760, "29_2": 1761, "2_29": 1762, "61_65": 1763, "65_61": 1764, "37_38": 1765, "38_37": 1766, "44_53": 1767, "53_44": 1768, "63_54": 1769, "40_71": 1770, "71_40": 1771, "48_24": 1772, "24_48": 1773, "73_31": 1774, "31_73": 1775, "73_66": 1776, "66_73": 1777, "38_27": 1778, "27_38": 1779, "69_32": 1780, "21_64": 1781, "64_21": 1782, "52_37": 1783, "37_52": 1784, "30_8": 1785, "8_30": 1786, "3_7": 1787, "7_3": 1788, "75_5": 1789, "5_75": 1790, "75_52": 1791, "52_75": 1792, "57_53": 1793, "53_57": 1794, "72_9": 1795, "9_72": 1796, "58_71": 1797, "71_58": 1798, "36_38": 1799, "38_36": 1800, "8_25": 1801, "25_8": 1802, "43_47": 1803, "47_43": 1804, "41_6": 1805, "6_41": 1806, "9_69": 1807, "69_9": 1808, "54_45": 1809, "45_54": 1810, "12_70": 1811, "70_12": 1812, "12_67": 1813, "67_12": 1814, "72_45": 1815, "57_42": 1816, "42_57": 1817, "18_57": 1818, "57_66": 1819, "66_57": 1820, "12_37": 1821, "37_12": 1822, "71_67": 1823, "67_71": 1824, "6_15": 1825, "15_6": 1826, "50_35": 1827, "35_50": 1828, "6_25": 1829, "25_6": 1830, "50_24": 1831, "24_50": 1832, "31_66": 1833, "40_5": 1834, "5_40": 1835, "64_46": 1836, "46_64": 1837, "64_31": 1838, "31_64": 1839, "16_16": 1840, "8_4": 1841, "4_8": 1842, "12_53": 1843, "53_12": 1844, "12_45": 1845, "45_12": 1846, "12_19": 1847, "19_12": 1848, "72_51": 1849, "51_72": 1850, "24_59": 1851, "59_24": 1852, "10_13": 1853, "13_10": 1854, "51_67": 1855, "67_51": 1856, "51_28": 1857, "28_51": 1858, "51_37": 1859, "37_51": 1860, "51_56": 1861, "56_51": 1862, "51_53": 1863, "53_51": 1864, "29_30": 1865, "30_29": 1866, "18_70": 1867, "26_45": 1868, "45_26": 1869, "31_44": 1870, "8_15": 1871, "15_8": 1872, "7_67": 1873, "67_7": 1874, "3_53": 1875, "53_3": 1876, "20_70": 1877, "70_20": 1878, "6_30": 1879, "30_6": 1880, "53_56": 1881, "56_53": 1882, "73_27": 1883, "27_73": 1884, "4_53": 1885, "53_4": 1886, "6_45": 1887, "45_6": 1888, "27_49": 1889, "49_27": 1890, "21_48": 1891, "48_21": 1892, "54_34": 1893, "34_54": 1894, "63_32": 1895, "49_7": 1896, "7_49": 1897, "64_71": 1898, "71_64": 1899, "15_17": 1900, "17_15": 1901, "13_31": 1902, "31_13": 1903, "35_60": 1904, "60_35": 1905, "2_2": 1906, "23_45": 1907, "45_23": 1908, "49_16": 1909, "16_49": 1910, "40_31": 1911, "31_40": 1912, "68_65": 1913, "65_68": 1914, "12_55": 1915, "55_12": 1916, "28_72": 1917, "72_28": 1918, "49_74": 1919, "74_49": 1920, "76_53": 1921, "53_76": 1922, "38_46": 1923, "46_38": 1924, "3_8": 1925, "8_3": 1926, "12_27": 1927, "27_12": 1928, "12_8": 1929, "8_12": 1930, "64_76": 1931, "76_64": 1932, "64_56": 1933, "56_64": 1934, "44_66": 1935, "66_44": 1936, "18_65": 1937, "65_18": 1938, "45_25": 1939, "25_45": 1940, "58_2": 1941, "2_58": 1942, "35_40": 1943, "40_35": 1944, "24_51": 1945, "51_24": 1946, "70_53": 1947, "53_70": 1948, "30_48": 1949, "48_30": 1950, "30_25": 1951, "25_30": 1952, "56_54": 1953, "20_31": 1954, "31_20": 1955, "54_8": 1956, "8_54": 1957, "28_59": 1958, "59_28": 1959, "66_15": 1960, "15_66": 1961, "3_74": 1962, "74_3": 1963, "20_4": 1964, "4_20": 1965, "10_68": 1966, "68_10": 1967, "16_66": 1968, "66_16": 1969, "26_17": 1970, "17_26": 1971, "51_58": 1972, "58_51": 1973, "51_13": 1974, "13_51": 1975, "74_73": 1976, "73_74": 1977, "67_25": 1978, "25_67": 1979, "58_8": 1980, "8_58": 1981, "57_68": 1982, "68_57": 1983, "3_20": 1984, "20_3": 1985, "67_57": 1986, "5_16": 1987, "16_5": 1988, "53_48": 1989, "48_53": 1990, "53_23": 1991, "23_53": 1992, "53_71": 1993, "71_53": 1994, "6_61": 1995, "61_6": 1996, "56_29": 1997, "64_59": 1998, "59_64": 1999, "55_54": 2000, "35_55": 2001, "55_35": 2002, "44_35": 2003, "35_44": 2004, "7_72": 2005, "72_7": 2006, "15_31": 2007, "31_15": 2008, "24_68": 2009, "68_24": 2010, "52_30": 2011, "30_52": 2012, "31_9": 2013, "58_34": 2014, "34_58": 2015, "8_57": 2016, "57_8": 2017, "29_18": 2018, "18_29": 2019, "42_7": 2020, "7_42": 2021, "31_42": 2022, "68_4": 2023, "4_68": 2024, "64_29": 2025, "29_64": 2026, "64_7": 2027, "7_64": 2028, "14_72": 2029, "72_14": 2030, "49_51": 2031, "51_49": 2032, "60_26": 2033, "26_60": 2034, "4_35": 2035, "35_4": 2036, "40_75": 2037, "75_40": 2038, "8_18": 2039, "18_8": 2040, "29_38": 2041, "38_29": 2042, "32_25": 2043, "25_32": 2044, "74_10": 2045, "10_74": 2046, "3_5": 2047, "5_3": 2048, "19_9": 2049, "9_19": 2050, "69_45": 2051, "17_72": 2052, "72_17": 2053, "48_35": 2054, "35_48": 2055, "18_25": 2056, "25_18": 2057, "46_4": 2058, "4_46": 2059, "64_48": 2060, "48_64": 2061, "42_26": 2062, "26_42": 2063, "10_5": 2064, "5_10": 2065, "51_9": 2066, "9_51": 2067, "37_72": 2068, "72_37": 2069, "19_18": 2070, "18_19": 2071, "59_65": 2072, "65_59": 2073, "72_15": 2074, "15_72": 2075, "7_65": 2076, "65_7": 2077, "8_71": 2078, "71_8": 2079, "30_72": 2080, "72_30": 2081, "12_72": 2082, "72_12": 2083, "13_28": 2084, "28_13": 2085, "17_65": 2086, "65_17": 2087, "52_58": 2088, "58_52": 2089, "49_38": 2090, "38_49": 2091, "30_34": 2092, "34_30": 2093, "19_68": 2094, "68_19": 2095, "74_74": 2096, "13_65": 2097, "65_13": 2098, "10_20": 2099, "20_10": 2100, "61_4": 2101, "4_61": 2102, "49_39": 2103, "39_49": 2104, "23_24": 2105, "24_23": 2106, "18_61": 2107, "61_18": 2108, "75_54": 2109, "54_75": 2110, "33_70": 2111, "70_33": 2112, "41_65": 2113, "65_41": 2114, "43_2": 2115, "2_43": 2116, "8_44": 2117, "44_8": 2118, "32_58": 2119, "58_32": 2120, "40_49": 2121, "49_40": 2122, "35_24": 2123, "24_35": 2124, "36_24": 2125, "24_36": 2126, "7_47": 2127, "47_7": 2128, "7_54": 2129, "54_7": 2130, "7_32": 2131, "32_7": 2132, "23_6": 2133, "6_23": 2134, "74_29": 2135, "29_74": 2136, "5_17": 2137, "17_5": 2138, "58_23": 2139, "23_58": 2140, "25_48": 2141, "48_25": 2142, "3_37": 2143, "37_3": 2144, "54_3": 2145, "3_54": 2146, "10_61": 2147, "61_10": 2148, "3_68": 2149, "68_3": 2150, "21_10": 2151, "10_21": 2152, "49_59": 2153, "59_49": 2154, "32_28": 2155, "28_32": 2156, "42_49": 2157, "49_42": 2158, "56_44": 2159, "48_47": 2160, "47_48": 2161, "48_67": 2162, "67_48": 2163, "57_65": 2164, "65_57": 2165, "27_26": 2166, "26_27": 2167, "27_59": 2168, "59_27": 2169, "58_58": 2170, "26_73": 2171, "73_26": 2172, "43_48": 2173, "48_43": 2174, "52_13": 2175, "13_52": 2176, "6_67": 2177, "67_6": 2178, "59_48": 2179, "48_59": 2180, "38_31": 2181, "31_38": 2182, "38_35": 2183, "35_38": 2184, "18_69": 2185, "69_18": 2186, "69_39": 2187, "39_69": 2188, "3_71": 2189, "71_3": 2190, "34_25": 2191, "25_34": 2192, "27_23": 2193, "23_27": 2194, "65_63": 2195, "63_65": 2196, "10_58": 2197, "58_10": 2198, "47_28": 2199, "28_47": 2200, "56_48": 2201, "48_42": 2202, "42_48": 2203, "3_55": 2204, "55_3": 2205, "8_23": 2206, "23_8": 2207, "29_43": 2208, "43_29": 2209, "29_55": 2210, "55_29": 2211, "20_19": 2212, "19_20": 2213, "55_59": 2214, "59_55": 2215, "64_9": 2216, "9_64": 2217, "58_24": 2218, "24_58": 2219, "38_73": 2220, "73_38": 2221, "38_3": 2222, "3_38": 2223, "43_26": 2224, "26_43": 2225, "36_70": 2226, "70_36": 2227, "36_46": 2228, "46_36": 2229, "36_72": 2230, "72_36": 2231, "29_23": 2232, "23_29": 2233, "3_39": 2234, "39_3": 2235, "19_29": 2236, "29_19": 2237, "62_62": 2238, "52_68": 2239, "68_52": 2240, "35_26": 2241, "26_35": 2242, "31_29": 2243, "15_67": 2244, "67_15": 2245, "55_56": 2246, "56_55": 2247, "25_68": 2248, "68_25": 2249, "41_34": 2250, "34_41": 2251, "3_60": 2252, "60_3": 2253, "50_6": 2254, "6_50": 2255, "50_17": 2256, "17_50": 2257, "24_20": 2258, "20_24": 2259, "33_48": 2260, "48_33": 2261, "59_23": 2262, "23_59": 2263, "54_25": 2264, "25_54": 2265, "71_32": 2266, "32_71": 2267, "39_53": 2268, "53_39": 2269, "66_53": 2270, "53_66": 2271, "54_68": 2272, "68_54": 2273, "58_65": 2274, "65_58": 2275, "6_20": 2276, "20_6": 2277, "34_31": 2278, "31_34": 2279, "13_39": 2280, "39_13": 2281, "29_69": 2282, "69_29": 2283, "45_76": 2284, "76_45": 2285, "17_17": 2286, "55_63": 2287, "63_55": 2288, "66_39": 2289, "39_66": 2290, "15_25": 2291, "25_15": 2292, "37_26": 2293, "26_37": 2294, "39_36": 2295, "36_39": 2296, "35_56": 2297, "56_35": 2298, "40_54": 2299, "54_40": 2300, "52_16": 2301, "16_52": 2302, "34_16": 2303, "16_34": 2304, "67_56": 2305, "56_67": 2306, "67_60": 2307, "60_67": 2308, "67_63": 2309, "63_67": 2310, "45_28": 2311, "28_45": 2312, "8_27": 2313, "27_8": 2314, "6_59": 2315, "59_6": 2316, "5_27": 2317, "27_5": 2318, "14_14": 2319, "43_25": 2320, "25_43": 2321, "34_46": 2322, "46_34": 2323, "42_2": 2324, "2_42": 2325, "34_57": 2326, "57_34": 2327, "51_50": 2328, "50_51": 2329, "68_53": 2330, "53_68": 2331, "49_13": 2332, "13_49": 2333, "55_66": 2334, "29_9": 2335, "9_29": 2336, "50_34": 2337, "34_50": 2338, "5_35": 2339, "35_5": 2340, "21_24": 2341, "24_21": 2342, "21_52": 2343, "52_21": 2344, "21_66": 2345, "66_21": 2346, "18_21": 2347, "15_27": 2348, "27_15": 2349, "3_35": 2350, "35_3": 2351, "40_61": 2352, "61_40": 2353, "49_61": 2354, "61_49": 2355, "40_48": 2356, "48_40": 2357, "68_68": 2358, "54_13": 2359, "13_54": 2360, "57_40": 2361, "40_57": 2362, "8_34": 2363, "34_8": 2364, "45_16": 2365, "16_45": 2366, "66_6": 2367, "6_66": 2368, "29_72": 2369, "72_29": 2370, "59_41": 2371, "41_59": 2372, "8_61": 2373, "61_8": 2374, "72_16": 2375, "16_72": 2376, "28_73": 2377, "73_28": 2378, "63_63": 2379, "63_72": 2380, "72_63": 2381, "63_37": 2382, "37_63": 2383, "63_12": 2384, "12_63": 2385, "63_60": 2386, "60_63": 2387, "69_61": 2388, "61_69": 2389, "14_64": 2390, "64_14": 2391, "21_43": 2392, "43_21": 2393, "48_71": 2394, "71_48": 2395, "26_61": 2396, "61_26": 2397, "67_59": 2398, "59_67": 2399, "75_47": 2400, "47_75": 2401, "75_9": 2402, "9_75": 2403, "75_64": 2404, "64_75": 2405, "59_47": 2406, "47_59": 2407, "34_61": 2408, "61_34": 2409, "11_10": 2410, "10_11": 2411, "11_8": 2412, "8_11": 2413, "30_33": 2414, "33_30": 2415, "41_28": 2416, "28_41": 2417, "46_73": 2418, "73_46": 2419, "42_15": 2420, "15_42": 2421, "37_16": 2422, "16_37": 2423, "35_12": 2424, "12_35": 2425, "35_57": 2426, "57_35": 2427, "10_73": 2428, "73_10": 2429, "67_54": 2430, "52_28": 2431, "28_52": 2432, "55_69": 2433, "69_55": 2434, "18_45": 2435, "43_54": 2436, "54_43": 2437, "15_71": 2438, "71_15": 2439, "15_23": 2440, "23_15": 2441, "20_71": 2442, "71_20": 2443, "42_47": 2444, "47_42": 2445, "52_67": 2446, "67_52": 2447, "58_48": 2448, "48_58": 2449, "45_7": 2450, "7_45": 2451, "45_37": 2452, "37_45": 2453, "55_45": 2454, "61_15": 2455, "15_61": 2456, "58_67": 2457, "67_58": 2458, "16_68": 2459, "68_16": 2460, "30_65": 2461, "65_30": 2462, "43_56": 2463, "56_43": 2464, "6_48": 2465, "48_6": 2466, "9_53": 2467, "53_9": 2468, "3_73": 2469, "73_3": 2470, "76_18": 2471, "18_76": 2472, "76_46": 2473, "46_76": 2474, "7_4": 2475, "4_7": 2476, "37_55": 2477, "55_37": 2478, "63_45": 2479, "45_46": 2480, "46_45": 2481, "48_63": 2482, "63_48": 2483, "18_24": 2484, "4_16": 2485, "16_4": 2486, "72_60": 2487, "60_72": 2488, "21_54": 2489, "54_21": 2490, "67_35": 2491, "35_67": 2492, "10_49": 2493, "49_10": 2494, "10_17": 2495, "17_10": 2496, "10_23": 2497, "23_10": 2498, "60_4": 2499, "4_60": 2500, "18_46": 2501, "46_18": 2502, "45_27": 2503, "27_45": 2504, "66_42": 2505, "42_66": 2506, "13_50": 2507, "50_13": 2508, "30_66": 2509, "66_30": 2510, "46_14": 2511, "14_46": 2512, "59_73": 2513, "73_59": 2514, "52_5": 2515, "5_52": 2516, "19_28": 2517, "28_19": 2518, "18_74": 2519, "74_18": 2520, "5_34": 2521, "34_5": 2522, "36_5": 2523, "5_36": 2524, "37_44": 2525, "44_37": 2526, "37_40": 2527, "40_37": 2528, "37_50": 2529, "50_37": 2530, "70_55": 2531, "55_70": 2532, "54_46": 2533, "46_54": 2534, "8_55": 2535, "55_8": 2536, "74_39": 2537, "39_74": 2538, "54_61": 2539, "61_54": 2540, "61_53": 2541, "53_61": 2542, "23_18": 2543, "18_23": 2544, "21_29": 2545, "29_21": 2546, "18_5": 2547, "5_18": 2548, "73_68": 2549, "66_46": 2550, "46_66": 2551, "6_73": 2552, "73_6": 2553, "32_19": 2554, "19_32": 2555, "45_9": 2556, "9_45": 2557, "33_54": 2558, "54_33": 2559, "15_32": 2560, "32_15": 2561, "43_69": 2562, "69_43": 2563, "30_21": 2564, "21_30": 2565, "18_54": 2566, "41_31": 2567, "31_41": 2568, "6_7": 2569, "7_6": 2570, "49_35": 2571, "35_49": 2572, "21_8": 2573, "8_21": 2574, "21_57": 2575, "57_21": 2576, "54_19": 2577, "19_54": 2578, "57_30": 2579, "30_57": 2580, "6_37": 2581, "37_6": 2582, "3_2": 2583, "2_3": 2584, "49_17": 2585, "17_49": 2586, "29_17": 2587, "17_29": 2588, "74_65": 2589, "65_74": 2590, "58_42": 2591, "42_58": 2592, "73_4": 2593, "4_73": 2594, "27_47": 2595, "47_27": 2596, "32_73": 2597, "73_32": 2598, "57_37": 2599, "37_57": 2600, "35_32": 2601, "38_48": 2602, "48_38": 2603, "57_27": 2604, "27_57": 2605, "57_5": 2606, "5_57": 2607, "57_36": 2608, "36_57": 2609, "18_3": 2610, "3_18": 2611, "39_46": 2612, "46_39": 2613, "43_53": 2614, "53_43": 2615, "65_23": 2616, "23_65": 2617, "60_52": 2618, "59_16": 2619, "16_59": 2620, "15_16": 2621, "16_15": 2622, "32_13": 2623, "13_32": 2624, "43_49": 2625, "49_43": 2626, "19_19": 2627, "59_59": 2628, "9_66": 2629, "66_9": 2630, "52_10": 2631, "10_52": 2632, "28_15": 2633, "15_28": 2634, "48_32": 2635, "32_48": 2636, "48_66": 2637, "66_48": 2638, "58_4": 2639, "4_58": 2640, "49_9": 2641, "9_49": 2642, "50_22": 2643, "22_50": 2644, "33_53": 2645, "53_33": 2646, "29_47": 2647, "47_29": 2648, "44_70": 2649, "70_44": 2650, "4_25": 2651, "25_4": 2652, "29_10": 2653, "10_29": 2654, "34_72": 2655, "72_34": 2656, "36_66": 2657, "66_36": 2658, "57_13": 2659, "13_57": 2660, "5_67": 2661, "67_5": 2662, "28_34": 2663, "34_28": 2664, "8_37": 2665, "37_8": 2666, "6_57": 2667, "57_6": 2668, "23_57": 2669, "57_23": 2670, "15_57": 2671, "57_15": 2672, "30_31": 2673, "31_30": 2674, "49_56": 2675, "56_49": 2676, "54_35": 2677, "35_54": 2678, "48_57": 2679, "57_48": 2680, "71_57": 2681, "57_71": 2682, "59_57": 2683, "57_59": 2684, "59_63": 2685, "63_59": 2686, "73_57": 2687, "57_73": 2688, "47_54": 2689, "56_24": 2690, "56_66": 2691, "54_71": 2692, "71_54": 2693, "20_57": 2694, "57_20": 2695, "69_54": 2696, "42_32": 2697, "32_42": 2698, "25_57": 2699, "57_25": 2700, "56_34": 2701, "6_56": 2702, "56_6": 2703, "54_44": 2704, "44_54": 2705, "74_24": 2706, "24_74": 2707, "74_8": 2708, "8_74": 2709, "15_74": 2710, "74_15": 2711, "10_8": 2712, "8_10": 2713, "74_69": 2714, "69_74": 2715, "55_74": 2716, "74_55": 2717, "74_66": 2718, "66_74": 2719, "74_58": 2720, "58_74": 2721, "74_35": 2722, "35_74": 2723, "74_48": 2724, "48_74": 2725, "74_16": 2726, "16_74": 2727, "74_30": 2728, "30_74": 2729, "74_31": 2730, "31_74": 2731, "74_38": 2732, "38_74": 2733, "74_21": 2734, "21_74": 2735, "34_55": 2736, "55_34": 2737, "19_31": 2738, "31_19": 2739, "24_47": 2740, "47_24": 2741, "66_69": 2742, "69_66": 2743, "58_47": 2744, "47_58": 2745, "72_49": 2746, "42_72": 2747, "72_42": 2748, "24_72": 2749, "72_24": 2750, "30_47": 2751, "47_30": 2752, "33_47": 2753, "47_33": 2754, "9_34": 2755, "34_9": 2756, "9_7": 2757, "7_9": 2758, "9_67": 2759, "67_9": 2760, "18_56": 2761, "56_18": 2762, "9_60": 2763, "60_9": 2764, "9_55": 2765, "55_9": 2766, "21_67": 2767, "67_21": 2768, "9_32": 2769, "32_9": 2770, "61_67": 2771, "67_61": 2772, "67_73": 2773, "73_67": 2774, "58_18": 2775, "18_58": 2776, "67_75": 2777, "75_67": 2778, "55_18": 2779, "18_55": 2780, "67_16": 2781, "16_67": 2782, "33_18": 2783, "18_33": 2784, "43_18": 2785, "18_43": 2786, "42_67": 2787, "67_42": 2788, "23_67": 2789, "67_23": 2790, "60_53": 2791, "53_60": 2792, "56_60": 2793, "60_56": 2794, "47_70": 2795, "8_47": 2796, "47_8": 2797, "49_47": 2798, "47_49": 2799, "23_69": 2800, "69_23": 2801, "25_31": 2802, "31_25": 2803, "42_69": 2804, "69_42": 2805, "42_63": 2806, "63_42": 2807, "42_18": 2808, "18_42": 2809, "23_73": 2810, "73_23": 2811, "42_55": 2812, "55_42": 2813, "25_26": 2814, "26_25": 2815, "6_72": 2816, "72_6": 2817, "58_72": 2818, "72_58": 2819, "70_35": 2820, "35_70": 2821, "42_16": 2822, "16_42": 2823, "42_30": 2824, "30_42": 2825, "42_37": 2826, "37_42": 2827, "42_68": 2828, "68_42": 2829, "42_73": 2830, "73_42": 2831, "30_26": 2832, "26_30": 2833, "58_63": 2834, "63_58": 2835, "23_56": 2836, "56_23": 2837, "42_56": 2838, "56_42": 2839, "42_74": 2840, "74_42": 2841, "20_73": 2842, "73_20": 2843, "33_63": 2844, "63_33": 2845, "59_31": 2846, "31_59": 2847, "33_72": 2848, "72_33": 2849, "48_7": 2850, "7_48": 2851, "47_34": 2852, "34_47": 2853, "48_16": 2854, "16_48": 2855, "55_30": 2856, "48_37": 2857, "37_48": 2858, "28_18": 2859, "18_28": 2860, "28_55": 2861, "55_28": 2862, "28_56": 2863, "56_28": 2864, "58_56": 2865, "56_58": 2866, "28_37": 2867, "37_28": 2868, "28_16": 2869, "16_28": 2870, "28_48": 2871, "48_28": 2872, "28_67": 2873, "67_28": 2874, "28_68": 2875, "68_28": 2876, "33_58": 2877, "58_33": 2878, "28_74": 2879, "74_28": 2880, "68_8": 2881, "8_68": 2882, "60_32": 2883, "21_56": 2884, "56_21": 2885, "6_74": 2886, "74_6": 2887, "56_74": 2888, "74_56": 2889, "60_74": 2890, "74_60": 2891, "35_66": 2892, "66_35": 2893, "26_74": 2894, "74_26": 2895, "37_60": 2896, "60_37": 2897, "70_13": 2898, "13_70": 2899, "57_74": 2900, "74_57": 2901, "18_9": 2902, "9_18": 2903, "63_74": 2904, "74_63": 2905, "18_35": 2906, "35_18": 2907, "61_61": 2908, "55_72": 2909, "72_55": 2910, "59_74": 2911, "74_59": 2912, "70_74": 2913, "74_70": 2914, "37_74": 2915, "74_37": 2916, "32_74": 2917, "74_32": 2918, "56_45": 2919, "33_31": 2920, "31_33": 2921, "63_9": 2922, "9_63": 2923, "45_73": 2924, "73_45": 2925, "47_45": 2926, "45_47": 2927, "18_71": 2928, "71_18": 2929, "43_8": 2930, "8_43": 2931, "72_13": 2932, "13_72": 2933, "21_21": 2934, "6_19": 2935, "19_6": 2936, "54_74": 2937, "74_54": 2938, "20_67": 2939, "67_20": 2940, "18_13": 2941, "13_18": 2942, "50_74": 2943, "74_50": 2944, "56_33": 2945, "33_56": 2946, "18_60": 2947, "60_18": 2948, "63_73": 2949, "73_63": 2950, "47_9": 2951, "9_47": 2952, "43_74": 2953, "74_43": 2954, "49_69": 2955, "69_49": 2956, "49_60": 2957, "60_49": 2958, "34_6": 2959, "6_34": 2960, "33_32": 2961, "32_33": 2962, "71_43": 2963, "43_71": 2964, "67_19": 2965, "19_67": 2966, "32_51": 2967, "51_32": 2968, "12_60": 2969, "60_12": 2970, "12_43": 2971, "43_12": 2972, "8_28": 2973, "28_8": 2974, "12_18": 2975, "18_12": 2976, "8_51": 2977, "51_8": 2978, "66_51": 2979, "51_66": 2980, "8_56": 2981, "56_8": 2982, "16_51": 2983, "51_16": 2984, "30_51": 2985, "51_30": 2986, "66_28": 2987, "28_66": 2988, "12_71": 2989, "71_12": 2990, "12_59": 2991, "59_12": 2992, "70_51": 2993, "51_70": 2994, "68_51": 2995, "51_68": 2996, "12_69": 2997, "69_12": 2998, "12_26": 2999, "26_12": 3000, "70_28": 3001, "28_70": 3002, "51_63": 3003, "63_51": 3004, "68_31": 3005, "31_68": 3006, "12_61": 3007, "61_12": 3008, "12_68": 3009, "68_12": 3010, "17_67": 3011, "67_17": 3012, "6_51": 3013, "51_6": 3014, "54_51": 3015, "51_54": 3016, "33_29": 3017, "29_33": 3018, "23_34": 3019, "34_23": 3020, "21_31": 3021, "31_21": 3022, "30_56": 3023, "56_30": 3024, "13_63": 3025, "63_13": 3026, "23_16": 3027, "16_23": 3028, "8_6": 3029, "6_8": 3030, "8_20": 3031, "20_8": 3032, "13_66": 3033, "66_13": 3034, "21_25": 3035, "25_21": 3036, "25_29": 3037, "29_25": 3038, "43_6": 3039, "6_43": 3040, "25_74": 3041, "74_25": 3042, "9_48": 3043, "48_9": 3044, "21_6": 3045, "6_21": 3046, "21_23": 3047, "23_21": 3048, "32_23": 3049, "23_32": 3050, "25_59": 3051, "59_25": 3052, "42_29": 3053, "29_42": 3054, "42_8": 3055, "8_42": 3056, "42_23": 3057, "23_42": 3058, "67_13": 3059, "13_67": 3060, "13_23": 3061, "23_13": 3062, "12_33": 3063, "33_12": 3064, "12_5": 3065, "5_12": 3066, "38_12": 3067, "12_38": 3068, "68_21": 3069, "21_68": 3070, "32_21": 3071, "21_32": 3072, "59_7": 3073, "7_59": 3074, "59_58": 3075, "58_59": 3076, "25_52": 3077, "52_25": 3078, "42_52": 3079, "52_42": 3080, "59_66": 3081, "66_59": 3082, "6_52": 3083, "52_6": 3084, "58_21": 3085, "21_58": 3086, "16_53": 3087, "53_16": 3088, "72_76": 3089, "76_72": 3090, "76_9": 3091, "9_76": 3092, "76_76": 3093, "76_26": 3094, "26_76": 3095, "46_9": 3096, "9_46": 3097, "76_24": 3098, "24_76": 3099, "26_9": 3100, "9_26": 3101, "76_48": 3102, "48_76": 3103, "76_5": 3104, "5_76": 3105, "76_38": 3106, "38_76": 3107, "76_65": 3108, "65_76": 3109, "76_17": 3110, "17_76": 3111, "76_16": 3112, "16_76": 3113, "76_6": 3114, "6_76": 3115, "24_7": 3116, "7_24": 3117, "76_55": 3118, "55_76": 3119, "76_47": 3120, "47_76": 3121, "8_9": 3122, "9_8": 3123, "76_51": 3124, "51_76": 3125, "34_64": 3126, "64_34": 3127, "76_27": 3128, "27_76": 3129, "21_9": 3130, "9_21": 3131, "9_30": 3132, "30_9": 3133, "42_9": 3134, "9_42": 3135, "58_9": 3136, "9_58": 3137, "70_9": 3138, "9_70": 3139, "51_61": 3140, "61_51": 3141, "25_61": 3142, "61_25": 3143, "8_19": 3144, "19_8": 3145, "66_61": 3146, "61_66": 3147, "8_5": 3148, "5_8": 3149, "8_38": 3150, "38_8": 3151, "25_72": 3152, "72_25": 3153, "6_12": 3154, "12_6": 3155, "15_12": 3156, "12_15": 3157, "66_19": 3158, "19_66": 3159, "30_61": 3160, "61_30": 3161, "43_61": 3162, "61_43": 3163, "59_61": 3164, "61_59": 3165, "34_7": 3166, "7_34": 3167, "73_61": 3168, "61_73": 3169, "48_61": 3170, "61_48": 3171, "19_61": 3172, "61_19": 3173, "19_57": 3174, "57_19": 3175, "19_52": 3176, "52_19": 3177, "19_42": 3178, "42_19": 3179, "19_7": 3180, "7_19": 3181, "19_48": 3182, "48_19": 3183, "19_26": 3184, "26_19": 3185, "19_16": 3186, "16_19": 3187, "11_11": 3188, "71_11": 3189, "11_71": 3190, "11_24": 3191, "24_11": 3192, "11_29": 3193, "29_11": 3194, "11_65": 3195, "65_11": 3196, "23_11": 3197, "11_23": 3198, "48_11": 3199, "11_48": 3200, "32_11": 3201, "11_32": 3202, "49_65": 3203, "65_49": 3204, "11_49": 3205, "49_11": 3206, "11_66": 3207, "66_11": 3208, "11_6": 3209, "6_11": 3210, "59_71": 3211, "71_59": 3212, "11_15": 3213, "15_11": 3214, "11_61": 3215, "61_11": 3216, "33_11": 3217, "11_33": 3218, "11_13": 3219, "13_11": 3220, "11_59": 3221, "59_11": 3222, "11_68": 3223, "68_11": 3224, "11_42": 3225, "42_11": 3226, "11_34": 3227, "34_11": 3228, "11_26": 3229, "26_11": 3230, "11_4": 3231, "4_11": 3232, "54_11": 3233, "11_54": 3234, "41_68": 3235, "68_41": 3236, "41_70": 3237, "70_41": 3238, "41_29": 3239, "29_41": 3240, "32_41": 3241, "41_32": 3242, "43_41": 3243, "41_43": 3244, "48_23": 3245, "23_48": 3246, "48_2": 3247, "2_48": 3248, "41_15": 3249, "15_41": 3250, "41_48": 3251, "48_41": 3252, "41_58": 3253, "58_41": 3254, "43_13": 3255, "13_43": 3256, "4_41": 3257, "41_4": 3258, "41_72": 3259, "72_41": 3260, "41_26": 3261, "26_41": 3262, "41_53": 3263, "53_41": 3264, "41_24": 3265, "24_41": 3266, "2_24": 3267, "24_2": 3268, "32_59": 3269, "59_32": 3270, "2_34": 3271, "34_2": 3272, "2_14": 3273, "14_2": 3274, "42_34": 3275, "34_42": 3276, "42_41": 3277, "41_42": 3278, "6_2": 3279, "2_6": 3280, "41_3": 3281, "3_41": 3282, "28_71": 3283, "71_28": 3284, "20_23": 3285, "23_20": 3286, "20_49": 3287, "49_20": 3288, "38_71": 3289, "71_38": 3290, "71_74": 3291, "74_71": 3292, "33_71": 3293, "71_33": 3294, "14_70": 3295, "70_14": 3296, "19_50": 3297, "50_19": 3298, "14_23": 3299, "23_14": 3300, "14_24": 3301, "24_14": 3302, "14_19": 3303, "19_14": 3304, "38_19": 3305, "19_38": 3306, "14_61": 3307, "61_14": 3308, "19_13": 3309, "13_19": 3310, "14_13": 3311, "13_14": 3312, "19_59": 3313, "59_19": 3314, "14_49": 3315, "49_14": 3316, "58_69": 3317, "69_58": 3318, "15_68": 3319, "68_15": 3320, "33_67": 3321, "67_33": 3322, "13_53": 3323, "53_13": 3324, "44_52": 3325, "52_44": 3326, "50_16": 3327, "16_50": 3328, "48_22": 3329, "22_48": 3330, "66_22": 3331, "22_66": 3332, "49_22": 3333, "22_49": 3334, "8_22": 3335, "22_8": 3336, "15_22": 3337, "22_15": 3338, "58_46": 3339, "46_58": 3340, "22_45": 3341, "45_22": 3342, "24_22": 3343, "22_24": 3344, "72_68": 3345, "68_72": 3346, "22_68": 3347, "68_22": 3348, "22_42": 3349, "42_22": 3350, "22_71": 3351, "71_22": 3352, "22_16": 3353, "16_22": 3354, "23_22": 3355, "22_23": 3356, "22_5": 3357, "5_22": 3358, "34_22": 3359, "22_34": 3360, "4_22": 3361, "22_4": 3362, "43_68": 3363, "68_43": 3364, "22_32": 3365, "32_22": 3366, "22_10": 3367, "10_22": 3368, "22_29": 3369, "29_22": 3370, "62_11": 3371, "11_62": 3372, "48_17": 3373, "17_48": 3374, "36_48": 3375, "48_36": 3376, "30_2": 3377, "2_30": 3378, "71_14": 3379, "14_71": 3380, "2_26": 3381, "26_2": 3382, "62_69": 3383, "69_62": 3384, "62_17": 3385, "17_62": 3386, "36_34": 3387, "34_36": 3388, "36_29": 3389, "29_36": 3390, "64_16": 3391, "16_64": 3392, "2_67": 3393, "67_2": 3394, "2_72": 3395, "72_2": 3396, "2_31": 3397, "31_2": 3398, "2_55": 3399, "55_2": 3400, "2_19": 3401, "19_2": 3402, "2_8": 3403, "8_2": 3404, "2_69": 3405, "69_2": 3406, "2_38": 3407, "38_2": 3408, "2_18": 3409, "18_2": 3410, "2_32": 3411, "32_2": 3412, "2_66": 3413, "66_2": 3414, "13_9": 3415, "9_13": 3416, "60_73": 3417, "73_60": 3418, "2_5": 3419, "5_2": 3420, "71_51": 3421, "51_71": 3422, "71_21": 3423, "21_71": 3424, "62_70": 3425, "70_62": 3426, "36_67": 3427, "67_36": 3428, "36_6": 3429, "6_36": 3430, "23_66": 3431, "66_23": 3432, "2_61": 3433, "61_2": 3434, "2_53": 3435, "53_2": 3436, "2_59": 3437, "59_2": 3438, "2_68": 3439, "68_2": 3440, "71_69": 3441, "69_71": 3442, "46_2": 3443, "2_46": 3444, "71_16": 3445, "16_71": 3446, "71_56": 3447, "56_71": 3448, "36_49": 3449, "49_36": 3450, "71_45": 3451, "45_71": 3452, "2_65": 3453, "65_2": 3454, "2_21": 3455, "21_2": 3456, "2_33": 3457, "33_2": 3458, 