{"PAD": 0, "DUMMY_START_RELATION": 1, "UNK": 2, "24_10": 3, "8_12": 4, "13_12": 5, "13_10": 6, "24_12": 7, "6_8": 8, "6_28": 9, "24_8": 10, "32_12": 11, "59_12": 12, "8_10": 13, "8_8": 14, "58_10": 15, "49_12": 16, "6_12": 17, "29_10": 18, "34_12": 19, "34_8": 20, "30_12": 21, "66_12": 22, "66_28": 23, "19_12": 24, "15_12": 25, "47_12": 26, "24_32": 27, "3_12": 28, "48_10": 29, "30_10": 30, "29_32": 31, "13_8": 32, "6_10": 33, "66_10": 34, "25_12": 35, "49_8": 36, "16_12": 37, "34_28": 38, "48_12": 39, "23_12": 40, "32_10": 41, "24_28": 42, "29_12": 43, "24_24": 44, "42_12": 45, "58_12": 46, "68_10": 47, "3_10": 48, "70_12": 49, "49_10": 50, "73_12": 51, "4_12": 52, "15_10": 53, "70_8": 54, "66_8": 55, "29_28": 56, "34_32": 57, "4_8": 58, "25_8": 59, "21_8": 60, "18_28": 61, "30_28": 62, "18_12": 63, "61_8": 64, "34_10": 65, "43_10": 66, "73_10": 67, "18_32": 68, "52_10": 69, "15_28": 70, "49_28": 71, "29_8": 72, "33_12": 73, "19_10": 74, "70_10": 75, "4_31": 76, "31_4": 77, "69_65": 78, "65_69": 79, "70_39": 80, "39_70": 81, "26_53": 82, "53_26": 83, "33_68": 84, "68_33": 85, "40_40": 86, "69_69": 87, "58_73": 88, "73_58": 89, "58_16": 90, "16_58": 91, "31_69": 92, "69_31": 93, "31_10": 94, "10_31": 95, "52_61": 96, "61_52": 97, "66_76": 98, "76_66": 99, "33_73": 100, "73_33": 101, "38_10": 102, "10_38": 103, "38_65": 104, "65_38": 105, "47_35": 106, "35_47": 107, "50_50": 108, "50_57": 109, "57_50": 110, "58_68": 111, "68_58": 112, "4_32": 113, "32_4": 114, "4_70": 115, "70_4": 116, "30_4": 117, "4_30": 118, "71_70": 119, "70_71": 120, "26_26": 121, "31_26": 122, "26_31": 123, "31_31": 124, "47_31": 125, "31_47": 126, "33_16": 127, "16_33": 128, "65_53": 129, "53_65": 130, "65_65": 131, "10_37": 132, "37_10": 133, "64_64": 134, "64_27": 135, "27_64": 136, "64_66": 137, "66_64": 138, "52_45": 139, "45_52": 140, "39_39": 141, "70_70": 142, "65_70": 143, "70_65": 144, "30_16": 145, "16_30": 146, "52_59": 147, "59_52": 148, "52_57": 149, "57_52": 150, "52_52": 151, "48_69": 152, "69_48": 153, "50_54": 154, "54_50": 155, "60_60": 156, "52_27": 157, "27_52": 158, "3_47": 159, "47_3": 160, "30_73": 161, "73_30": 162, "30_68": 163, "68_30": 164, "72_53": 165, "53_72": 166, "72_26": 167, "26_72": 168, "72_65": 169, "65_72": 170, "72_5": 171, "5_72": 172, "10_12": 173, "12_10": 174, "24_9": 175, "9_24": 176, "42_24": 177, "24_42": 178, "10_10": 179, "52_70": 180, "70_52": 181, "49_4": 182, "4_49": 183, "12_3": 184, "3_9": 185, "9_3": 186, "10_3": 187, "3_56": 188, "56_3": 189, "35_65": 190, "65_35": 191, "52_15": 192, "15_52": 193, "45_10": 194, "10_45": 195, "63_10": 196, "10_63": 197, "63_28": 198, "28_63": 199, "63_50": 200, "50_63": 201, "29_70": 202, "70_29": 203, "26_65": 204, "65_26": 205, "26_5": 206, "5_26": 207, "48_8": 208, "8_48": 209, "48_68": 210, "68_48": 211, "64_40": 212, "40_64": 213, "32_24": 214, "33_21": 215, "21_33": 216, "59_4": 217, "4_59": 218, "65_5": 219, "5_65": 220, "70_26": 221, "26_70": 222, "70_38": 223, "38_70": 224, "38_53": 225, "53_38": 226, "35_34": 227, "34_35": 228, "4_67": 229, "67_4": 230, "64_50": 231, "50_64": 232, "64_4": 233, "4_64": 234, "24_49": 235, "49_24": 236, "55_31": 237, "31_55": 238, "41_41": 239, "5_5": 240, "4_50": 241, "50_4": 242, "49_2": 243, "2_49": 244, "49_41": 245, "41_49": 246, "10_70": 247, "58_49": 248, "49_58": 249, "66_66": 250, "37_37": 251, "57_31": 252, "31_57": 253, "3_3": 254, "27_48": 255, "48_27": 256, "4_52": 257, "52_4": 258, "4_45": 259, "45_4": 260, "64_65": 261, "65_64": 262, "64_72": 263, "72_64": 264, "45_66": 265, "66_45": 266, "45_15": 267, "15_45": 268, "45_67": 269, "67_45": 270, "41_71": 271, "71_41": 272, "47_47": 273, "54_54": 274, "54_57": 275, "57_54": 276, "47_72": 277, "72_47": 278, "10_32": 279, "33_34": 280, "34_33": 281, "24_3": 282, "3_24": 283, "57_44": 284, "44_57": 285, "4_44": 286, "44_4": 287, "29_49": 288, "49_29": 289, "5_53": 290, "53_5": 291, "33_13": 292, "13_33": 293, "75_50": 294, "50_75": 295, "75_3": 296, "3_75": 297, "75_65": 298, "65_75": 299, "35_31": 300, "31_35": 301, "44_32": 302, "32_44": 303, "44_44": 304, "44_64": 305, "64_44": 306, "44_76": 307, "76_44": 308, "10_24": 309, "10_51": 310, "51_10": 311, "64_10": 312, "10_64": 313, "49_19": 314, "19_49": 315, "30_53": 316, "53_30": 317, "36_17": 318, "17_36": 319, "29_46": 320, "46_29": 321, "72_50": 322, "50_72": 323, "72_72": 324, "47_4": 325, "4_47": 326, "47_57": 327, "57_47": 328, "47_51": 329, "51_47": 330, "12_4": 331, "26_50": 332, "50_26": 333, "72_70": 334, "70_72": 335, "49_66": 336, "66_49": 337, "24_4": 338, "4_24": 339, "10_9": 340, "9_10": 341, "70_16": 342, "16_70": 343, "45_45": 344, "29_66": 345, "66_29": 346, "71_61": 347, "61_71": 348, "65_46": 349, "46_65": 350, "7_57": 351, "57_7": 352, "24_67": 353, "67_24": 354, "69_5": 355, "5_69": 356, "6_29": 357, "29_6": 358, "49_49": 359, "29_16": 360, "16_29": 361, "33_49": 362, "49_33": 363, "36_15": 364, "15_36": 365, "25_25": 366, "38_60": 367, "60_38": 368, "38_38": 369, "70_66": 370, "66_70": 371, "20_34": 372, "34_20": 373, "3_50": 374, "50_3": 375, "10_59": 376, "59_10": 377, "41_27": 378, "27_41": 379, "41_8": 380, "8_41": 381, "41_47": 382, "47_41": 383, "41_40": 384, "40_41": 385, "41_67": 386, "67_41": 387, "41_50": 388, "50_41": 389, "41_61": 390, "61_41": 391, "18_18": 392, "27_4": 393, "4_27": 394, "45_34": 395, "34_45": 396, "57_26": 397, "26_57": 398, "72_31": 399, "31_72": 400, "50_65": 401, "65_50": 402, "50_5": 403, "5_50": 404, "50_38": 405, "38_50": 406, "50_10": 407, "10_50": 408, "50_40": 409, "40_50": 410, "50_69": 411, "69_50": 412, "50_53": 413, "53_50": 414, "49_15": 415, "15_49": 416, "32_32": 417, "32_46": 418, "46_32": 419, "32_56": 420, "56_32": 421, "29_20": 422, "20_29": 423, "4_4": 424, "32_29": 425, "72_40": 426, "40_72": 427, "67_50": 428, "50_67": 429, "38_59": 430, "59_38": 431, "34_34": 432, "54_32": 433, "32_54": 434, "54_26": 435, "26_54": 436, "41_2": 437, "2_41": 438, "67_53": 439, "53_67": 440, "67_65": 441, "65_67": 442, "67_67": 443, "67_72": 444, "72_67": 445, "4_65": 446, "65_4": 447, "28_24": 448, "69_67": 449, "67_69": 450, "49_68": 451, "68_49": 452, "69_10": 453, "10_69": 454, "50_31": 455, "31_50": 456, "32_43": 457, "43_32": 458, "25_66": 459, "66_25": 460, "7_10": 461, "10_7": 462, "72_10": 463, "10_72": 464, "72_44": 465, "44_72": 466, "72_4": 467, "4_72": 468, "7_69": 469, "69_7": 470, "32_31": 471, "31_32": 472, "53_53": 473, "4_51": 474, "51_4": 475, "6_24": 476, "24_6": 477, "6_49": 478, "49_6": 479, "12_12": 480, "12_31": 481, "31_12": 482, "29_3": 483, "3_29": 484, "35_10": 485, "10_35": 486, "3_67": 487, "67_3": 488, "3_31": 489, "31_3": 490, "8_53": 491, "53_8": 492, "32_66": 493, "66_32": 494, "30_70": 495, "70_30": 496, "34_4": 497, "4_34": 498, "52_48": 499, "48_52": 500, "52_39": 501, "39_52": 502, "56_56": 503, "51_51": 504, "58_29": 505, "29_58": 506, "58_57": 507, "57_58": 508, "32_47": 509, "47_32": 510, "9_65": 511, "65_9": 512, "72_22": 513, "22_72": 514, "66_18": 515, "18_66": 516, "54_31": 517, "31_54": 518, "32_52": 519, "52_32": 520, "32_57": 521, "57_32": 522, "15_34": 523, "34_15": 524, "8_66": 525, "47_69": 526, "69_47": 527, "3_28": 528, "28_3": 529, "51_31": 530, "31_51": 531, "8_67": 532, "67_8": 533, "8_65": 534, "65_8": 535, "68_29": 536, "29_68": 537, "29_29": 538, "52_54": 539, "54_52": 540, "50_52": 541, "52_50": 542, "50_44": 543, "44_50": 544, "50_27": 545, "27_50": 546, "50_12": 547, "12_50": 548, "50_47": 549, "47_50": 550, "50_9": 551, "9_50": 552, "47_10": 553, "10_47": 554, "69_60": 555, "60_69": 556, "29_59": 557, "59_29": 558, "6_6": 559, "6_71": 560, "71_6": 561, "10_46": 562, "46_10": 563, "3_72": 564, "72_3": 565, "3_34": 566, "34_3": 567, "24_43": 568, "43_24": 569, "63_56": 570, "56_63": 571, "8_73": 572, "73_8": 573, "8_70": 574, "29_4": 575, "4_29": 576, "23_23": 577, "23_28": 578, "28_23": 579, "4_43": 580, "43_4": 581, "24_73": 582, "73_24": 583, "55_55": 584, "45_31": 585, "31_45": 586, "50_59": 587, "59_50": 588, "23_61": 589, "61_23": 590, "37_67": 591, "67_37": 592, "37_56": 593, "56_37": 594, "37_69": 595, "69_37": 596, "37_31": 597, "31_37": 598, "32_39": 599, "39_32": 600, "57_57": 601, "40_27": 602, "27_40": 603, "40_10": 604, "10_40": 605, "33_25": 606, "25_33": 607, "52_49": 608, "49_52": 609, "70_46": 610, "46_70": 611, "12_49": 612, "49_71": 613, "71_49": 614, "71_31": 615, "31_71": 616, "71_66": 617, "66_71": 618, "71_71": 619, "49_45": 620, "45_49": 621, "30_18": 622, "18_30": 623, "40_47": 624, "47_40": 625, "48_31": 626, "31_48": 627, "14_65": 628, "65_14": 629, "64_38": 630, "38_64": 631, "64_17": 632, "17_64": 633, "40_67": 634, "67_40": 635, "40_4": 636, "4_40": 637, "49_30": 638, "30_49": 639, "49_31": 640, "31_49": 641, "28_29": 642, "3_26": 643, "26_3": 644, "3_57": 645, "57_3": 646, "3_32": 647, "32_3": 648, "3_44": 649, "44_3": 650, "36_45": 651, "45_36": 652, "61_50": 653, "50_61": 654, "20_16": 655, "16_20": 656, "40_65": 657, "65_40": 658, "52_66": 659, "66_52": 660, "37_68": 661, "68_37": 662, "69_53": 663, "53_69": 664, "3_65": 665, "65_3": 666, "32_70": 667, "70_32": 668, "18_53": 669, "53_18": 670, "40_8": 671, "8_40": 672, "40_53": 673, "53_40": 674, "23_52": 675, "52_23": 676, "39_72": 677, "72_39": 678, "27_27": 679, "10_48": 680, "55_10": 681, "10_55": 682, "20_20": 683, "54_4": 684, "4_54": 685, "3_64": 686, "64_3": 687, "3_40": 688, "40_3": 689, "69_72": 690, "72_69": 691, "5_39": 692, "39_5": 693, "72_46": 694, "46_72": 695, "15_53": 696, "53_15": 697, "29_26": 698, "26_29": 699, "7_26": 700, "26_7": 701, "65_37": 702, "37_65": 703, "3_21": 704, "21_3": 705, "15_59": 706, "59_15": 707, "34_18": 708, "18_34": 709, "12_13": 710, "24_56": 711, "56_24": 712, "64_8": 713, "8_64": 714, "64_41": 715, "41_64": 716, "64_47": 717, "47_64": 718, "38_26": 719, "26_38": 720, "32_34": 721, "6_4": 722, "4_6": 723, "38_5": 724, "5_38": 725, "32_26": 726, "26_32": 727, "65_10": 728, "10_65": 729, "8_29": 730, "69_26": 731, "26_69": 732, "22_22": 733, "38_69": 734, "69_38": 735, "29_65": 736, "65_29": 737, "26_67": 738, "67_26": 739, "18_50": 740, "50_18": 741, "18_4": 742, "4_18": 743, "71_2": 744, "2_71": 745, "71_23": 746, "23_71": 747, "71_24": 748, "24_71": 749, "47_56": 750, "56_47": 751, "29_24": 752, "24_29": 753, "8_72": 754, "72_8": 755, "65_47": 756, "47_65": 757, "40_24": 758, "24_40": 759, "29_53": 760, "53_29": 761, "32_55": 762, "55_32": 763, "3_69": 764, "69_3": 765, "44_40": 766, "40_44": 767, "33_24": 768, "24_33": 769, "38_47": 770, "47_38": 771, "26_22": 772, "22_26": 773, "49_70": 774, "70_49": 775, "48_13": 776, "13_48": 777, "50_45": 778, "45_50": 779, "29_39": 780, "39_29": 781, "49_63": 782, "63_49": 783, "8_49": 784, "34_26": 785, "26_34": 786, "18_20": 787, "20_18": 788, "27_65": 789, "65_27": 790, "17_73": 791, "73_17": 792, "24_65": 793, "65_24": 794, "24_13": 795, "13_24": 796, "34_39": 797, "39_34": 798, "16_31": 799, "31_16": 800, "12_47": 801, "64_49": 802, "49_64": 803, "64_32": 804, "32_64": 805, "64_2": 806, "2_64": 807, "42_42": 808, "38_4": 809, "4_38": 810, "14_50": 811, "50_14": 812, "32_45": 813, "45_32": 814, "52_8": 815, "8_52": 816, "52_29": 817, "29_52": 818, "10_4": 819, "4_10": 820, "54_29": 821, "29_54": 822, "35_35": 823, "35_63": 824, "63_35": 825, "75_75": 826, "75_53": 827, "53_75": 828, "41_23": 829, "23_41": 830, "41_11": 831, "11_41": 832, "67_31": 833, "31_67": 834, "9_9": 835, "15_4": 836, "4_15": 837, "15_15": 838, "7_50": 839, "50_7": 840, "10_60": 841, "60_10": 842, "58_70": 843, "70_58": 844, "52_64": 845, "64_52": 846, "50_28": 847, "28_50": 848, "32_6": 849, "6_32": 850, "57_72": 851, "72_57": 852, "32_76": 853, "76_32": 854, "47_60": 855, "60_47": 856, "24_61": 857, "61_24": 858, "21_15": 859, "15_21": 860, "32_68": 861, "68_32": 862, "46_69": 863, "69_46": 864, "46_37": 865, "37_46": 866, "8_24": 867, "13_13": 868, "68_46": 869, "46_68": 870, "70_2": 871, "2_70": 872, "15_65": 873, "65_15": 874, "72_27": 875, "27_72": 876, "74_34": 877, "34_74": 878, "3_6": 879, "6_3": 880, "12_48": 881, "17_46": 882, "46_17": 883, "17_38": 884, "38_17": 885, "74_68": 886, "68_74": 887, "20_32": 888, "32_20": 889, "41_19": 890, "19_41": 891, "24_57": 892, "57_24": 893, "55_65": 894, "65_55": 895, "23_25": 896, "25_23": 897, "50_32": 898, "32_50": 899, "50_60": 900, "60_50": 901, "66_65": 902, "65_66": 903, "65_39": 904, "39_65": 905, "41_10": 906, "10_41": 907, "69_27": 908, "27_69": 909, "55_47": 910, "47_55": 911, "55_51": 912, "51_55": 913, "29_57": 914, "57_29": 915, "33_33": 916, "58_3": 917, "3_58": 918, "33_15": 919, "15_33": 920, "30_67": 921, "67_30": 922, "5_46": 923, "46_5": 924, "10_66": 925, "4_57": 926, "57_4": 927, "55_50": 928, "50_55": 929, "48_39": 930, "39_48": 931, "38_72": 932, "72_38": 933, "3_49": 934, "49_3": 935, "4_71": 936, "71_4": 937, "6_31": 938, "31_6": 939, "21_4": 940, "4_21": 941, "30_19": 942, "19_30": 943, "66_24": 944, "24_66": 945, "49_23": 946, "23_49": 947, "54_72": 948, "72_54": 949, "45_48": 950, "48_45": 951, "45_8": 952, "8_45": 953, "70_50": 954, "50_70": 955, "28_54": 956, "54_28": 957, "4_33": 958, "33_4": 959, "55_53": 960, "53_55": 961, "55_67": 962, "67_55": 963, "49_73": 964, "73_49": 965, "50_46": 966, "46_50": 967, "43_39": 968, "39_43": 969, "3_61": 970, "61_3": 971, "46_46": 972, "49_55": 973, "55_49": 974, "24_15": 975, "15_24": 976, "12_57": 977, "57_12": 978, "12_51": 979, "51_12": 980, "70_11": 981, "11_70": 982, "26_46": 983, "46_26": 984, "26_28": 985, "28_26": 986, "10_67": 987, "67_10": 988, "66_67": 989, "67_66": 990, "26_47": 991, "47_26": 992, "22_70": 993, "70_22": 994, "22_65": 995, "65_22": 996, "8_31": 997, "31_8": 998, "31_53": 999, "53_31": 1000, "31_63": 1001, "63_31": 1002, "72_75": 1003, "75_72": 1004, "4_56": 1005, "56_4": 1006, "33_8": 1007, "8_33": 1008, "69_70": 1009, "70_69": 1010, "43_65": 1011, "65_43": 1012, "72_73": 1013, "73_72": 1014, "34_71": 1015, "71_34": 1016, "29_51": 1017, "51_29": 1018, "4_26": 1019, "26_4": 1020, "24_70": 1021, "70_24": 1022, "45_64": 1023, "64_45": 1024, "29_67": 1025, "67_29": 1026, "25_20": 1027, "20_25": 1028, "32_49": 1029, "49_32": 1030, "30_58": 1031, "58_30": 1032, "27_70": 1033, "70_27": 1034, "50_49": 1035, "49_50": 1036, "10_56": 1037, "56_10": 1038, "10_44": 1039, "44_10": 1040, "10_57": 1041, "57_10": 1042, "10_75": 1043, "75_10": 1044, "10_18": 1045, "18_10": 1046, "64_53": 1047, "53_64": 1048, "43_43": 1049, "10_53": 1050, "53_10": 1051, "32_53": 1052, "53_32": 1053, "12_16": 1054, "8_59": 1055, "59_8": 1056, "25_70": 1057, "70_25": 1058, "25_3": 1059, "3_25": 1060, "25_65": 1061, "65_25": 1062, "45_29": 1063, "29_45": 1064, "35_37": 1065, "37_35": 1066, "35_28": 1067, "28_35": 1068, "21_70": 1069, "70_21": 1070, "38_40": 1071, "40_38": 1072, "57_45": 1073, "45_57": 1074, "29_61": 1075, "61_29": 1076, "24_55": 1077, "55_24": 1078, "75_31": 1079, "31_75": 1080, "75_56": 1081, "56_75": 1082, "49_72": 1083, "72_49": 1084, "70_15": 1085, "15_70": 1086, "51_3": 1087, "3_51": 1088, "18_7": 1089, "7_18": 1090, "42_10": 1091, "10_42": 1092, "37_70": 1093, "70_37": 1094, "7_31": 1095, "31_7": 1096, "4_28": 1097, "28_4": 1098, "48_70": 1099, "70_48": 1100, "34_21": 1101, "21_34": 1102, "69_56": 1103, "56_69": 1104, "70_73": 1105, "73_70": 1106, "63_34": 1107, "34_63": 1108, "70_59": 1109, "59_70": 1110, "64_57": 1111, "57_64": 1112, "70_45": 1113, "45_70": 1114, "45_24": 1115, "24_45": 1116, "45_53": 1117, "53_45": 1118, "50_30": 1119, "30_50": 1120, "23_26": 1121, "26_23": 1122, "12_34": 1123, "12_56": 1124, "56_12": 1125, "22_38": 1126, "38_22": 1127, "47_67": 1128, "67_47": 1129, "29_76": 1130, "76_29": 1131, "70_34": 1132, "34_70": 1133, "4_3": 1134, "3_4": 1135, "49_46": 1136, "46_49": 1137, "7_8": 1138, "8_7": 1139, "30_45": 1140, "45_30": 1141, "23_31": 1142, "31_23": 1143, "74_72": 1144, "72_74": 1145, "24_16": 1146, "16_24": 1147, "71_10": 1148, "10_71": 1149, "73_15": 1150, "15_73": 1151, "69_64": 1152, "64_69": 1153, "23_2": 1154, "2_23": 1155, "54_65": 1156, "65_54": 1157, "5_14": 1158, "14_5": 1159, "48_3": 1160, "3_48": 1161, "46_53": 1162, "53_46": 1163, "15_48": 1164, "48_15": 1165, "36_65": 1166, "65_36": 1167, "45_65": 1168, "65_45": 1169, "48_72": 1170, "72_48": 1171, "65_56": 1172, "56_65": 1173, "3_30": 1174, "30_3": 1175, "30_71": 1176, "71_30": 1177, "12_65": 1178, "65_12": 1179, "29_44": 1180, "44_29": 1181, "66_47": 1182, "47_66": 1183, "40_69": 1184, "69_40": 1185, "21_59": 1186, "59_21": 1187, "13_47": 1188, "47_13": 1189, "13_59": 1190, "59_13": 1191, "63_53": 1192, "53_63": 1193, "63_26": 1194, "26_63": 1195, "63_4": 1196, "4_63": 1197, "7_44": 1198, "44_7": 1199, "26_64": 1200, "64_26": 1201, "66_50": 1202, "50_66": 1203, "9_4": 1204, "4_9": 1205, "48_49": 1206, "49_48": 1207, "49_57": 1208, "57_49": 1209, "18_26": 1210, "26_18": 1211, "48_4": 1212, "4_48": 1213, "34_68": 1214, "68_34": 1215, "4_37": 1216, "37_4": 1217, "44_26": 1218, "26_44": 1219, "5_70": 1220, "70_5": 1221, "69_34": 1222, "34_69": 1223, "28_31": 1224, "31_28": 1225, "26_10": 1226, "10_26": 1227, "66_4": 1228, "4_66": 1229, "42_61": 1230, "61_42": 1231, "28_28": 1232, "26_6": 1233, "6_26": 1234, "10_34": 1235, "43_46": 1236, "46_43": 1237, "9_39": 1238, "39_9": 1239, "24_39": 1240, "39_24": 1241, "54_16": 1242, "16_54": 1243, "40_26": 1244, "26_40": 1245, "64_5": 1246, "5_64": 1247, "22_53": 1248, "53_22": 1249, "27_29": 1250, "29_27": 1251, "40_12": 1252, "12_40": 1253, "34_24": 1254, "24_34": 1255, "3_15": 1256, "15_3": 1257, "27_10": 1258, "10_27": 1259, "46_61": 1260, "61_46": 1261, "18_67": 1262, "67_18": 1263, "34_73": 1264, "73_34": 1265, "52_73": 1266, "73_52": 1267, "50_15": 1268, "15_50": 1269, "30_30": 1270, "70_19": 1271, "19_70": 1272, "70_68": 1273, "68_70": 1274, "70_6": 1275, "6_70": 1276, "70_64": 1277, "64_70": 1278, "60_65": 1279, "65_60": 1280, "44_69": 1281, "69_44": 1282, "44_65": 1283, "65_44": 1284, "44_27": 1285, "27_44": 1286, "72_66": 1287, "66_72": 1288, "72_18": 1289, "18_72": 1290, "49_34": 1291, "34_49": 1292, "23_72": 1293, "72_23": 1294, "12_23": 1295, "19_24": 1296, "24_19": 1297, "8_16": 1298, "16_8": 1299, "60_34": 1300, "34_60": 1301, "37_73": 1302, "73_37": 1303, "29_15": 1304, "15_29": 1305, "74_67": 1306, "67_74": 1307, "52_55": 1308, "55_52": 1309, "32_18": 1310, "32_38": 1311, "38_32": 1312, "64_36": 1313, "36_64": 1314, "49_53": 1315, "53_49": 1316, "48_50": 1317, "50_48": 1318, "48_65": 1319, "65_48": 1320, "34_29": 1321, "29_34": 1322, "41_66": 1323, "66_41": 1324, "41_25": 1325, "25_41": 1326, "4_69": 1327, "69_4": 1328, "41_69": 1329, "69_41": 1330, "41_12": 1331, "12_41": 1332, "8_32": 1333, "32_8": 1334, "39_68": 1335, "68_39": 1336, "64_24": 1337, "24_64": 1338, "47_44": 1339, "44_47": 1340, "10_28": 1341, "28_10": 1342, "67_34": 1343, "34_67": 1344, "32_61": 1345, "61_32": 1346, "27_53": 1347, "53_27": 1348, "65_31": 1349, "31_65": 1350, "17_32": 1351, "32_17": 1352, "4_5": 1353, "5_4": 1354, "52_31": 1355, "31_52": 1356, "6_68": 1357, "68_6": 1358, "47_74": 1359, "74_47": 1360, "75_55": 1361, "55_75": 1362, "32_72": 1363, "72_32": 1364, "26_39": 1365, "39_26": 1366, "57_46": 1367, "46_57": 1368, "3_70": 1369, "70_3": 1370, "53_28": 1371, "28_53": 1372, "24_31": 1373, "31_24": 1374, "29_71": 1375, "71_29": 1376, "12_29": 1377, "45_3": 1378, "3_45": 1379, "45_19": 1380, "19_45": 1381, "43_75": 1382, "75_43": 1383, "7_29": 1384, "29_7": 1385, "52_12": 1386, "12_52": 1387, "57_63": 1388, "63_57": 1389, "30_41": 1390, "41_30": 1391, "57_56": 1392, "56_57": 1393, "29_73": 1394, "73_29": 1395, "49_67": 1396, "67_49": 1397, "21_72": 1398, "72_21": 1399, "12_20": 1400, "20_12": 1401, "24_53": 1402, "53_24": 1403, "42_3": 1404, "3_42": 1405, "33_45": 1406, "45_33": 1407, "33_55": 1408, "55_33": 1409, "61_68": 1410, "68_61": 1411, "34_51": 1412, "51_34": 1413, "35_53": 1414, "53_35": 1415, "48_34": 1416, "34_48": 1417, "49_76": 1418, "76_49": 1419, "32_27": 1420, "27_32": 1421, "52_3": 1422, "3_52": 1423, "35_69": 1424, "69_35": 1425, "24_54": 1426, "54_24": 1427, "43_67": 1428, "67_43": 1429, "35_72": 1430, "72_35": 1431, "7_7": 1432, "32_30": 1433, "30_32": 1434, "38_61": 1435, "61_38": 1436, "34_19": 1437, "19_34": 1438, "10_16": 1439, "16_10": 1440, "5_28": 1441, "28_5": 1442, "5_73": 1443, "73_5": 1444, "5_71": 1445, "71_5": 1446, "5_13": 1447, "13_5": 1448, "33_6": 1449, "6_33": 1450, "3_27": 1451, "27_3": 1452, "3_66": 1453, "66_3": 1454, "68_18": 1455, "18_68": 1456, "36_69": 1457, "69_36": 1458, "12_32": 1459, "30_15": 1460, "15_30": 1461, "38_39": 1462, "39_38": 1463, "70_57": 1464, "57_70": 1465, "18_31": 1466, "31_18": 1467, "70_61": 1468, "61_70": 1469, "4_13": 1470, "13_4": 1471, "70_31": 1472, "31_70": 1473, "48_55": 1474, "55_48": 1475, "21_69": 1476, "69_21": 1477, "66_5": 1478, "5_66": 1479, "66_68": 1480, "68_66": 1481, "21_50": 1482, "50_21": 1483, "37_34": 1484, "34_37": 1485, "58_19": 1486, "19_58": 1487, "48_26": 1488, "26_48": 1489, "71_25": 1490, "25_71": 1491, "71_26": 1492, "26_71": 1493, "49_18": 1494, "18_49": 1495, "73_16": 1496, "16_73": 1497, "33_10": 1498, "10_33": 1499, "48_18": 1500, "18_48": 1501, "52_38": 1502, "38_52": 1503, "57_28": 1504, "28_57": 1505, "71_72": 1506, "72_71": 1507, "56_26": 1508, "26_56": 1509, "56_72": 1510, "72_56": 1511, "56_73": 1512, "73_56": 1513, "56_50": 1514, "50_56": 1515, "40_2": 1516, "2_40": 1517, "58_45": 1518, "45_58": 1519, "34_17": 1520, "17_34": 1521, "57_55": 1522, "55_57": 1523, "23_19": 1524, "19_23": 1525, "66_27": 1526, "27_66": 1527, "32_16": 1528, "16_32": 1529, "5_45": 1530, "45_5": 1531, "43_31": 1532, "31_43": 1533, "31_56": 1534, "56_31": 1535, "44_18": 1536, "18_44": 1537, "43_66": 1538, "66_43": 1539, "33_66": 1540, "66_33": 1541, "34_53": 1542, "53_34": 1543, "58_31": 1544, "31_58": 1545, "52_26": 1546, "26_52": 1547, "18_59": 1548, "59_18": 1549, "38_67": 1550, "67_38": 1551, "30_24": 1552, "24_30": 1553, "42_4": 1554, "4_42": 1555, "51_15": 1556, "15_51": 1557, "65_21": 1558, "21_65": 1559, "52_65": 1560, "65_52": 1561, "12_30": 1562, "52_18": 1563, "18_52": 1564, "28_25": 1565, "25_28": 1566, "18_64": 1567, "64_18": 1568, "26_24": 1569, "24_26": 1570, "66_63": 1571, "63_66": 1572, "34_66": 1573, "66_34": 1574, "57_61": 1575, "61_57": 1576, "57_51": 1577, "51_57": 1578, "57_9": 1579, "9_57": 1580, "4_55": 1581, "55_4": 1582, "51_59": 1583, "59_51": 1584, "6_16": 1585, "16_6": 1586, "70_76": 1587, "76_70": 1588, "28_49": 1589, "31_60": 1590, "60_31": 1591, "43_50": 1592, "50_43": 1593, "67_68": 1594, "68_67": 1595, "23_4": 1596, "4_23": 1597, "75_12": 1598, "12_75": 1599, "6_18": 1600, "18_6": 1601, "49_26": 1602, "26_49": 1603, "64_55": 1604, "55_64": 1605, "26_15": 1606, "15_26": 1607, "38_16": 1608, "16_38": 1609, "52_47": 1610, "47_52": 1611, "32_67": 1612, "67_32": 1613, "12_42": 1614, "64_67": 1615, "67_64": 1616, "69_57": 1617, "57_69": 1618, "69_63": 1619, "63_69": 1620, "69_28": 1621, "28_69": 1622, "69_17": 1623, "17_69": 1624, "70_54": 1625, "54_70": 1626, "49_54": 1627, "54_49": 1628, "47_37": 1629, "37_47": 1630, "28_12": 1631, "12_28": 1632, "49_25": 1633, "25_49": 1634, "10_43": 1635, "55_60": 1636, "60_55": 1637, "40_15": 1638, "15_40": 1639, "40_66": 1640, "66_40": 1641, "18_47": 1642, "47_18": 1643, "33_65": 1644, "65_33": 1645, "19_25": 1646, "25_19": 1647, "8_26": 1648, "26_8": 1649, "74_4": 1650, "4_74": 1651, "34_65": 1652, "65_34": 1653, "40_25": 1654, "25_40": 1655, "29_13": 1656, "13_29": 1657, "25_24": 1658, "24_25": 1659, "50_8": 1660, "8_50": 1661, "50_71": 1662, "71_50": 1663, "52_72": 1664, "72_52": 1665, "70_67": 1666, "67_70": 1667, "5_49": 1668, "49_5": 1669, "72_43": 1670, "43_72": 1671, "74_53": 1672, "53_74": 1673, "34_59": 1674, "59_34": 1675, "43_70": 1676, "70_43": 1677, "43_64": 1678, "64_43": 1679, "67_27": 1680, "27_67": 1681, "3_59": 1682, "59_3": 1683, "3_33": 1684, "33_3": 1685, "43_3": 1686, "3_43": 1687, "6_42": 1688, "42_6": 1689, "47_63": 1690, "63_47": 1691, "52_56": 1692, "56_52": 1693, "27_18": 1694, "18_27": 1695, "15_18": 1696, "18_15": 1697, "29_50": 1698, "50_29": 1699, "10_76": 1700, "76_10": 1701, "23_70": 1702, "70_23": 1703, "47_53": 1704, "53_47": 1705, "64_30": 1706, "30_64": 1707, "12_24": 1708, "48_48": 1709, "32_63": 1710, "63_32": 1711, "66_26": 1712, "26_66": 1713, "21_73": 1714, "73_21": 1715, "52_34": 1716, "34_52": 1717, "50_58": 1718, "58_50": 1719, "50_76": 1720, "76_50": 1721, "48_29": 1722, "29_48": 1723, "25_10": 1724, "10_25": 1725, "21_53": 1726, "53_21": 1727, "28_30": 1728, "8_76": 1729, "76_8": 1730, "54_12": 1731, "12_54": 1732, "7_70": 1733, "70_7": 1734, "50_73": 1735, "73_50": 1736, "48_73": 1737, "73_48": 1738, "39_45": 1739, "45_39": 1740, "28_6": 1741, "52_24": 1742, "24_52": 1743, "12_66": 1744, "64_15": 1745, "15_64": 1746, "57_76": 1747, "76_57": 1748, "37_53": 1749, "53_37": 1750, "43_57": 1751, "57_43": 1752, "29_2": 1753, "2_29": 1754, "61_65": 1755, "65_61": 1756, "37_38": 1757, "38_37": 1758, "44_53": 1759, "53_44": 1760, "54_63": 1761, "63_54": 1762, "40_71": 1763, "71_40": 1764, "48_24": 1765, "24_48": 1766, "73_31": 1767, "31_73": 1768, "73_66": 1769, "66_73": 1770, "38_27": 1771, "27_38": 1772, "32_69": 1773, "69_32": 1774, "21_64": 1775, "64_21": 1776, "52_37": 1777, "37_52": 1778, "30_8": 1779, "8_30": 1780, "3_7": 1781, "7_3": 1782, "75_5": 1783, "5_75": 1784, "75_52": 1785, "52_75": 1786, "57_53": 1787, "53_57": 1788, "72_9": 1789, "9_72": 1790, "58_71": 1791, "71_58": 1792, "36_38": 1793, "38_36": 1794, "8_25": 1795, "43_47": 1796, "47_43": 1797, "41_6": 1798, "6_41": 1799, "9_69": 1800, "69_9": 1801, "54_45": 1802, "45_54": 1803, "12_70": 1804, "12_67": 1805, "67_12": 1806, "72_45": 1807, "45_72": 1808, "57_42": 1809, "42_57": 1810, "57_18": 1811, "18_57": 1812, "57_66": 1813, "66_57": 1814, "12_37": 1815, "37_12": 1816, "71_67": 1817, "67_71": 1818, "6_15": 1819, "15_6": 1820, "50_35": 1821, "35_50": 1822, "6_25": 1823, "25_6": 1824, "50_24": 1825, "24_50": 1826, "66_31": 1827, "31_66": 1828, "40_5": 1829, "5_40": 1830, "64_46": 1831, "46_64": 1832, "64_31": 1833, "31_64": 1834, "16_16": 1835, "8_4": 1836, "12_53": 1837, "53_12": 1838, "12_45": 1839, "45_12": 1840, "12_19": 1841, "72_51": 1842, "51_72": 1843, "24_59": 1844, "59_24": 1845, "10_13": 1846, "51_67": 1847, "67_51": 1848, "51_28": 1849, "28_51": 1850, "51_37": 1851, "37_51": 1852, "51_56": 1853, "56_51": 1854, "51_53": 1855, "53_51": 1856, "29_30": 1857, "30_29": 1858, "70_18": 1859, "18_70": 1860, "66_56": 1861, "56_66": 1862, "26_45": 1863, "45_26": 1864, "44_31": 1865, "31_44": 1866, "8_15": 1867, "15_8": 1868, "7_67": 1869, "67_7": 1870, "3_53": 1871, "53_3": 1872, "20_70": 1873, "70_20": 1874, "6_30": 1875, "30_6": 1876, "53_56": 1877, "56_53": 1878, "73_27": 1879, "27_73": 1880, "4_53": 1881, "53_4": 1882, "6_45": 1883, "45_6": 1884, "27_49": 1885, "49_27": 1886, "21_48": 1887, "48_21": 1888, "54_34": 1889, "34_54": 1890, "49_7": 1891, "7_49": 1892, "64_71": 1893, "71_64": 1894, "15_17": 1895, "17_15": 1896, "13_31": 1897, "31_13": 1898, "35_60": 1899, "60_35": 1900, "2_2": 1901, "23_45": 1902, "45_23": 1903, "49_16": 1904, "16_49": 1905, "40_31": 1906, "31_40": 1907, "68_65": 1908, "65_68": 1909, "12_55": 1910, "55_12": 1911, "28_72": 1912, "72_28": 1913, "49_74": 1914, "74_49": 1915, "76_53": 1916, "53_76": 1917, "38_46": 1918, "46_38": 1919, "3_8": 1920, "8_3": 1921, "12_27": 1922, "27_12": 1923, "12_8": 1924, "64_76": 1925, "76_64": 1926, "64_56": 1927, "56_64": 1928, "44_66": 1929, "66_44": 1930, "18_65": 1931, "65_18": 1932, "45_25": 1933, "25_45": 1934, "58_2": 1935, "2_58": 1936, "35_40": 1937, "40_35": 1938, "24_51": 1939, "51_24": 1940, "70_53": 1941, "53_70": 1942, "30_48": 1943, "48_30": 1944, "30_25": 1945, "25_30": 1946, "54_56": 1947, "56_54": 1948, "20_31": 1949, "31_20": 1950, "54_8": 1951, "8_54": 1952, "28_59": 1953, "59_28": 1954, "66_15": 1955, "15_66": 1956, "3_74": 1957, "74_3": 1958, "20_4": 1959, "4_20": 1960, "10_68": 1961, "16_66": 1962, "66_16": 1963, "26_17": 1964, "17_26": 1965, "51_58": 1966, "58_51": 1967, "51_13": 1968, "13_51": 1969, "74_73": 1970, "73_74": 1971, "67_25": 1972, "25_67": 1973, "58_8": 1974, "8_58": 1975, "57_68": 1976, "68_57": 1977, "3_20": 1978, "20_3": 1979, "57_67": 1980, "67_57": 1981, "5_16": 1982, "16_5": 1983, "53_48": 1984, "48_53": 1985, "53_23": 1986, "23_53": 1987, "53_71": 1988, "71_53": 1989, "6_61": 1990, "61_6": 1991, "29_56": 1992, "56_29": 1993, "64_59": 1994, "59_64": 1995, "54_55": 1996, "55_54": 1997, "35_55": 1998, "55_35": 1999, "44_35": 2000, "35_44": 2001, "7_72": 2002, "72_7": 2003, "15_31": 2004, "31_15": 2005, "24_68": 2006, "68_24": 2007, "52_30": 2008, "30_52": 2009, "9_31": 2010, "31_9": 2011, "58_34": 2012, "34_58": 2013, "8_57": 2014, "57_8": 2015, "29_18": 2016, "18_29": 2017, "42_7": 2018, "7_42": 2019, "42_31": 2020, "31_42": 2021, "68_4": 2022, "4_68": 2023, "64_29": 2024, "29_64": 2025, "64_7": 2026, "7_64": 2027, "14_72": 2028, "72_14": 2029, "49_51": 2030, "51_49": 2031, "60_26": 2032, "26_60": 2033, "4_35": 2034, "35_4": 2035, "40_75": 2036, "75_40": 2037, "8_18": 2038, "18_8": 2039, "29_38": 2040, "38_29": 2041, "32_25": 2042, "25_32": 2043, "74_10": 2044, "10_74": 2045, "3_5": 2046, "5_3": 2047, "19_9": 2048, "9_19": 2049, "45_69": 2050, "69_45": 2051, "17_72": 2052, "72_17": 2053, "48_35": 2054, "35_48": 2055, "18_25": 2056, "25_18": 2057, "46_4": 2058, "4_46": 2059, "64_48": 2060, "48_64": 2061, "42_26": 2062, "26_42": 2063, "10_5": 2064, "5_10": 2065, "51_9": 2066, "9_51": 2067, "37_72": 2068, "72_37": 2069, "19_18": 2070, "18_19": 2071, "59_65": 2072, "65_59": 2073, "72_15": 2074, "15_72": 2075, "7_65": 2076, "65_7": 2077, "8_71": 2078, "71_8": 2079, "30_72": 2080, "72_30": 2081, "12_72": 2082, "72_12": 2083, "13_28": 2084, "28_13": 2085, "17_65": 2086, "65_17": 2087, "52_58": 2088, "58_52": 2089, "49_38": 2090, "38_49": 2091, "30_34": 2092, "34_30": 2093, "19_68": 2094, "68_19": 2095, "74_74": 2096, "13_65": 2097, "65_13": 2098, "10_20": 2099, "20_10": 2100, "61_4": 2101, "4_61": 2102, "49_39": 2103, "39_49": 2104, "23_24": 2105, "24_23": 2106, "32_60": 2107, "60_32": 2108, "18_61": 2109, "61_18": 2110, "75_54": 2111, "54_75": 2112, "33_70": 2113, "70_33": 2114, "41_65": 2115, "65_41": 2116, "43_2": 2117, "2_43": 2118, "8_44": 2119, "44_8": 2120, "32_58": 2121, "58_32": 2122, "40_49": 2123, "49_40": 2124, "35_24": 2125, "24_35": 2126, "36_24": 2127, "24_36": 2128, "7_47": 2129, "47_7": 2130, "7_54": 2131, "54_7": 2132, "7_32": 2133, "32_7": 2134, "23_6": 2135, "6_23": 2136, "74_29": 2137, "29_74": 2138, "5_17": 2139, "17_5": 2140, "58_23": 2141, "23_58": 2142, "25_48": 2143, "48_25": 2144, "3_37": 2145, "37_3": 2146, "54_3": 2147, "3_54": 2148, "10_61": 2149, "61_10": 2150, "3_68": 2151, "68_3": 2152, "21_10": 2153, "10_21": 2154, "49_59": 2155, "59_49": 2156, "32_28": 2157, "28_32": 2158, "42_49": 2159, "49_42": 2160, "44_56": 2161, "56_44": 2162, "48_47": 2163, "47_48": 2164, "48_67": 2165, "67_48": 2166, "57_65": 2167, "65_57": 2168, "27_26": 2169, "26_27": 2170, "27_59": 2171, "59_27": 2172, "58_58": 2173, "26_73": 2174, "73_26": 2175, "43_48": 2176, "48_43": 2177, "52_13": 2178, "13_52": 2179, "6_67": 2180, "67_6": 2181, "59_48": 2182, "48_59": 2183, "38_31": 2184, "31_38": 2185, "38_35": 2186, "35_38": 2187, "18_69": 2188, "69_18": 2189, "69_39": 2190, "39_69": 2191, "3_71": 2192, "71_3": 2193, "34_25": 2194, "25_34": 2195, "27_23": 2196, "23_27": 2197, "65_63": 2198, "63_65": 2199, "10_58": 2200, "47_28": 2201, "28_47": 2202, "48_56": 2203, "56_48": 2204, "48_42": 2205, "42_48": 2206, "3_55": 2207, "55_3": 2208, "8_23": 2209, "23_8": 2210, "29_43": 2211, "43_29": 2212, "29_55": 2213, "55_29": 2214, "20_19": 2215, "19_20": 2216, "55_59": 2217, "59_55": 2218, "64_9": 2219, "9_64": 2220, "58_24": 2221, "24_58": 2222, "38_73": 2223, "73_38": 2224, "38_3": 2225, "3_38": 2226, "43_26": 2227, "26_43": 2228, "36_70": 2229, "70_36": 2230, "36_46": 2231, "46_36": 2232, "36_72": 2233, "72_36": 2234, "29_23": 2235, "23_29": 2236, "3_39": 2237, "39_3": 2238, "19_29": 2239, "29_19": 2240, "62_62": 2241, "52_68": 2242, "68_52": 2243, "35_26": 2244, "26_35": 2245, "29_31": 2246, "31_29": 2247, "15_67": 2248, "67_15": 2249, "55_56": 2250, "56_55": 2251, "25_68": 2252, "68_25": 2253, "41_34": 2254, "34_41": 2255, "3_60": 2256, "60_3": 2257, "50_6": 2258, "6_50": 2259, "50_17": 2260, "17_50": 2261, "24_20": 2262, "20_24": 2263, "33_48": 2264, "48_33": 2265, "59_23": 2266, "23_59": 2267, "54_25": 2268, "25_54": 2269, "71_32": 2270, "32_71": 2271, "39_53": 2272, "53_39": 2273, "66_53": 2274, "53_66": 2275, "54_68": 2276, "68_54": 2277, "58_65": 2278, "65_58": 2279, "6_20": 2280, "20_6": 2281, "34_31": 2282, "31_34": 2283, "13_39": 2284, "39_13": 2285, "29_69": 2286, "69_29": 2287, "45_76": 2288, "76_45": 2289, "17_17": 2290, "55_63": 2291, "63_55": 2292, "66_39": 2293, "39_66": 2294, "15_25": 2295, "25_15": 2296, "37_26": 2297, "26_37": 2298, "39_36": 2299, "36_39": 2300, "35_56": 2301, "56_35": 2302, "40_54": 2303, "54_40": 2304, "52_16": 2305, "16_52": 2306, "34_16": 2307, "16_34": 2308, "67_56": 2309, "56_67": 2310, "67_60": 2311, "60_67": 2312, "67_63": 2313, "63_67": 2314, "45_28": 2315, "28_45": 2316, "8_27": 2317, "27_8": 2318, "6_59": 2319, "59_6": 2320, "5_27": 2321, "27_5": 2322, "14_14": 2323, "43_25": 2324, "25_43": 2325, "34_46": 2326, "46_34": 2327, "42_2": 2328, "2_42": 2329, "34_57": 2330, "57_34": 2331, "51_50": 2332, "50_51": 2333, "68_53": 2334, "53_68": 2335, "49_13": 2336, "13_49": 2337, "66_55": 2338, "55_66": 2339, "29_9": 2340, "9_29": 2341, "50_34": 2342, "34_50": 2343, "5_35": 2344, "35_5": 2345, "21_24": 2346, "24_21": 2347, "21_52": 2348, "52_21": 2349, "21_66": 2350, "66_21": 2351, "21_18": 2352, "18_21": 2353, "15_27": 2354, "27_15": 2355, "3_35": 2356, "35_3": 2357, "40_61": 2358, "61_40": 2359, "49_61": 2360, "61_49": 2361, "40_48": 2362, "48_40": 2363, "68_68": 2364, "54_13": 2365, "13_54": 2366, "57_40": 2367, "40_57": 2368, "8_34": 2369, "45_16": 2370, "16_45": 2371, "66_6": 2372, "6_66": 2373, "29_72": 2374, "72_29": 2375, "59_41": 2376, "41_59": 2377, "8_61": 2378, "72_16": 2379, "16_72": 2380, "28_73": 2381, "73_28": 2382, "63_63": 2383, "63_72": 2384, "72_63": 2385, "63_37": 2386, "37_63": 2387, "63_12": 2388, "12_63": 2389, "63_60": 2390, "60_63": 2391, "69_61": 2392, "61_69": 2393, "14_64": 2394, "64_14": 2395, "21_43": 2396, "43_21": 2397, "48_71": 2398, "71_48": 2399, "26_61": 2400, "61_26": 2401, "67_59": 2402, "59_67": 2403, "75_47": 2404, "47_75": 2405, "75_9": 2406, "9_75": 2407, "75_64": 2408, "64_75": 2409, "59_47": 2410, "47_59": 2411, "34_61": 2412, "61_34": 2413, "11_10": 2414, "10_11": 2415, "11_8": 2416, "8_11": 2417, "30_33": 2418, "33_30": 2419, "41_28": 2420, "28_41": 2421, "46_73": 2422, "73_46": 2423, "42_15": 2424, "15_42": 2425, "37_16": 2426, "16_37": 2427, "35_12": 2428, "12_35": 2429, "35_57": 2430, "57_35": 2431, "10_73": 2432, "67_54": 2433, "54_67": 2434, "52_28": 2435, "28_52": 2436, "55_69": 2437, "69_55": 2438, "18_45": 2439, "45_18": 2440, "43_54": 2441, "54_43": 2442, "15_71": 2443, "71_15": 2444, "15_23": 2445, "23_15": 2446, "20_71": 2447, "71_20": 2448, "42_47": 2449, "47_42": 2450, "52_67": 2451, "67_52": 2452, "58_48": 2453, "48_58": 2454, "45_7": 2455, "7_45": 2456, "45_37": 2457, "37_45": 2458, "45_55": 2459, "55_45": 2460, "61_15": 2461, "15_61": 2462, "58_67": 2463, "67_58": 2464, "16_68": 2465, "68_16": 2466, "30_65": 2467, "65_30": 2468, "43_56": 2469, "56_43": 2470, "6_48": 2471, "48_6": 2472, "9_53": 2473, "53_9": 2474, "3_73": 2475, "73_3": 2476, "76_18": 2477, "18_76": 2478, "76_46": 2479, "46_76": 2480, "7_4": 2481, "4_7": 2482, "37_55": 2483, "55_37": 2484, "45_63": 2485, "63_45": 2486, "45_46": 2487, "46_45": 2488, "48_63": 2489, "63_48": 2490, "24_18": 2491, "18_24": 2492, "4_16": 2493, "16_4": 2494, "72_60": 2495, "60_72": 2496, "21_54": 2497, "54_21": 2498, "67_35": 2499, "35_67": 2500, "10_49": 2501, "10_17": 2502, "17_10": 2503, "10_23": 2504, "23_10": 2505, "60_4": 2506, "4_60": 2507, "18_46": 2508, "46_18": 2509, "45_27": 2510, "27_45": 2511, "66_42": 2512, "42_66": 2513, "13_50": 2514, "50_13": 2515, "30_66": 2516, "66_30": 2517, "46_14": 2518, "14_46": 2519, "59_73": 2520, "73_59": 2521, "52_5": 2522, "5_52": 2523, "19_28": 2524, "28_19": 2525, "18_74": 2526, "74_18": 2527, "5_34": 2528, "34_5": 2529, "36_5": 2530, "5_36": 2531, "37_44": 2532, "44_37": 2533, "37_40": 2534, "40_37": 2535, "37_50": 2536, "50_37": 2537, "70_55": 2538, "55_70": 2539, "54_46": 2540, "46_54": 2541, "8_55": 2542, "55_8": 2543, "74_39": 2544, "39_74": 2545, "54_61": 2546, "61_54": 2547, "61_53": 2548, "53_61": 2549, "23_18": 2550, "18_23": 2551, "21_29": 2552, "29_21": 2553, "18_5": 2554, "5_18": 2555, "68_73": 2556, "73_68": 2557, "66_46": 2558, "46_66": 2559, "6_73": 2560, "73_6": 2561, "32_19": 2562, "19_32": 2563, "45_9": 2564, "9_45": 2565, "33_54": 2566, "54_33": 2567, "15_32": 2568, "32_15": 2569, "43_69": 2570, "69_43": 2571, "30_21": 2572, "21_30": 2573, "54_18": 2574, "18_54": 2575, "41_31": 2576, "31_41": 2577, "6_7": 2578, "7_6": 2579, "49_35": 2580, "35_49": 2581, "8_21": 2582, "21_57": 2583, "57_21": 2584, "54_19": 2585, "19_54": 2586, "57_30": 2587, "30_57": 2588, "6_37": 2589, "37_6": 2590, "3_2": 2591, "2_3": 2592, "49_17": 2593, "17_49": 2594, "29_17": 2595, "17_29": 2596, "74_65": 2597, "65_74": 2598, "58_42": 2599, "42_58": 2600, "73_4": 2601, "4_73": 2602, "27_47": 2603, "47_27": 2604, "32_73": 2605, "73_32": 2606, "57_37": 2607, "37_57": 2608, "32_35": 2609, "35_32": 2610, "38_48": 2611, "48_38": 2612, "57_27": 2613, "27_57": 2614, "57_5": 2615, "5_57": 2616, "57_36": 2617, "36_57": 2618, "18_3": 2619, "3_18": 2620, "39_46": 2621, "46_39": 2622, "43_53": 2623, "53_43": 2624, "65_23": 2625, "23_65": 2626, "52_60": 2627, "60_52": 2628, "59_16": 2629, "16_59": 2630, "15_16": 2631, "16_15": 2632, "32_13": 2633, "13_32": 2634, "43_49": 2635, "49_43": 2636, "19_19": 2637, "59_59": 2638, "9_66": 2639, "66_9": 2640, "10_52": 2641, "28_15": 2642, "8_13": 2643, "48_32": 2644, "32_48": 2645, "48_66": 2646, "66_48": 2647, "58_4": 2648, "4_58": 2649, "49_9": 2650, "9_49": 2651, "50_22": 2652, "22_50": 2653, "33_53": 2654, "53_33": 2655, "29_47": 2656, "47_29": 2657, "44_70": 2658, "70_44": 2659, "4_25": 2660, "25_4": 2661, "10_29": 2662, "34_72": 2663, "72_34": 2664, "36_66": 2665, "66_36": 2666, "57_13": 2667, "13_57": 2668, "5_67": 2669, "67_5": 2670, "28_34": 2671, "8_37": 2672, "37_8": 2673, "6_57": 2674, "57_6": 2675, "23_57": 2676, "57_23": 2677, "15_57": 2678, "57_15": 2679, "30_31": 2680, "31_30": 2681, "49_56": 2682, "56_49": 2683, "54_35": 2684, "35_54": 2685, "48_57": 2686, "57_48": 2687, "71_57": 2688, "57_71": 2689, "59_57": 2690, "57_59": 2691, "59_63": 2692, "63_59": 2693, "73_57": 2694, "57_73": 2695, "54_47": 2696, "47_54": 2697, "54_71": 2698, "71_54": 2699, "20_57": 2700, "57_20": 2701, "54_69": 2702, "69_54": 2703, "42_32": 2704, "32_42": 2705, "25_57": 2706, "57_25": 2707, "34_56": 2708, "56_34": 2709, "6_56": 2710, "56_6": 2711, "54_44": 2712, "44_54": 2713, "74_24": 2714, "24_74": 2715, "74_8": 2716, "8_74": 2717, "15_74": 2718, "74_15": 2719, "10_8": 2720, "74_69": 2721, "69_74": 2722, "55_74": 2723, "74_55": 2724, "74_66": 2725, "66_74": 2726, "74_58": 2727, "58_74": 2728, "74_35": 2729, "35_74": 2730, "74_48": 2731, "48_74": 2732, "74_16": 2733, "16_74": 2734, "74_30": 2735, "30_74": 2736, "74_31": 2737, "31_74": 2738, "74_38": 2739, "38_74": 2740, "74_21": 2741, "21_74": 2742, "34_55": 2743, "55_34": 2744, "19_31": 2745, "31_19": 2746, "24_47": 2747, "47_24": 2748, "66_69": 2749, "69_66": 2750, "58_47": 2751, "47_58": 2752, "42_72": 2753, "72_42": 2754, "24_72": 2755, "72_24": 2756, "30_47": 2757, "47_30": 2758, "33_47": 2759, "47_33": 2760, "9_34": 2761, "34_9": 2762, "9_7": 2763, "7_9": 2764, "9_67": 2765, "67_9": 2766, "18_56": 2767, "56_18": 2768, "9_60": 2769, "60_9": 2770, "9_55": 2771, "55_9": 2772, "21_67": 2773, "67_21": 2774, "9_32": 2775, "32_9": 2776, "61_67": 2777, "67_61": 2778, "67_73": 2779, "73_67": 2780, "58_18": 2781, "18_58": 2782, "67_75": 2783, "75_67": 2784, "55_18": 2785, "18_55": 2786, "67_16": 2787, "16_67": 2788, "33_18": 2789, "18_33": 2790, "43_18": 2791, "18_43": 2792, "42_67": 2793, "67_42": 2794, "23_67": 2795, "67_23": 2796, "60_53": 2797, "53_60": 2798, "56_60": 2799, "60_56": 2800, "70_47": 2801, "47_70": 2802, "8_47": 2803, "47_8": 2804, "49_47": 2805, "47_49": 2806, "23_69": 2807, "69_23": 2808, "25_31": 2809, "31_25": 2810, "42_69": 2811, "69_42": 2812, "42_63": 2813, "63_42": 2814, "42_18": 2815, "18_42": 2816, "23_73": 2817, "73_23": 2818, "42_55": 2819, "55_42": 2820, "25_26": 2821, "26_25": 2822, "6_72": 2823, "72_6": 2824, "58_72": 2825, "72_58": 2826, "70_35": 2827, "35_70": 2828, "42_16": 2829, "16_42": 2830, "42_30": 2831, "30_42": 2832, "42_37": 2833, "37_42": 2834, "42_68": 2835, "68_42": 2836, "42_73": 2837, "73_42": 2838, "30_26": 2839, "26_30": 2840, "58_63": 2841, "63_58": 2842, "23_56": 2843, "56_23": 2844, "42_56": 2845, "56_42": 2846, "42_74": 2847, "74_42": 2848, "20_73": 2849, "73_20": 2850, "33_63": 2851, "63_33": 2852, "59_31": 2853, "31_59": 2854, "33_72": 2855, "72_33": 2856, "48_7": 2857, "7_48": 2858, "47_34": 2859, "34_47": 2860, "48_16": 2861, "16_48": 2862, "30_55": 2863, "55_30": 2864, "48_37": 2865, "37_48": 2866, "28_18": 2867, "28_55": 2868, "55_28": 2869, "28_56": 2870, "56_28": 2871, "58_56": 2872, "56_58": 2873, "28_37": 2874, "37_28": 2875, "28_16": 2876, "16_28": 2877, "28_48": 2878, "48_28": 2879, "28_67": 2880, "67_28": 2881, "28_68": 2882, "68_28": 2883, "33_58": 2884, "58_33": 2885, "28_74": 2886, "74_28": 2887, "68_8": 2888, "8_68": 2889, "21_56": 2890, "56_21": 2891, "6_74": 2892, "74_6": 2893, "56_74": 2894, "74_56": 2895, "60_74": 2896, "74_60": 2897, "35_66": 2898, "66_35": 2899, "26_74": 2900, "74_26": 2901, "37_60": 2902, "60_37": 2903, "70_13": 2904, "13_70": 2905, "57_74": 2906, "74_57": 2907, "18_9": 2908, "9_18": 2909, "63_74": 2910, "74_63": 2911, "18_35": 2912, "35_18": 2913, "61_61": 2914, "55_72": 2915, "72_55": 2916, "59_74": 2917, "74_59": 2918, "70_74": 2919, "74_70": 2920, "37_74": 2921, "74_37": 2922, "32_74": 2923, "74_32": 2924, "56_45": 2925, "45_56": 2926, "33_31": 2927, "31_33": 2928, "63_9": 2929, "9_63": 2930, "45_73": 2931, "73_45": 2932, "47_45": 2933, "45_47": 2934, "18_71": 2935, "71_18": 2936, "43_8": 2937, "8_43": 2938, "72_13": 2939, "13_72": 2940, "21_21": 2941, "6_19": 2942, "19_6": 2943, "54_74": 2944, "74_54": 2945, "20_67": 2946, "67_20": 2947, "18_13": 2948, "13_18": 2949, "50_74": 2950, "74_50": 2951, "56_33": 2952, "33_56": 2953, "18_60": 2954, "60_18": 2955, "63_73": 2956, "73_63": 2957, "47_9": 2958, "9_47": 2959, "43_74": 2960, "74_43": 2961, "49_69": 2962, "69_49": 2963, "49_60": 2964, "60_49": 2965, "34_6": 2966, "6_34": 2967, "33_32": 2968, "32_33": 2969, "71_43": 2970, "43_71": 2971, "67_19": 2972, "19_67": 2973, "32_51": 2974, "51_32": 2975, "12_60": 2976, "60_12": 2977, "12_43": 2978, "43_12": 2979, "8_28": 2980, "28_8": 2981, "12_18": 2982, "8_51": 2983, "51_8": 2984, "66_51": 2985, "51_66": 2986, "8_56": 2987, "56_8": 2988, "16_51": 2989, "51_16": 2990, "30_51": 2991, "51_30": 2992, "28_66": 2993, "12_71": 2994, "71_12": 2995, "12_59": 2996, "70_51": 2997, "51_70": 2998, "68_51": 2999, "51_68": 3000, "12_69": 3001, "69_12": 3002, "12_26": 3003, "26_12": 3004, "70_28": 3005, "28_70": 3006, "51_63": 3007, "63_51": 3008, "68_31": 3009, "31_68": 3010, "12_61": 3011, "61_12": 3012, "12_68": 3013, "68_12": 3014, "17_67": 3015, "67_17": 3016, "6_51": 3017, "51_6": 3018, "54_51": 3019, "51_54": 3020, "33_29": 3021, "29_33": 3022, "23_34": 3023, "34_23": 3024, "21_31": 3025, "31_21": 3026, "30_56": 3027, "56_30": 3028, "13_63": 3029, "63_13": 3030, "23_16": 3031, "16_23": 3032, "8_6": 3033, "8_20": 3034, "20_8": 3035, "13_66": 3036, "66_13": 3037, "21_25": 3038, "25_21": 3039, "25_29": 3040, "29_25": 3041, "43_6": 3042, "6_43": 3043, "25_74": 3044, "74_25": 3045, "9_48": 3046, "48_9": 3047, "21_6": 3048, "6_21": 3049, "21_23": 3050, "23_21": 3051, "32_23": 3052, "23_32": 3053, "25_59": 3054, "59_25": 3055, "42_29": 3056, "29_42": 3057, "42_8": 3058, "8_42": 3059, "42_23": 3060, "23_42": 3061, "67_13": 3062, "13_67": 3063, "13_23": 3064, "23_13": 3065, "12_33": 3066, "12_5": 3067, "5_12": 3068, "38_12": 3069, "12_38": 3070, "68_21": 3071, "21_68": 3072, "32_21": 3073, "21_32": 3074, "59_7": 3075, "7_59": 3076, "59_58": 3077, "58_59": 3078, "25_52": 3079, "52_25": 3080, "42_52": 3081, "52_42": 3082, "59_66": 3083, "66_59": 3084, "6_52": 3085, "52_6": 3086, "58_21": 3087, "21_58": 3088, "16_53": 3089, "53_16": 3090, "72_76": 3091, "76_72": 3092, "76_9": 3093, "9_76": 3094, "76_76": 3095, "76_26": 3096, "26_76": 3097, "46_9": 3098, "9_46": 3099, "76_24": 3100, "24_76": 3101, "26_9": 3102, "9_26": 3103, "76_48": 3104, "48_76": 3105, "76_5": 3106, "5_76": 3107, "76_38": 3108, "38_76": 3109, "76_65": 3110, "65_76": 3111, "76_17": 3112, "17_76": 3113, "76_16": 3114, "16_76": 3115, "76_6": 3116, "6_76": 3117, "24_7": 3118, "7_24": 3119, "76_55": 3120, "55_76": 3121, "76_47": 3122, "47_76": 3123, "8_9": 3124, "9_8": 3125, "76_51": 3126, "51_76": 3127, "34_64": 3128, "64_34": 3129, "76_27": 3130, "27_76": 3131, "21_9": 3132, "9_21": 3133, "9_30": 3134, "30_9": 3135, "42_9": 3136, "9_42": 3137, "58_9": 3138, "9_58": 3139, "70_9": 3140, "9_70": 3141, "51_61": 3142, "61_51": 3143, "25_61": 3144, "61_25": 3145, "8_19": 3146, "19_8": 3147, "66_61": 3148, "61_66": 3149, "8_5": 3150, "5_8": 3151, "8_38": 3152, "38_8": 3153, "25_72": 3154, "72_25": 3155, "12_6": 3156, "12_15": 3157, "66_19": 3158, "19_66": 3159, "30_61": 3160, "61_30": 3161, "43_61": 3162, "61_43": 3163, "59_61": 3164, "61_59": 3165, "34_7": 3166, "7_34": 3167, "73_61": 3168, "61_73": 3169, "48_61": 3170, "61_48": 3171, "19_61": 3172, "61_19": 3173, "19_57": 3174, "57_19": 3175, "19_52": 3176, "52_19": 3177, "19_42": 3178, "42_19": 3179, "19_7": 3180, "7_19": 3181, "19_48": 3182, "48_19": 3183, "19_26": 3184, "26_19": 3185, "19_16": 3186, "16_19": 3187, "11_11": 3188, "71_11": 3189, "11_71": 3190, "11_24": 3191, "24_11": 3192, "11_29": 3193, "29_11": 3194, "11_65": 3195, "65_11": 3196, "23_11": 3197, "11_23": 3198, "48_11": 3199, "11_48": 3200, "32_11": 3201, "11_32": 3202, "49_65": 3203, "65_49": 3204, "11_49": 3205, "49_11": 3206, "11_66": 3207, "66_11": 3208, "11_6": 3209, "6_11": 3210, "59_71": 3211, "71_59": 3212, "11_15": 3213, "15_11": 3214, "11_61": 3215, "61_11": 3216, "33_11": 3217, "11_33": 3218, "11_13": 3219, "13_11": 3220, "11_59": 3221, "59_11": 3222, "11_68": 3223, "68_11": 3224, "11_42": 3225, "42_11": 3226, "11_34": 3227, "34_11": 3228, "11_26": 3229, "26_11": 3230, "11_4": 3231, "4_11": 3232, "54_11": 3233, "11_54": 3234, "41_68": 3235, "68_41": 3236, "41_70": 3237, "70_41": 3238, "41_29": 3239, "29_41": 3240, "32_41": 3241, "41_32": 3242, "43_41": 3243, "41_43": 3244, "48_23": 3245, "23_48": 3246, "48_2": 3247, "2_48": 3248, "41_15": 3249, "15_41": 3250, "41_48": 3251, "48_41": 3252, "41_58": 3253, "58_41": 3254, "43_13": 3255, "13_43": 3256, "4_41": 3257, "41_4": 3258, "41_72": 3259, "72_41": 3260, "41_26": 3261, "26_41": 3262, "41_53": 3263, "53_41": 3264, "41_24": 3265, "24_41": 3266, "2_24": 3267, "24_2": 3268, "32_59": 3269, "59_32": 3270, "2_34": 3271, "34_2": 3272, "2_14": 3273, "14_2": 3274, "42_34": 3275, "34_42": 3276, "42_41": 3277, "41_42": 3278, "6_2": 3279, "2_6": 3280, "41_3": 3281, "3_41": 3282, "28_71": 3283, "71_28": 3284, "20_23": 3285, "23_20": 3286, "20_49": 3287, "49_20": 3288, "38_71": 3289, "71_38": 3290, "71_74": 3291, "74_71": 3292, "33_71": 3293, "71_33": 3294, "14_70": 3295, "70_14": 3296, "19_50": 3297, "50_19": 3298, "14_23": 3299, "23_14": 3300, "14_24": 3301, "24_14": 3302, "14_19": 3303, "19_14": 3304, "38_19": 3305, "19_38": 3306, "14_61": 3307, "61_14": 3308, "19_13": 3309, "13_19": 3310, "14_13": 3311, "13_14": 3312, "19_59": 3313, "59_19": 3314, "14_49": 3315, "49_14": 3316, "58_69": 3317, "69_58": 3318, "15_68": 3319, "68_15": 3320, "33_67": 3321, "67_33": 3322, "13_53": 3323, "53_13": 3324, "44_52": 3325, "52_44": 3326, "50_16": 3327, "16_50": 3328, "48_22": 3329, "22_48": 3330, "66_22": 3331, "22_66": 3332, "49_22": 3333, "22_49": 3334, "8_22": 3335, "22_8": 3336, "15_22": 3337, "22_15": 3338, "58_46": 3339, "46_58": 3340, "22_45": 3341, "45_22": 3342, "24_22": 3343, "22_24": 3344, "72_68": 3345, "68_72": 3346, "22_68": 3347, "68_22": 3348, "22_42": 3349, "42_22": 3350, "22_71": 3351, "71_22": 3352, "22_16": 3353, "16_22": 3354, "23_22": 3355, "22_23": 3356, "22_5": 3357, "5_22": 3358, "34_22": 3359, "22_34": 3360, "4_22": 3361, "22_4": 3362, "43_68": 3363, "68_43": 3364, "22_32": 3365, "32_22": 3366, "22_10": 3367, "10_22": 3368, "22_29": 3369, "29_22": 3370, "62_11": 3371, "11_62": 3372, "48_17": 3373, "17_48": 3374, "36_48": 3375, "48_36": 3376, "30_2": 3377, "2_30": 3378, "71_14": 3379, "14_71": 3380, "2_26": 3381, "26_2": 3382, "62_69": 3383, "69_62": 3384, "62_17": 3385, "17_62": 3386, "36_34": 3387, "34_36": 3388, "36_29": 3389, "29_36": 3390, "64_16": 3391, "16_64": 3392, "2_67": 3393, "67_2": 3394, "2_72": 3395, "72_2": 3396, "2_31": 3397, "31_2": 3398, "2_55": 3399, "55_2": 3400, "2_19": 3401, "19_2": 3402, "2_8": 3403, "8_2": 3404, "2_69": 3405, "69_2": 3406, "2_38": 3407, "38_2": 3408, "2_18": 3409, "18_2": 3410, "2_32": 3411, "32_2": 3412, "2_66": 3413, "66_2": 3414, "13_9": 3415, "9_13": 3416, "60_73": 3417, "73_60": 3418, "2_5": 3419, "5_2": 3420, "71_51": 3421, "51_71": 3422, "71_21": 3423, "21_71": 3424, "62_70": 3425, "70_62": 3426, "36_67": 3427, "67_36": 3428, "36_6": 3429, "6_36": 3430, "23_66": 3431, "66_23": 3432, "2_61": 3433, "61_2": 3434, "2_53": 3435, "53_2": 3436, "2_59": 3437, "59_2": 3438, "2_68": 3439, "68_2": 3440, "71_69": 3441, "69_71": 3442, "46_2": 3443, "2_46": 3444, "71_16": 3445, "16_71": 3446, "71_56": 3447, "56_71": 3448, "36_49": 3449, "49_36": 3450, "71_45": 3451, "45_71": 3452, "2_65": 3453, "65_2": 3454, "2_21": 3455, "21_2": 3456, "2_33": 3457, "33_2": 3458, 