{"PAD": 0, "DUMMY_START_RELATION": 1, "UNK": 2, "7_50": 3, "4_12": 4, "59_32": 5, "4_31": 6, "7_57": 7, "4_10": 8, "4_57": 9, "7_31": 10, "29_32": 11, "24_57": 12, "54_57": 13, "4_32": 14, "4_45": 15, "50_50": 16, "23_57": 17, "67_45": 18, "24_32": 19, "3_64": 20, "4_70": 21, "4_26": 22, "24_26": 23, "4_50": 24, "4_63": 25, "4_44": 26, "4_55": 27, "50_72": 28, "4_49": 29, "7_45": 30, "24_68": 31, "13_12": 32, "4_51": 33, "70_70": 34, "50_69": 35, "4_60": 36, "13_31": 37, "7_44": 38, "52_57": 39, "3_67": 40, "4_54": 41, "50_44": 42, "3_12": 43, "64_44": 44, "3_45": 45, "3_50": 46, "4_67": 47, "7_47": 48, "24_10": 49, "29_57": 50, "4_9": 51, "3_57": 52, "70_57": 53, "49_45": 54, "48_32": 55, "3_44": 56, "7_10": 57, "7_32": 58, "75_43": 59, "50_64": 60, "56_38": 61, "70_26": 62, "24_50": 63, "44_44": 64, "50_31": 65, "3_32": 66, "67_67": 67, "4_56": 68, "24_45": 69, "50_57": 70, "4_72": 71, "29_26": 72, "8_32": 73, "15_57": 74, "64_57": 75, "42_32": 76, "29_45": 77, "24_35": 78, "4_47": 79, "29_43": 80, "49_57": 81, "21_57": 82, "43_56": 83, "4_69": 84, "29_66": 85, "9_9": 86, "15_59": 87, "13_45": 88, "3_72": 89, "55_18": 90, "24_67": 91, "29_29": 92, "21_72": 93, "49_50": 94, "52_52": 95, "7_72": 96, "24_54": 97, "29_48": 98, "18_18": 99, "3_65": 100, "34_57": 101, "75_12": 102, "24_12": 103, "4_29": 104, "18_10": 105, "4_71": 106, "49_26": 107, "55_55": 108, "59_12": 109, "34_54": 110, "29_44": 111, "75_57": 112, "4_40": 113, "66_32": 114, "31_56": 115, "4_66": 116, "26_72": 117, "34_32": 118, "4_28": 119, "58_57": 120, "24_18": 121, "66_57": 122, "70_45": 123, "4_15": 124, "65_65": 125, "50_10": 126, "24_28": 127, "73_57": 128, "4_38": 129, "3_40": 130, "58_50": 131, "43_57": 132, "56_12": 133, "64_64": 134, "70_32": 135, "7_35": 136, "4_68": 137, "47_47": 138, "8_12": 139, "68_32": 140, "4_64": 141, "4_30": 142, "42_57": 143, "34_26": 144, "24_66": 145, "8_50": 146, "31_31": 147, "75_50": 148, "24_69": 149, "3_51": 150, "10_10": 151, "58_32": 152, "6_32": 153, "8_44": 154, "5_50": 155, "75_32": 156, "29_54": 157, "19_49": 158, "19_45": 159, "75_64": 160, "3_9": 161, "58_51": 162, "4_37": 163, "4_53": 164, "18_31": 165, "26_57": 166, "25_32": 167, "17_32": 168, "74_32": 169, "47_12": 170, "4_6": 171, "50_65": 172, "33_10": 173, "13_10": 174, "10_51": 175, "61_54": 176, "4_18": 177, "49_32": 178, "19_57": 179, "8_57": 180, "69_44": 181, "7_26": 182, "9_57": 183, "52_45": 184, "10_63": 185, "7_12": 186, "24_6": 187, "4_24": 188, "3_66": 189, "48_48": 190, "47_31": 191, "46_50": 192, "46_45": 193, "52_50": 194, "48_57": 195, "43_50": 196, "73_32": 197, "4_35": 198, "15_32": 199, "7_54": 200, "8_68": 201, "49_31": 202, "18_72": 203, "23_54": 204, "29_6": 205, "4_48": 206, "10_66": 207, "7_42": 208, "3_20": 209, "4_46": 210, "38_10": 211, "13_13": 212, "24_8": 213, "43_32": 214, "4_42": 215, "69_65": 216, "65_69": 217, "8_8": 218, "70_39": 219, "39_70": 220, "26_53": 221, "53_26": 222, "33_68": 223, "68_33": 224, "40_40": 225, "69_69": 226, "58_73": 227, "73_58": 228, "58_16": 229, "16_58": 230, "31_69": 231, "69_31": 232, "31_10": 233, "10_31": 234, "52_61": 235, "61_52": 236, "66_76": 237, "76_66": 238, "33_73": 239, "73_33": 240, "10_38": 241, "38_65": 242, "65_38": 243, "47_35": 244, "35_47": 245, "57_50": 246, "58_68": 247, "68_58": 248, "32_4": 249, "70_4": 250, "30_4": 251, "71_70": 252, "70_71": 253, "26_26": 254, "31_26": 255, "26_31": 256, "31_47": 257, "33_16": 258, "16_33": 259, "65_53": 260, "53_65": 261, "10_37": 262, "37_10": 263, "64_27": 264, "27_64": 265, "64_66": 266, "66_64": 267, "45_52": 268, "39_39": 269, "65_70": 270, "70_65": 271, "30_16": 272, "16_30": 273, "52_59": 274, "59_52": 275, "57_52": 276, "48_69": 277, "69_48": 278, "50_54": 279, "54_50": 280, "60_60": 281, "52_27": 282, "27_52": 283, "3_47": 284, "47_3": 285, "30_73": 286, "73_30": 287, "30_68": 288, "68_30": 289, "72_53": 290, "53_72": 291, "72_26": 292, "72_65": 293, "65_72": 294, "72_5": 295, "5_72": 296, "10_12": 297, "12_10": 298, "24_9": 299, "9_24": 300, "42_24": 301, "24_42": 302, "24_24": 303, "52_70": 304, "70_52": 305, "49_4": 306, "12_3": 307, "9_3": 308, "3_10": 309, "10_3": 310, "3_56": 311, "56_3": 312, "35_65": 313, "65_35": 314, "52_15": 315, "15_52": 316, "45_10": 317, "10_45": 318, "63_10": 319, "63_28": 320, "28_63": 321, "63_50": 322, "50_63": 323, "29_70": 324, "70_29": 325, "26_65": 326, "65_26": 327, "26_5": 328, "5_26": 329, "48_8": 330, "8_48": 331, "48_68": 332, "68_48": 333, "64_40": 334, "40_64": 335, "32_24": 336, "33_21": 337, "21_33": 338, "59_4": 339, "4_59": 340, "65_5": 341, "5_65": 342, "26_70": 343, "70_38": 344, "38_70": 345, "38_53": 346, "53_38": 347, "35_34": 348, "34_35": 349, "67_4": 350, "64_50": 351, "64_4": 352, "24_49": 353, "49_24": 354, "55_31": 355, "31_55": 356, "41_41": 357, "5_5": 358, "50_4": 359, "49_2": 360, "2_49": 361, "49_41": 362, "41_49": 363, "70_10": 364, "10_70": 365, "58_49": 366, "49_58": 367, "66_66": 368, "37_37": 369, "57_31": 370, "31_57": 371, "3_3": 372, "27_48": 373, "48_27": 374, "4_52": 375, "52_4": 376, "45_4": 377, "64_65": 378, "65_64": 379, "64_72": 380, "72_64": 381, "45_66": 382, "66_45": 383, "45_15": 384, "15_45": 385, "45_67": 386, "41_71": 387, "71_41": 388, "54_54": 389, "57_54": 390, "47_72": 391, "72_47": 392, "32_10": 393, "10_32": 394, "33_34": 395, "34_33": 396, "24_3": 397, "3_24": 398, "57_44": 399, "44_57": 400, "44_4": 401, "29_49": 402, "49_29": 403, "5_53": 404, "53_5": 405, "33_13": 406, "13_33": 407, "50_75": 408, "75_3": 409, "3_75": 410, "75_65": 411, "65_75": 412, "35_31": 413, "31_35": 414, "44_32": 415, "32_44": 416, "44_64": 417, "44_76": 418, "76_44": 419, "10_24": 420, "51_10": 421, "64_10": 422, "10_64": 423, "49_19": 424, "30_53": 425, "53_30": 426, "36_17": 427, "17_36": 428, "29_46": 429, "46_29": 430, "72_50": 431, "72_72": 432, "47_4": 433, "47_57": 434, "57_47": 435, "47_51": 436, "51_47": 437, "26_50": 438, "50_26": 439, "72_70": 440, "70_72": 441, "49_66": 442, "66_49": 443, "24_4": 444, "10_9": 445, "9_10": 446, "70_16": 447, "16_70": 448, "45_45": 449, "66_29": 450, "71_61": 451, "61_71": 452, "65_46": 453, "46_65": 454, "67_24": 455, "69_5": 456, "5_69": 457, "6_29": 458, "49_49": 459, "29_16": 460, "16_29": 461, "33_49": 462, "49_33": 463, "12_4": 464, "36_15": 465, "15_36": 466, "25_25": 467, "38_60": 468, "60_38": 469, "38_38": 470, "70_66": 471, "66_70": 472, "20_34": 473, "34_20": 474, "50_3": 475, "10_59": 476, "59_10": 477, "41_27": 478, "27_41": 479, "41_8": 480, "8_41": 481, "41_47": 482, "47_41": 483, "41_40": 484, "40_41": 485, "41_67": 486, "67_41": 487, "41_50": 488, "50_41": 489, "41_61": 490, "61_41": 491, "27_4": 492, "4_27": 493, "45_34": 494, "34_45": 495, "57_26": 496, "72_31": 497, "31_72": 498, "65_50": 499, "50_5": 500, "50_38": 501, "38_50": 502, "10_50": 503, "50_40": 504, "40_50": 505, "69_50": 506, "50_53": 507, "53_50": 508, "49_15": 509, "15_49": 510, "32_32": 511, "32_46": 512, "46_32": 513, "32_56": 514, "56_32": 515, "29_20": 516, "20_29": 517, "4_4": 518, "32_29": 519, "72_40": 520, "40_72": 521, "67_50": 522, "50_67": 523, "38_59": 524, "59_38": 525, "34_34": 526, "54_32": 527, "32_54": 528, "54_26": 529, "26_54": 530, "41_2": 531, "2_41": 532, "67_53": 533, "53_67": 534, "67_65": 535, "65_67": 536, "67_72": 537, "72_67": 538, "4_65": 539, "65_4": 540, "28_24": 541, "69_67": 542, "67_69": 543, "49_68": 544, "68_49": 545, "69_10": 546, "10_69": 547, "31_50": 548, "32_43": 549, "25_66": 550, "66_25": 551, "10_7": 552, "72_10": 553, "10_72": 554, "72_44": 555, "44_72": 556, "72_4": 557, "7_69": 558, "69_7": 559, "32_31": 560, "31_32": 561, "53_53": 562, "51_4": 563, "6_24": 564, "6_49": 565, "49_6": 566, "12_12": 567, "12_31": 568, "31_12": 569, "29_3": 570, "3_29": 571, "35_10": 572, "10_35": 573, "67_3": 574, "3_31": 575, "31_3": 576, "8_53": 577, "53_8": 578, "32_66": 579, "30_70": 580, "70_30": 581, "34_4": 582, "4_34": 583, "52_48": 584, "48_52": 585, "52_39": 586, "39_52": 587, "56_56": 588, "51_51": 589, "58_29": 590, "29_58": 591, "57_58": 592, "32_47": 593, "47_32": 594, "9_65": 595, "65_9": 596, "72_22": 597, "22_72": 598, "66_18": 599, "18_66": 600, "54_31": 601, "31_54": 602, "32_52": 603, "52_32": 604, "32_57": 605, "57_32": 606, "15_34": 607, "34_15": 608, "8_66": 609, "66_8": 610, "47_69": 611, "69_47": 612, "3_28": 613, "28_3": 614, "51_31": 615, "31_51": 616, "8_67": 617, "67_8": 618, "8_65": 619, "65_8": 620, "68_29": 621, "29_68": 622, "52_54": 623, "54_52": 624, "50_52": 625, "44_50": 626, "50_27": 627, "27_50": 628, "50_12": 629, "12_50": 630, "50_47": 631, "47_50": 632, "50_9": 633, "9_50": 634, "47_10": 635, "10_47": 636, "69_60": 637, "60_69": 638, "29_59": 639, "59_29": 640, "6_6": 641, "6_71": 642, "71_6": 643, "10_46": 644, "46_10": 645, "72_3": 646, "3_34": 647, "34_3": 648, "24_43": 649, "43_24": 650, "63_56": 651, "56_63": 652, "8_73": 653, "73_8": 654, "8_70": 655, "70_8": 656, "29_4": 657, "23_23": 658, "23_28": 659, "28_23": 660, "4_43": 661, "43_4": 662, "24_73": 663, "73_24": 664, "45_31": 665, "31_45": 666, "50_59": 667, "59_50": 668, "23_61": 669, "61_23": 670, "37_67": 671, "67_37": 672, "37_56": 673, "56_37": 674, "37_69": 675, "69_37": 676, "37_31": 677, "31_37": 678, "32_39": 679, "39_32": 680, "57_57": 681, "40_27": 682, "27_40": 683, "40_10": 684, "10_40": 685, "33_25": 686, "25_33": 687, "52_49": 688, "49_52": 689, "70_46": 690, "46_70": 691, "49_12": 692, "12_49": 693, "49_71": 694, "71_49": 695, "71_31": 696, "31_71": 697, "71_66": 698, "66_71": 699, "71_71": 700, "45_49": 701, "30_18": 702, "18_30": 703, "40_47": 704, "47_40": 705, "48_31": 706, "31_48": 707, "14_65": 708, "65_14": 709, "64_38": 710, "38_64": 711, "64_17": 712, "17_64": 713, "40_67": 714, "67_40": 715, "40_4": 716, "49_30": 717, "30_49": 718, "31_49": 719, "29_28": 720, "28_29": 721, "3_26": 722, "26_3": 723, "57_3": 724, "32_3": 725, "44_3": 726, "36_45": 727, "45_36": 728, "61_50": 729, "50_61": 730, "20_16": 731, "16_20": 732, "40_65": 733, "65_40": 734, "52_66": 735, "66_52": 736, "37_68": 737, "68_37": 738, "69_53": 739, "53_69": 740, "65_3": 741, "32_70": 742, "18_53": 743, "53_18": 744, "40_8": 745, "8_40": 746, "40_53": 747, "53_40": 748, "23_52": 749, "52_23": 750, "39_72": 751, "72_39": 752, "27_27": 753, "48_10": 754, "10_48": 755, "55_10": 756, "10_55": 757, "13_8": 758, "8_13": 759, "20_20": 760, "54_4": 761, "64_3": 762, "40_3": 763, "69_72": 764, "72_69": 765, "5_39": 766, "39_5": 767, "72_46": 768, "46_72": 769, "15_53": 770, "53_15": 771, "26_29": 772, "26_7": 773, "65_37": 774, "37_65": 775, "3_21": 776, "21_3": 777, "59_15": 778, "34_18": 779, "18_34": 780, "12_13": 781, "24_56": 782, "56_24": 783, "64_8": 784, "8_64": 785, "64_41": 786, "41_64": 787, "64_47": 788, "47_64": 789, "38_26": 790, "26_38": 791, "6_4": 792, "32_34": 793, "38_5": 794, "5_38": 795, "32_26": 796, "26_32": 797, "65_10": 798, "10_65": 799, "29_8": 800, "8_29": 801, "69_26": 802, "26_69": 803, "22_22": 804, "38_69": 805, "69_38": 806, "29_65": 807, "65_29": 808, "26_67": 809, "67_26": 810, "18_50": 811, "50_18": 812, "18_4": 813, "71_2": 814, "2_71": 815, "71_23": 816, "23_71": 817, "71_24": 818, "24_71": 819, "47_56": 820, "56_47": 821, "29_24": 822, "24_29": 823, "8_72": 824, "72_8": 825, "65_47": 826, "47_65": 827, "40_24": 828, "24_40": 829, "29_53": 830, "53_29": 831, "32_55": 832, "55_32": 833, "3_69": 834, "69_3": 835, "44_40": 836, "40_44": 837, "33_24": 838, "24_33": 839, "38_47": 840, "47_38": 841, "26_22": 842, "22_26": 843, "49_70": 844, "70_49": 845, "48_13": 846, "13_48": 847, "50_45": 848, "45_50": 849, "29_39": 850, "39_29": 851, "49_63": 852, "63_49": 853, "8_49": 854, "49_8": 855, "18_20": 856, "20_18": 857, "27_65": 858, "65_27": 859, "17_73": 860, "73_17": 861, "24_65": 862, "65_24": 863, "24_13": 864, "13_24": 865, "34_39": 866, "39_34": 867, "16_31": 868, "31_16": 869, "12_47": 870, "64_49": 871, "49_64": 872, "64_32": 873, "32_64": 874, "64_2": 875, "2_64": 876, "42_42": 877, "38_4": 878, "14_50": 879, "50_14": 880, "32_45": 881, "45_32": 882, "52_8": 883, "8_52": 884, "52_29": 885, "29_52": 886, "10_4": 887, "54_29": 888, "35_35": 889, "35_63": 890, "63_35": 891, "75_75": 892, "75_53": 893, "53_75": 894, "41_23": 895, "23_41": 896, "41_11": 897, "11_41": 898, "67_31": 899, "31_67": 900, "15_4": 901, "15_15": 902, "10_60": 903, "60_10": 904, "58_70": 905, "70_58": 906, "52_64": 907, "64_52": 908, "50_28": 909, "28_50": 910, "32_6": 911, "57_72": 912, "72_57": 913, "32_76": 914, "76_32": 915, "47_60": 916, "60_47": 917, "24_61": 918, "61_24": 919, "21_15": 920, "15_21": 921, "32_68": 922, "46_69": 923, "69_46": 924, "46_37": 925, "37_46": 926, "8_24": 927, "68_46": 928, "46_68": 929, "70_2": 930, "2_70": 931, "15_65": 932, "65_15": 933, "72_27": 934, "27_72": 935, "74_34": 936, "34_74": 937, "3_6": 938, "6_3": 939, "48_12": 940, "12_48": 941, "17_46": 942, "46_17": 943, "17_38": 944, "38_17": 945, "74_68": 946, "68_74": 947, "20_32": 948, "32_20": 949, "41_19": 950, "19_41": 951, "57_24": 952, "55_65": 953, "65_55": 954, "23_25": 955, "25_23": 956, "50_32": 957, "32_50": 958, "50_60": 959, "60_50": 960, "66_65": 961, "65_66": 962, "65_39": 963, "39_65": 964, "41_10": 965, "10_41": 966, "69_27": 967, "27_69": 968, "55_47": 969, "47_55": 970, "55_51": 971, "51_55": 972, "33_33": 973, "58_3": 974, "3_58": 975, "33_15": 976, "15_33": 977, "30_67": 978, "67_30": 979, "5_46": 980, "46_5": 981, "66_10": 982, "57_4": 983, "31_4": 984, "55_50": 985, "50_55": 986, "48_39": 987, "39_48": 988, "38_72": 989, "72_38": 990, "3_49": 991, "49_3": 992, "71_4": 993, "6_31": 994, "31_6": 995, "21_4": 996, "4_21": 997, "30_19": 998, "19_30": 999, "66_24": 1000, "49_23": 1001, "23_49": 1002, "54_72": 1003, "72_54": 1004, "45_48": 1005, "48_45": 1006, "45_8": 1007, "8_45": 1008, "70_50": 1009, "50_70": 1010, "28_54": 1011, "54_28": 1012, "4_33": 1013, "33_4": 1014, "55_53": 1015, "53_55": 1016, "55_67": 1017, "67_55": 1018, "49_73": 1019, "73_49": 1020, "50_46": 1021, "43_39": 1022, "39_43": 1023, "3_61": 1024, "61_3": 1025, "46_46": 1026, "49_55": 1027, "55_49": 1028, "24_15": 1029, "15_24": 1030, "12_57": 1031, "57_12": 1032, "12_51": 1033, "51_12": 1034, "3_13": 1035, "13_3": 1036, "70_11": 1037, "11_70": 1038, "26_46": 1039, "46_26": 1040, "26_28": 1041, "28_26": 1042, "10_67": 1043, "67_10": 1044, "66_67": 1045, "67_66": 1046, "26_47": 1047, "47_26": 1048, "22_70": 1049, "70_22": 1050, "22_65": 1051, "65_22": 1052, "8_31": 1053, "31_8": 1054, "31_53": 1055, "53_31": 1056, "31_63": 1057, "63_31": 1058, "72_75": 1059, "75_72": 1060, "33_8": 1061, "8_33": 1062, "69_70": 1063, "70_69": 1064, "43_65": 1065, "65_43": 1066, "57_29": 1067, "72_73": 1068, "73_72": 1069, "34_71": 1070, "71_34": 1071, "29_51": 1072, "51_29": 1073, "24_70": 1074, "70_24": 1075, "45_64": 1076, "64_45": 1077, "29_67": 1078, "67_29": 1079, "25_20": 1080, "20_25": 1081, "32_49": 1082, "30_58": 1083, "58_30": 1084, "27_70": 1085, "70_27": 1086, "50_49": 1087, "10_56": 1088, "56_10": 1089, "10_44": 1090, "44_10": 1091, "10_57": 1092, "57_10": 1093, "10_75": 1094, "75_10": 1095, "10_18": 1096, "64_53": 1097, "53_64": 1098, "43_43": 1099, "10_53": 1100, "53_10": 1101, "32_53": 1102, "53_32": 1103, "12_16": 1104, "16_12": 1105, "8_59": 1106, "59_8": 1107, "25_70": 1108, "70_25": 1109, "25_3": 1110, "3_25": 1111, "25_65": 1112, "65_25": 1113, "45_29": 1114, "35_37": 1115, "37_35": 1116, "35_28": 1117, "28_35": 1118, "21_70": 1119, "70_21": 1120, "38_40": 1121, "40_38": 1122, "57_45": 1123, "45_57": 1124, "29_61": 1125, "61_29": 1126, "24_55": 1127, "55_24": 1128, "75_31": 1129, "31_75": 1130, "75_56": 1131, "56_75": 1132, "49_72": 1133, "72_49": 1134, "70_15": 1135, "15_70": 1136, "51_3": 1137, "18_7": 1138, "7_18": 1139, "42_10": 1140, "10_42": 1141, "37_70": 1142, "70_37": 1143, "31_7": 1144, "28_4": 1145, "48_70": 1146, "70_48": 1147, "34_21": 1148, "21_34": 1149, "69_56": 1150, "56_69": 1151, "70_73": 1152, "73_70": 1153, "63_34": 1154, "34_63": 1155, "70_59": 1156, "59_70": 1157, "57_64": 1158, "45_70": 1159, "45_24": 1160, "26_4": 1161, "45_53": 1162, "53_45": 1163, "50_30": 1164, "30_50": 1165, "23_26": 1166, "26_23": 1167, "12_34": 1168, "34_12": 1169, "12_56": 1170, "22_38": 1171, "38_22": 1172, "47_67": 1173, "67_47": 1174, "29_76": 1175, "76_29": 1176, "70_34": 1177, "34_70": 1178, "4_3": 1179, "3_4": 1180, "49_46": 1181, "46_49": 1182, "7_8": 1183, "8_7": 1184, "30_45": 1185, "45_30": 1186, "23_31": 1187, "31_23": 1188, "74_72": 1189, "72_74": 1190, "24_16": 1191, "16_24": 1192, "71_10": 1193, "10_71": 1194, "73_15": 1195, "15_73": 1196, "69_64": 1197, "64_69": 1198, "23_2": 1199, "2_23": 1200, "54_65": 1201, "65_54": 1202, "5_14": 1203, "14_5": 1204, "48_3": 1205, "3_48": 1206, "46_53": 1207, "53_46": 1208, "15_48": 1209, "48_15": 1210, "36_65": 1211, "65_36": 1212, "45_65": 1213, "65_45": 1214, "48_72": 1215, "72_48": 1216, "65_56": 1217, "56_65": 1218, "3_30": 1219, "30_3": 1220, "30_71": 1221, "71_30": 1222, "12_65": 1223, "65_12": 1224, "44_29": 1225, "66_47": 1226, "47_66": 1227, "40_69": 1228, "69_40": 1229, "21_59": 1230, "59_21": 1231, "13_47": 1232, "47_13": 1233, "13_59": 1234, "59_13": 1235, "63_53": 1236, "53_63": 1237, "63_26": 1238, "26_63": 1239, "63_4": 1240, "44_7": 1241, "26_64": 1242, "64_26": 1243, "66_50": 1244, "50_66": 1245, "9_4": 1246, "48_49": 1247, "49_48": 1248, "18_26": 1249, "26_18": 1250, "48_4": 1251, "34_68": 1252, "68_34": 1253, "37_4": 1254, "44_26": 1255, "26_44": 1256, "5_70": 1257, "70_5": 1258, "57_7": 1259, "69_34": 1260, "34_69": 1261, "28_31": 1262, "31_28": 1263, "26_10": 1264, "10_26": 1265, "66_4": 1266, "42_61": 1267, "61_42": 1268, "28_28": 1269, "26_6": 1270, "6_26": 1271, "10_34": 1272, "34_10": 1273, "43_46": 1274, "46_43": 1275, "9_39": 1276, "39_9": 1277, "24_39": 1278, "39_24": 1279, "54_16": 1280, "16_54": 1281, "40_26": 1282, "26_40": 1283, "64_5": 1284, "5_64": 1285, "22_53": 1286, "53_22": 1287, "27_29": 1288, "29_27": 1289, "40_12": 1290, "12_40": 1291, "34_24": 1292, "24_34": 1293, "3_15": 1294, "15_3": 1295, "27_10": 1296, "10_27": 1297, "46_61": 1298, "61_46": 1299, "18_67": 1300, "67_18": 1301, "34_73": 1302, "73_34": 1303, "52_73": 1304, "73_52": 1305, "50_15": 1306, "15_50": 1307, "30_30": 1308, "70_19": 1309, "19_70": 1310, "70_68": 1311, "68_70": 1312, "70_6": 1313, "6_70": 1314, "70_64": 1315, "64_70": 1316, "60_65": 1317, "65_60": 1318, "44_69": 1319, "44_65": 1320, "65_44": 1321, "44_27": 1322, "27_44": 1323, "72_66": 1324, "66_72": 1325, "72_18": 1326, "49_34": 1327, "34_49": 1328, "23_72": 1329, "72_23": 1330, "23_12": 1331, "12_23": 1332, "19_24": 1333, "24_19": 1334, "8_16": 1335, "16_8": 1336, "60_34": 1337, "34_60": 1338, "37_73": 1339, "73_37": 1340, "29_15": 1341, "15_29": 1342, "74_67": 1343, "67_74": 1344, "52_55": 1345, "55_52": 1346, "32_18": 1347, "18_32": 1348, "32_38": 1349, "38_32": 1350, "64_36": 1351, "36_64": 1352, "49_53": 1353, "53_49": 1354, "48_50": 1355, "50_48": 1356, "48_65": 1357, "65_48": 1358, "34_29": 1359, "29_34": 1360, "41_66": 1361, "66_41": 1362, "41_25": 1363, "25_41": 1364, "41_69": 1365, "69_41": 1366, "41_12": 1367, "12_41": 1368, "32_8": 1369, "39_68": 1370, "68_39": 1371, "64_24": 1372, "24_64": 1373, "47_44": 1374, "44_47": 1375, "10_28": 1376, "28_10": 1377, "67_34": 1378, "34_67": 1379, "32_61": 1380, "61_32": 1381, "27_53": 1382, "53_27": 1383, "65_31": 1384, "31_65": 1385, "32_17": 1386, "4_5": 1387, "5_4": 1388, "52_31": 1389, "31_52": 1390, "6_68": 1391, "68_6": 1392, "47_74": 1393, "74_47": 1394, "75_55": 1395, "55_75": 1396, "32_72": 1397, "72_32": 1398, "26_39": 1399, "39_26": 1400, "57_46": 1401, "46_57": 1402, "3_70": 1403, "70_3": 1404, "53_28": 1405, "28_53": 1406, "24_31": 1407, "31_24": 1408, "29_71": 1409, "71_29": 1410, "29_12": 1411, "12_29": 1412, "45_3": 1413, "45_19": 1414, "43_75": 1415, "7_29": 1416, "29_7": 1417, "52_12": 1418, "12_52": 1419, "57_63": 1420, "63_57": 1421, "30_41": 1422, "41_30": 1423, "57_56": 1424, "56_57": 1425, "29_73": 1426, "73_29": 1427, "49_67": 1428, "67_49": 1429, "72_21": 1430, "12_20": 1431, "20_12": 1432, "24_53": 1433, "53_24": 1434, "42_3": 1435, "3_42": 1436, "33_45": 1437, "45_33": 1438, "33_55": 1439, "55_33": 1440, "61_68": 1441, "68_61": 1442, "34_51": 1443, "51_34": 1444, "35_53": 1445, "53_35": 1446, "48_34": 1447, "34_48": 1448, "49_76": 1449, "76_49": 1450, "32_27": 1451, "27_32": 1452, "52_3": 1453, "3_52": 1454, "35_69": 1455, "69_35": 1456, "54_24": 1457, "43_67": 1458, "67_43": 1459, "35_72": 1460, "72_35": 1461, "7_7": 1462, "32_30": 1463, "30_32": 1464, "38_61": 1465, "61_38": 1466, "34_19": 1467, "19_34": 1468, "10_16": 1469, "16_10": 1470, "5_28": 1471, "28_5": 1472, "5_73": 1473, "73_5": 1474, "5_71": 1475, "71_5": 1476, "5_13": 1477, "13_5": 1478, "33_6": 1479, "6_33": 1480, "3_27": 1481, "27_3": 1482, "66_3": 1483, "68_18": 1484, "18_68": 1485, "36_69": 1486, "69_36": 1487, "12_32": 1488, "32_12": 1489, "30_15": 1490, "15_30": 1491, "38_39": 1492, "39_38": 1493, "57_70": 1494, "31_18": 1495, "70_61": 1496, "61_70": 1497, "4_13": 1498, "13_4": 1499, "70_31": 1500, "31_70": 1501, "48_55": 1502, "55_48": 1503, "21_69": 1504, "69_21": 1505, "66_5": 1506, "5_66": 1507, "66_68": 1508, "68_66": 1509, "21_50": 1510, "50_21": 1511, "37_34": 1512, "34_37": 1513, "58_19": 1514, "19_58": 1515, "48_26": 1516, "26_48": 1517, "71_25": 1518, "25_71": 1519, "71_26": 1520, "26_71": 1521, "49_18": 1522, "18_49": 1523, "73_16": 1524, "16_73": 1525, "10_33": 1526, "48_18": 1527, "18_48": 1528, "52_38": 1529, "38_52": 1530, "57_28": 1531, "28_57": 1532, "71_72": 1533, "72_71": 1534, "56_26": 1535, "26_56": 1536, "56_72": 1537, "72_56": 1538, "56_73": 1539, "73_56": 1540, "56_50": 1541, "50_56": 1542, "40_2": 1543, "2_40": 1544, "58_45": 1545, "45_58": 1546, "34_17": 1547, "17_34": 1548, "57_55": 1549, "55_57": 1550, "23_19": 1551, "19_23": 1552, "66_27": 1553, "27_66": 1554, "32_16": 1555, "16_32": 1556, "5_45": 1557, "45_5": 1558, "43_31": 1559, "31_43": 1560, "56_31": 1561, "44_18": 1562, "18_44": 1563, "43_66": 1564, "66_43": 1565, "33_66": 1566, "66_33": 1567, "34_53": 1568, "53_34": 1569, "58_31": 1570, "31_58": 1571, "52_26": 1572, "26_52": 1573, "18_59": 1574, "59_18": 1575, "38_67": 1576, "67_38": 1577, "30_24": 1578, "24_30": 1579, "42_4": 1580, "51_15": 1581, "15_51": 1582, "65_21": 1583, "21_65": 1584, "52_65": 1585, "65_52": 1586, "30_12": 1587, "12_30": 1588, "52_18": 1589, "18_52": 1590, "28_25": 1591, "25_28": 1592, "18_64": 1593, "64_18": 1594, "26_24": 1595, "66_63": 1596, "63_66": 1597, "34_66": 1598, "66_34": 1599, "57_61": 1600, "61_57": 1601, "57_51": 1602, "51_57": 1603, "57_9": 1604, "51_59": 1605, "59_51": 1606, "6_16": 1607, "16_6": 1608, "70_76": 1609, "76_70": 1610, "28_49": 1611, "49_28": 1612, "31_60": 1613, "60_31": 1614, "50_43": 1615, "67_68": 1616, "68_67": 1617, "23_4": 1618, "4_23": 1619, "12_75": 1620, "6_18": 1621, "18_6": 1622, "64_55": 1623, "55_64": 1624, "26_15": 1625, "15_26": 1626, "38_16": 1627, "16_38": 1628, "52_47": 1629, "47_52": 1630, "32_67": 1631, "67_32": 1632, "42_12": 1633, "12_42": 1634, "64_67": 1635, "67_64": 1636, "69_57": 1637, "57_69": 1638, "69_63": 1639, "63_69": 1640, "69_28": 1641, "28_69": 1642, "69_17": 1643, "17_69": 1644, "70_54": 1645, "54_70": 1646, "49_54": 1647, "54_49": 1648, "47_37": 1649, "37_47": 1650, "28_12": 1651, "12_28": 1652, "49_25": 1653, "25_49": 1654, "43_10": 1655, "10_43": 1656, "55_60": 1657, "60_55": 1658, "40_15": 1659, "15_40": 1660, "40_66": 1661, "66_40": 1662, "18_47": 1663, "47_18": 1664, "33_65": 1665, "65_33": 1666, "19_25": 1667, "25_19": 1668, "8_26": 1669, "26_8": 1670, "74_4": 1671, "4_74": 1672, "34_65": 1673, "65_34": 1674, "40_25": 1675, "25_40": 1676, "29_13": 1677, "13_29": 1678, "25_24": 1679, "24_25": 1680, "50_8": 1681, "50_71": 1682, "71_50": 1683, "52_72": 1684, "72_52": 1685, "70_67": 1686, "67_70": 1687, "5_49": 1688, "49_5": 1689, "72_43": 1690, "43_72": 1691, "74_53": 1692, "53_74": 1693, "34_59": 1694, "59_34": 1695, "43_70": 1696, "70_43": 1697, "43_64": 1698, "64_43": 1699, "67_27": 1700, "27_67": 1701, "3_59": 1702, "59_3": 1703, "3_33": 1704, "33_3": 1705, "43_3": 1706, "3_43": 1707, "6_42": 1708, "42_6": 1709, "47_63": 1710, "63_47": 1711, "52_56": 1712, "56_52": 1713, "27_18": 1714, "18_27": 1715, "15_18": 1716, "18_15": 1717, "29_50": 1718, "50_29": 1719, "10_76": 1720, "76_10": 1721, "23_70": 1722, "70_23": 1723, "47_53": 1724, "53_47": 1725, "55_4": 1726, "64_30": 1727, "30_64": 1728, "12_24": 1729, "32_63": 1730, "63_32": 1731, "66_26": 1732, "26_66": 1733, "21_73": 1734, "73_21": 1735, "52_34": 1736, "34_52": 1737, "50_58": 1738, "50_76": 1739, "76_50": 1740, "48_29": 1741, "25_10": 1742, "10_25": 1743, "21_53": 1744, "53_21": 1745, "30_28": 1746, "28_30": 1747, "8_76": 1748, "76_8": 1749, "54_12": 1750, "12_54": 1751, "7_70": 1752, "70_7": 1753, "50_7": 1754, "50_73": 1755, "73_50": 1756, "48_73": 1757, "73_48": 1758, "39_45": 1759, "45_39": 1760, "6_28": 1761, "28_6": 1762, "52_24": 1763, "24_52": 1764, "66_12": 1765, "12_66": 1766, "64_15": 1767, "15_64": 1768, "57_76": 1769, "76_57": 1770, "37_53": 1771, "53_37": 1772, "57_43": 1773, "29_2": 1774, "2_29": 1775, "61_65": 1776, "65_61": 1777, "37_38": 1778, "38_37": 1779, "44_53": 1780, "53_44": 1781, "54_63": 1782, "63_54": 1783, "40_71": 1784, "71_40": 1785, "48_24": 1786, "24_48": 1787, "73_31": 1788, "31_73": 1789, "73_66": 1790, "66_73": 1791, "38_27": 1792, "27_38": 1793, "32_69": 1794, "69_32": 1795, "21_64": 1796, "64_21": 1797, "52_37": 1798, "37_52": 1799, "30_8": 1800, "8_30": 1801, "3_7": 1802, "7_3": 1803, "75_5": 1804, "5_75": 1805, "75_52": 1806, "52_75": 1807, "57_53": 1808, "53_57": 1809, "72_9": 1810, "9_72": 1811, "58_71": 1812, "71_58": 1813, "36_38": 1814, "38_36": 1815, "8_25": 1816, "25_8": 1817, "43_47": 1818, "47_43": 1819, "41_6": 1820, "6_41": 1821, "9_69": 1822, "69_9": 1823, "54_45": 1824, "45_54": 1825, "12_70": 1826, "70_12": 1827, "12_67": 1828, "67_12": 1829, "72_45": 1830, "45_72": 1831, "57_42": 1832, "57_18": 1833, "18_57": 1834, "57_66": 1835, "12_37": 1836, "37_12": 1837, "71_67": 1838, "67_71": 1839, "6_15": 1840, "15_6": 1841, "50_35": 1842, "35_50": 1843, "6_25": 1844, "25_6": 1845, "50_24": 1846, "66_31": 1847, "31_66": 1848, "40_5": 1849, "5_40": 1850, "64_46": 1851, "46_64": 1852, "64_31": 1853, "31_64": 1854, "16_16": 1855, "8_4": 1856, "4_8": 1857, "12_53": 1858, "53_12": 1859, "12_45": 1860, "45_12": 1861, "12_19": 1862, "19_12": 1863, "72_51": 1864, "51_72": 1865, "24_59": 1866, "59_24": 1867, "10_13": 1868, "51_67": 1869, "67_51": 1870, "51_28": 1871, "28_51": 1872, "51_37": 1873, "37_51": 1874, "51_56": 1875, "56_51": 1876, "51_53": 1877, "53_51": 1878, "29_30": 1879, "30_29": 1880, "70_18": 1881, "18_70": 1882, "66_56": 1883, "56_66": 1884, "26_45": 1885, "45_26": 1886, "44_31": 1887, "31_44": 1888, "8_15": 1889, "15_8": 1890, "7_67": 1891, "67_7": 1892, "3_53": 1893, "53_3": 1894, "20_70": 1895, "70_20": 1896, "6_30": 1897, "30_6": 1898, "53_56": 1899, "56_53": 1900, "73_27": 1901, "27_73": 1902, "53_4": 1903, "6_45": 1904, "45_6": 1905, "26_49": 1906, "27_49": 1907, "49_27": 1908, "21_48": 1909, "48_21": 1910, "54_34": 1911, "49_7": 1912, "7_49": 1913, "64_71": 1914, "71_64": 1915, "15_17": 1916, "17_15": 1917, "31_13": 1918, "35_60": 1919, "60_35": 1920, "2_2": 1921, "23_45": 1922, "45_23": 1923, "49_16": 1924, "16_49": 1925, "40_31": 1926, "31_40": 1927, "68_65": 1928, "65_68": 1929, "12_55": 1930, "55_12": 1931, "28_72": 1932, "72_28": 1933, "49_74": 1934, "74_49": 1935, "76_53": 1936, "53_76": 1937, "38_46": 1938, "46_38": 1939, "3_8": 1940, "8_3": 1941, "12_27": 1942, "27_12": 1943, "12_8": 1944, "64_76": 1945, "76_64": 1946, "64_56": 1947, "56_64": 1948, "44_66": 1949, "66_44": 1950, "18_65": 1951, "65_18": 1952, "45_25": 1953, "25_45": 1954, "58_2": 1955, "2_58": 1956, "35_40": 1957, "40_35": 1958, "24_51": 1959, "51_24": 1960, "70_53": 1961, "53_70": 1962, "30_48": 1963, "48_30": 1964, "30_25": 1965, "25_30": 1966, "54_56": 1967, "56_54": 1968, "20_31": 1969, "31_20": 1970, "57_49": 1971, "54_8": 1972, "8_54": 1973, "28_59": 1974, "59_28": 1975, "66_15": 1976, "15_66": 1977, "3_74": 1978, "74_3": 1979, "20_4": 1980, "4_20": 1981, "10_68": 1982, "68_10": 1983, "16_66": 1984, "66_16": 1985, "26_17": 1986, "17_26": 1987, "51_58": 1988, "51_13": 1989, "13_51": 1990, "74_73": 1991, "73_74": 1992, "67_25": 1993, "25_67": 1994, "58_8": 1995, "8_58": 1996, "57_68": 1997, "68_57": 1998, "20_3": 1999, "57_67": 2000, "67_57": 2001, "5_16": 2002, "16_5": 2003, "53_48": 2004, "48_53": 2005, "53_23": 2006, "23_53": 2007, "53_71": 2008, "71_53": 2009, "6_61": 2010, "61_6": 2011, "29_56": 2012, "56_29": 2013, "64_59": 2014, "59_64": 2015, "54_55": 2016, "55_54": 2017, "35_55": 2018, "55_35": 2019, "44_35": 2020, "35_44": 2021, "15_31": 2022, "31_15": 2023, "68_24": 2024, "52_30": 2025, "30_52": 2026, "9_31": 2027, "31_9": 2028, "58_34": 2029, "34_58": 2030, "57_8": 2031, "29_18": 2032, "18_29": 2033, "42_7": 2034, "42_31": 2035, "31_42": 2036, "68_4": 2037, "64_29": 2038, "29_64": 2039, "64_7": 2040, "7_64": 2041, "14_72": 2042, "72_14": 2043, "49_51": 2044, "51_49": 2045, "60_26": 2046, "26_60": 2047, "35_4": 2048, "40_75": 2049, "75_40": 2050, "8_18": 2051, "18_8": 2052, "29_38": 2053, "38_29": 2054, "32_25": 2055, "74_10": 2056, "10_74": 2057, "3_5": 2058, "5_3": 2059, "19_9": 2060, "9_19": 2061, "45_69": 2062, "69_45": 2063, "17_72": 2064, "72_17": 2065, "48_35": 2066, "35_48": 2067, "18_25": 2068, "25_18": 2069, "46_4": 2070, "64_48": 2071, "48_64": 2072, "42_26": 2073, "26_42": 2074, "10_5": 2075, "5_10": 2076, "51_9": 2077, "9_51": 2078, "37_72": 2079, "72_37": 2080, "19_18": 2081, "18_19": 2082, "59_65": 2083, "65_59": 2084, "72_15": 2085, "15_72": 2086, "7_65": 2087, "65_7": 2088, "8_71": 2089, "71_8": 2090, "30_72": 2091, "72_30": 2092, "12_72": 2093, "72_12": 2094, "13_28": 2095, "28_13": 2096, "17_65": 2097, "65_17": 2098, "52_58": 2099, "58_52": 2100, "49_38": 2101, "38_49": 2102, "30_34": 2103, "34_30": 2104, "19_68": 2105, "68_19": 2106, "74_74": 2107, "13_65": 2108, "65_13": 2109, "10_20": 2110, "20_10": 2111, "61_4": 2112, "4_61": 2113, "49_39": 2114, "39_49": 2115, "23_24": 2116, "24_23": 2117, "32_60": 2118, "60_32": 2119, "18_61": 2120, "61_18": 2121, "75_54": 2122, "54_75": 2123, "33_70": 2124, "70_33": 2125, "41_65": 2126, "65_41": 2127, "43_2": 2128, "2_43": 2129, "32_58": 2130, "40_49": 2131, "49_40": 2132, "35_24": 2133, "36_24": 2134, "24_36": 2135, "54_7": 2136, "32_7": 2137, "23_6": 2138, "6_23": 2139, "74_29": 2140, "29_74": 2141, "5_17": 2142, "17_5": 2143, "58_23": 2144, "23_58": 2145, "25_48": 2146, "48_25": 2147, "3_37": 2148, "37_3": 2149, "54_3": 2150, "3_54": 2151, "10_61": 2152, "61_10": 2153, "3_68": 2154, "68_3": 2155, "21_10": 2156, "10_21": 2157, "49_59": 2158, "59_49": 2159, "32_28": 2160, "28_32": 2161, "42_49": 2162, "49_42": 2163, "44_56": 2164, "56_44": 2165, "48_47": 2166, "47_48": 2167, "48_67": 2168, "67_48": 2169, "57_65": 2170, "65_57": 2171, "27_26": 2172, "26_27": 2173, "27_59": 2174, "59_27": 2175, "58_58": 2176, "26_34": 2177, "69_4": 2178, "26_73": 2179, "73_26": 2180, "43_48": 2181, "48_43": 2182, "52_13": 2183, "13_52": 2184, "6_67": 2185, "67_6": 2186, "59_48": 2187, "48_59": 2188, "38_31": 2189, "31_38": 2190, "38_35": 2191, "35_38": 2192, "18_69": 2193, "69_18": 2194, "69_39": 2195, "39_69": 2196, "3_71": 2197, "71_3": 2198, "34_25": 2199, "25_34": 2200, "27_23": 2201, "23_27": 2202, "65_63": 2203, "63_65": 2204, "10_58": 2205, "58_10": 2206, "47_28": 2207, "28_47": 2208, "48_56": 2209, "56_48": 2210, "48_42": 2211, "42_48": 2212, "3_55": 2213, "55_3": 2214, "8_23": 2215, "23_8": 2216, "56_4": 2217, "43_29": 2218, "29_55": 2219, "55_29": 2220, "20_19": 2221, "19_20": 2222, "55_59": 2223, "59_55": 2224, "64_9": 2225, "9_64": 2226, "58_24": 2227, "24_58": 2228, "38_73": 2229, "73_38": 2230, "38_3": 2231, "3_38": 2232, "43_26": 2233, "26_43": 2234, "36_70": 2235, "70_36": 2236, "36_46": 2237, "46_36": 2238, "36_72": 2239, "72_36": 2240, "29_23": 2241, "23_29": 2242, "3_39": 2243, "39_3": 2244, "19_29": 2245, "29_19": 2246, "62_62": 2247, "52_68": 2248, "68_52": 2249, "35_26": 2250, "26_35": 2251, "29_31": 2252, "31_29": 2253, "15_67": 2254, "67_15": 2255, "55_56": 2256, "56_55": 2257, "25_68": 2258, "68_25": 2259, "41_34": 2260, "34_41": 2261, "3_60": 2262, "60_3": 2263, "50_6": 2264, "6_50": 2265, "50_17": 2266, "17_50": 2267, "24_20": 2268, "20_24": 2269, "33_48": 2270, "48_33": 2271, "59_23": 2272, "23_59": 2273, "54_25": 2274, "25_54": 2275, "71_32": 2276, "32_71": 2277, "39_53": 2278, "53_39": 2279, "66_53": 2280, "53_66": 2281, "54_68": 2282, "68_54": 2283, "58_65": 2284, "65_58": 2285, "6_20": 2286, "20_6": 2287, "34_31": 2288, "31_34": 2289, "13_39": 2290, "39_13": 2291, "29_69": 2292, "69_29": 2293, "45_76": 2294, "76_45": 2295, "17_17": 2296, "55_63": 2297, "63_55": 2298, "66_39": 2299, "39_66": 2300, "15_25": 2301, "25_15": 2302, "37_26": 2303, "26_37": 2304, "39_36": 2305, "36_39": 2306, "35_56": 2307, "56_35": 2308, "40_54": 2309, "54_40": 2310, "52_16": 2311, "16_52": 2312, "34_16": 2313, "16_34": 2314, "67_56": 2315, "56_67": 2316, "67_60": 2317, "60_67": 2318, "67_63": 2319, "63_67": 2320, "45_28": 2321, "28_45": 2322, "8_27": 2323, "27_8": 2324, "6_59": 2325, "59_6": 2326, "5_27": 2327, "27_5": 2328, "14_14": 2329, "43_25": 2330, "25_43": 2331, "34_46": 2332, "46_34": 2333, "42_2": 2334, "2_42": 2335, "51_50": 2336, "50_51": 2337, "68_53": 2338, "53_68": 2339, "49_13": 2340, "13_49": 2341, "66_55": 2342, "55_66": 2343, "29_9": 2344, "9_29": 2345, "50_34": 2346, "34_50": 2347, "5_35": 2348, "35_5": 2349, "21_24": 2350, "24_21": 2351, "21_52": 2352, "52_21": 2353, "21_66": 2354, "66_21": 2355, "21_18": 2356, "18_21": 2357, "15_27": 2358, "27_15": 2359, "3_35": 2360, "35_3": 2361, "40_61": 2362, "61_40": 2363, "49_61": 2364, "61_49": 2365, "40_48": 2366, "48_40": 2367, "68_68": 2368, "54_13": 2369, "13_54": 2370, "57_40": 2371, "40_57": 2372, "8_34": 2373, "34_8": 2374, "45_16": 2375, "16_45": 2376, "66_6": 2377, "6_66": 2378, "29_72": 2379, "72_29": 2380, "59_41": 2381, "41_59": 2382, "8_61": 2383, "61_8": 2384, "72_16": 2385, "16_72": 2386, "28_73": 2387, "73_28": 2388, "63_63": 2389, "63_72": 2390, "72_63": 2391, "63_37": 2392, "37_63": 2393, "63_12": 2394, "12_63": 2395, "63_60": 2396, "60_63": 2397, "69_61": 2398, "61_69": 2399, "14_64": 2400, "64_14": 2401, "21_43": 2402, "43_21": 2403, "48_71": 2404, "71_48": 2405, "26_61": 2406, "61_26": 2407, "67_59": 2408, "59_67": 2409, "75_47": 2410, "47_75": 2411, "75_9": 2412, "9_75": 2413, "64_75": 2414, "44_8": 2415, "59_47": 2416, "47_59": 2417, "34_61": 2418, "61_34": 2419, "11_10": 2420, "10_11": 2421, "11_8": 2422, "8_11": 2423, "30_33": 2424, "33_30": 2425, "41_28": 2426, "28_41": 2427, "46_73": 2428, "73_46": 2429, "42_15": 2430, "15_42": 2431, "37_16": 2432, "16_37": 2433, "35_12": 2434, "12_35": 2435, "35_57": 2436, "57_35": 2437, "10_73": 2438, "73_10": 2439, "67_54": 2440, "54_67": 2441, "52_28": 2442, "28_52": 2443, "55_69": 2444, "69_55": 2445, "18_45": 2446, "45_18": 2447, "43_54": 2448, "54_43": 2449, "15_71": 2450, "71_15": 2451, "15_23": 2452, "23_15": 2453, "20_71": 2454, "71_20": 2455, "42_47": 2456, "47_42": 2457, "52_67": 2458, "67_52": 2459, "58_48": 2460, "48_58": 2461, "45_7": 2462, "45_37": 2463, "37_45": 2464, "45_55": 2465, "55_45": 2466, "61_15": 2467, "15_61": 2468, "58_67": 2469, "67_58": 2470, "16_68": 2471, "68_16": 2472, "30_65": 2473, "65_30": 2474, "56_43": 2475, "6_48": 2476, "48_6": 2477, "9_53": 2478, "53_9": 2479, "3_73": 2480, "73_3": 2481, "76_18": 2482, "18_76": 2483, "76_46": 2484, "46_76": 2485, "7_4": 2486, "4_7": 2487, "37_55": 2488, "55_37": 2489, "45_63": 2490, "63_45": 2491, "45_46": 2492, "48_63": 2493, "63_48": 2494, "18_24": 2495, "4_16": 2496, "16_4": 2497, "72_60": 2498, "60_72": 2499, "21_54": 2500, "54_21": 2501, "67_35": 2502, "35_67": 2503, "10_49": 2504, "49_10": 2505, "10_17": 2506, "17_10": 2507, "10_23": 2508, "23_10": 2509, "60_4": 2510, "18_46": 2511, "46_18": 2512, "45_27": 2513, "27_45": 2514, "66_42": 2515, "42_66": 2516, "13_50": 2517, "50_13": 2518, "30_66": 2519, "66_30": 2520, "46_14": 2521, "14_46": 2522, "59_73": 2523, "73_59": 2524, "52_5": 2525, "5_52": 2526, "19_28": 2527, "28_19": 2528, "18_74": 2529, "74_18": 2530, "5_34": 2531, "34_5": 2532, "36_5": 2533, "5_36": 2534, "37_44": 2535, "44_37": 2536, "37_40": 2537, "40_37": 2538, "37_50": 2539, "50_37": 2540, "70_55": 2541, "55_70": 2542, "54_46": 2543, "46_54": 2544, "8_55": 2545, "55_8": 2546, "74_39": 2547, "39_74": 2548, "54_61": 2549, "61_53": 2550, "53_61": 2551, "23_18": 2552, "18_23": 2553, "21_29": 2554, "29_21": 2555, "18_5": 2556, "5_18": 2557, "68_73": 2558, "73_68": 2559, "66_46": 2560, "46_66": 2561, "6_73": 2562, "73_6": 2563, "32_19": 2564, "19_32": 2565, "45_9": 2566, "9_45": 2567, "33_54": 2568, "54_33": 2569, "32_15": 2570, "43_69": 2571, "69_43": 2572, "30_21": 2573, "21_30": 2574, "54_18": 2575, "18_54": 2576, "41_31": 2577, "31_41": 2578, "6_7": 2579, "7_6": 2580, "49_35": 2581, "35_49": 2582, "21_8": 2583, "8_21": 2584, "57_21": 2585, "54_19": 2586, "19_54": 2587, "57_30": 2588, "30_57": 2589, "6_37": 2590, "37_6": 2591, "3_2": 2592, "2_3": 2593, "49_17": 2594, "17_49": 2595, "29_17": 2596, "17_29": 2597, "74_65": 2598, "65_74": 2599, "58_42": 2600, "42_58": 2601, "73_4": 2602, "4_73": 2603, "27_47": 2604, "47_27": 2605, "32_73": 2606, "57_37": 2607, "37_57": 2608, "32_35": 2609, "35_32": 2610, "38_48": 2611, "48_38": 2612, "57_27": 2613, "27_57": 2614, "57_5": 2615, "5_57": 2616, "57_36": 2617, "36_57": 2618, "18_3": 2619, "3_18": 2620, "39_46": 2621, "46_39": 2622, "43_53": 2623, "53_43": 2624, "65_23": 2625, "23_65": 2626, "52_60": 2627, "60_52": 2628, "59_16": 2629, "16_59": 2630, "15_16": 2631, "16_15": 2632, "32_13": 2633, "13_32": 2634, "43_49": 2635, "49_43": 2636, "19_19": 2637, "59_59": 2638, "9_66": 2639, "66_9": 2640, "52_10": 2641, "10_52": 2642, "28_15": 2643, "15_28": 2644, "32_48": 2645, "48_66": 2646, "66_48": 2647, "58_4": 2648, "4_58": 2649, "49_9": 2650, "9_49": 2651, "50_22": 2652, "22_50": 2653, "33_53": 2654, "53_33": 2655, "29_47": 2656, "47_29": 2657, "44_70": 2658, "70_44": 2659, "4_25": 2660, "25_4": 2661, "29_10": 2662, "10_29": 2663, "34_72": 2664, "72_34": 2665, "36_66": 2666, "66_36": 2667, "57_13": 2668, "13_57": 2669, "5_67": 2670, "67_5": 2671, "28_34": 2672, "34_28": 2673, "8_37": 2674, "37_8": 2675, "6_57": 2676, "57_6": 2677, "57_34": 2678, "57_23": 2679, "57_15": 2680, "30_31": 2681, "31_30": 2682, "49_56": 2683, "56_49": 2684, "54_35": 2685, "35_54": 2686, "57_48": 2687, "71_57": 2688, "57_71": 2689, "59_57": 2690, "57_59": 2691, "59_63": 2692, "63_59": 2693, "57_73": 2694, "54_47": 2695, "47_54": 2696, "54_71": 2697, "71_54": 2698, "20_57": 2699, "57_20": 2700, "54_69": 2701, "69_54": 2702, "32_42": 2703, "25_57": 2704, "57_25": 2705, "34_56": 2706, "56_34": 2707, "6_56": 2708, "56_6": 2709, "54_44": 2710, "44_54": 2711, "74_24": 2712, "24_74": 2713, "74_8": 2714, "8_74": 2715, "15_74": 2716, "74_15": 2717, "10_8": 2718, "8_10": 2719, "74_69": 2720, "69_74": 2721, "55_74": 2722, "74_55": 2723, "74_66": 2724, "66_74": 2725, "74_58": 2726, "58_74": 2727, "74_35": 2728, "35_74": 2729, "74_48": 2730, "48_74": 2731, "74_16": 2732, "16_74": 2733, "74_30": 2734, "30_74": 2735, "74_31": 2736, "31_74": 2737, "74_38": 2738, "38_74": 2739, "74_21": 2740, "21_74": 2741, "34_55": 2742, "55_34": 2743, "19_31": 2744, "31_19": 2745, "24_47": 2746, "47_24": 2747, "66_69": 2748, "69_66": 2749, "58_47": 2750, "47_58": 2751, "42_72": 2752, "72_42": 2753, "24_72": 2754, "72_24": 2755, "30_47": 2756, "47_30": 2757, "33_47": 2758, "47_33": 2759, "9_34": 2760, "34_9": 2761, "9_7": 2762, "7_9": 2763, "9_67": 2764, "67_9": 2765, "18_56": 2766, "56_18": 2767, "9_60": 2768, "60_9": 2769, "9_55": 2770, "55_9": 2771, "21_67": 2772, "67_21": 2773, "9_32": 2774, "32_9": 2775, "61_67": 2776, "67_61": 2777, "67_73": 2778, "73_67": 2779, "58_18": 2780, "18_58": 2781, "67_75": 2782, "75_67": 2783, "18_55": 2784, "67_16": 2785, "16_67": 2786, "33_18": 2787, "18_33": 2788, "43_18": 2789, "18_43": 2790, "42_67": 2791, "67_42": 2792, "23_67": 2793, "67_23": 2794, "60_53": 2795, "53_60": 2796, "56_60": 2797, "60_56": 2798, "70_47": 2799, "47_70": 2800, "8_47": 2801, "47_8": 2802, "49_47": 2803, "47_49": 2804, "23_69": 2805, "69_23": 2806, "25_31": 2807, "31_25": 2808, "42_69": 2809, "69_42": 2810, "42_63": 2811, "63_42": 2812, "42_18": 2813, "18_42": 2814, "23_73": 2815, "73_23": 2816, "42_55": 2817, "55_42": 2818, "25_26": 2819, "26_25": 2820, "6_72": 2821, "72_6": 2822, "58_72": 2823, "72_58": 2824, "70_35": 2825, "35_70": 2826, "42_16": 2827, "16_42": 2828, "42_30": 2829, "30_42": 2830, "42_37": 2831, "37_42": 2832, "42_68": 2833, "68_42": 2834, "42_73": 2835, "73_42": 2836, "30_26": 2837, "26_30": 2838, "58_63": 2839, "63_58": 2840, "23_56": 2841, "56_23": 2842, "42_56": 2843, "56_42": 2844, "42_74": 2845, "74_42": 2846, "20_73": 2847, "73_20": 2848, "33_63": 2849, "63_33": 2850, "59_31": 2851, "31_59": 2852, "33_72": 2853, "72_33": 2854, "48_7": 2855, "7_48": 2856, "47_34": 2857, "34_47": 2858, "48_16": 2859, "16_48": 2860, "30_55": 2861, "55_30": 2862, "48_37": 2863, "37_48": 2864, "28_18": 2865, "18_28": 2866, "28_55": 2867, "55_28": 2868, "28_56": 2869, "56_28": 2870, "58_56": 2871, "56_58": 2872, "28_37": 2873, "37_28": 2874, "28_16": 2875, "16_28": 2876, "28_48": 2877, "48_28": 2878, "28_67": 2879, "67_28": 2880, "28_68": 2881, "68_28": 2882, "33_58": 2883, "58_33": 2884, "28_74": 2885, "74_28": 2886, "68_8": 2887, "21_56": 2888, "56_21": 2889, "6_74": 2890, "74_6": 2891, "56_74": 2892, "74_56": 2893, "60_74": 2894, "74_60": 2895, "35_66": 2896, "66_35": 2897, "26_74": 2898, "74_26": 2899, "37_60": 2900, "60_37": 2901, "70_13": 2902, "13_70": 2903, "57_74": 2904, "74_57": 2905, "18_9": 2906, "9_18": 2907, "63_74": 2908, "74_63": 2909, "18_35": 2910, "35_18": 2911, "61_61": 2912, "55_72": 2913, "72_55": 2914, "59_74": 2915, "74_59": 2916, "70_74": 2917, "74_70": 2918, "37_74": 2919, "74_37": 2920, "32_74": 2921, "56_45": 2922, "45_56": 2923, "33_31": 2924, "31_33": 2925, "63_9": 2926, "9_63": 2927, "45_73": 2928, "73_45": 2929, "47_45": 2930, "45_47": 2931, "18_71": 2932, "71_18": 2933, "43_8": 2934, "8_43": 2935, "72_13": 2936, "13_72": 2937, "21_21": 2938, "6_19": 2939, "19_6": 2940, "54_74": 2941, "74_54": 2942, "20_67": 2943, "67_20": 2944, "18_13": 2945, "13_18": 2946, "50_74": 2947, "74_50": 2948, "56_33": 2949, "33_56": 2950, "18_60": 2951, "60_18": 2952, "63_73": 2953, "73_63": 2954, "47_9": 2955, "9_47": 2956, "43_74": 2957, "74_43": 2958, "49_69": 2959, "69_49": 2960, "49_60": 2961, "60_49": 2962, "34_6": 2963, "6_34": 2964, "33_32": 2965, "32_33": 2966, "71_43": 2967, "43_71": 2968, "67_19": 2969, "19_67": 2970, "32_51": 2971, "51_32": 2972, "12_60": 2973, "60_12": 2974, "12_43": 2975, "43_12": 2976, "8_28": 2977, "28_8": 2978, "12_18": 2979, "18_12": 2980, "8_51": 2981, "51_8": 2982, "66_51": 2983, "51_66": 2984, "8_56": 2985, "56_8": 2986, "16_51": 2987, "51_16": 2988, "30_51": 2989, "51_30": 2990, "66_28": 2991, "28_66": 2992, "12_71": 2993, "71_12": 2994, "12_59": 2995, "70_51": 2996, "51_70": 2997, "68_51": 2998, "51_68": 2999, "12_69": 3000, "69_12": 3001, "12_26": 3002, "26_12": 3003, "70_28": 3004, "28_70": 3005, "51_63": 3006, "63_51": 3007, "68_31": 3008, "31_68": 3009, "12_61": 3010, "61_12": 3011, "12_68": 3012, "68_12": 3013, "17_67": 3014, "67_17": 3015, "6_51": 3016, "51_6": 3017, "54_51": 3018, "51_54": 3019, "33_29": 3020, "29_33": 3021, "23_34": 3022, "34_23": 3023, "21_31": 3024, "31_21": 3025, "30_56": 3026, "56_30": 3027, "13_63": 3028, "63_13": 3029, "23_16": 3030, "16_23": 3031, "8_6": 3032, "6_8": 3033, "8_20": 3034, "20_8": 3035, "13_66": 3036, "66_13": 3037, "21_25": 3038, "25_21": 3039, "25_29": 3040, "29_25": 3041, "43_6": 3042, "6_43": 3043, "25_74": 3044, "74_25": 3045, "9_48": 3046, "48_9": 3047, "21_6": 3048, "6_21": 3049, "21_23": 3050, "23_21": 3051, "32_23": 3052, "23_32": 3053, "25_59": 3054, "59_25": 3055, "42_29": 3056, "29_42": 3057, "42_8": 3058, "8_42": 3059, "42_23": 3060, "23_42": 3061, "67_13": 3062, "13_67": 3063, "13_23": 3064, "23_13": 3065, "12_33": 3066, "33_12": 3067, "12_5": 3068, "5_12": 3069, "38_12": 3070, "12_38": 3071, "68_21": 3072, "21_68": 3073, "32_21": 3074, "21_32": 3075, "59_7": 3076, "7_59": 3077, "59_58": 3078, "58_59": 3079, "25_52": 3080, "52_25": 3081, "42_52": 3082, "52_42": 3083, "59_66": 3084, "66_59": 3085, "6_52": 3086, "52_6": 3087, "58_21": 3088, "21_58": 3089, "16_53": 3090, "53_16": 3091, "72_76": 3092, "76_72": 3093, "76_9": 3094, "9_76": 3095, "76_76": 3096, "76_26": 3097, "26_76": 3098, "46_9": 3099, "9_46": 3100, "76_24": 3101, "24_76": 3102, "26_9": 3103, "9_26": 3104, "76_48": 3105, "48_76": 3106, "76_5": 3107, "5_76": 3108, "76_38": 3109, "38_76": 3110, "76_65": 3111, "65_76": 3112, "76_17": 3113, "17_76": 3114, "76_16": 3115, "16_76": 3116, "76_6": 3117, "6_76": 3118, "24_7": 3119, "7_24": 3120, "76_55": 3121, "55_76": 3122, "76_47": 3123, "47_76": 3124, "8_9": 3125, "9_8": 3126, "76_51": 3127, "51_76": 3128, "34_64": 3129, "64_34": 3130, "76_27": 3131, "27_76": 3132, "21_9": 3133, "9_21": 3134, "9_30": 3135, "30_9": 3136, "42_9": 3137, "9_42": 3138, "58_9": 3139, "9_58": 3140, "70_9": 3141, "9_70": 3142, "51_61": 3143, "61_51": 3144, "25_61": 3145, "61_25": 3146, "8_19": 3147, "19_8": 3148, "66_61": 3149, "61_66": 3150, "8_5": 3151, "5_8": 3152, "8_38": 3153, "38_8": 3154, "25_72": 3155, "72_25": 3156, "6_12": 3157, "12_6": 3158, "15_12": 3159, "12_15": 3160, "66_19": 3161, "19_66": 3162, "30_61": 3163, "61_30": 3164, "43_61": 3165, "61_43": 3166, "59_61": 3167, "61_59": 3168, "34_7": 3169, "7_34": 3170, "73_61": 3171, "61_73": 3172, "48_61": 3173, "61_48": 3174, "19_61": 3175, "61_19": 3176, "57_19": 3177, "19_52": 3178, "52_19": 3179, "19_42": 3180, "42_19": 3181, "19_7": 3182, "7_19": 3183, "19_48": 3184, "48_19": 3185, "19_26": 3186, "26_19": 3187, "19_16": 3188, "16_19": 3189, "11_11": 3190, "71_11": 3191, "11_71": 3192, "11_24": 3193, "24_11": 3194, "11_29": 3195, "29_11": 3196, "11_65": 3197, "65_11": 3198, "23_11": 3199, "11_23": 3200, "48_11": 3201, "11_48": 3202, "32_11": 3203, "11_32": 3204, "49_65": 3205, "65_49": 3206, "11_49": 3207, "49_11": 3208, "11_66": 3209, "66_11": 3210, "11_6": 3211, "6_11": 3212, "59_71": 3213, "71_59": 3214, "11_15": 3215, "15_11": 3216, "11_61": 3217, "61_11": 3218, "33_11": 3219, "11_33": 3220, "11_13": 3221, "13_11": 3222, "11_59": 3223, "59_11": 3224, "11_68": 3225, "68_11": 3226, "11_42": 3227, "42_11": 3228, "11_34": 3229, "34_11": 3230, "11_26": 3231, "26_11": 3232, "11_4": 3233, "4_11": 3234, "54_11": 3235, "11_54": 3236, "41_68": 3237, "68_41": 3238, "41_70": 3239, "70_41": 3240, "41_29": 3241, "29_41": 3242, "32_41": 3243, "41_32": 3244, "43_41": 3245, "41_43": 3246, "48_23": 3247, "23_48": 3248, "48_2": 3249, "2_48": 3250, "41_15": 3251, "15_41": 3252, "41_48": 3253, "48_41": 3254, "41_58": 3255, "58_41": 3256, "43_13": 3257, "13_43": 3258, "4_41": 3259, "41_4": 3260, "41_72": 3261, "72_41": 3262, "41_26": 3263, "26_41": 3264, "41_53": 3265, "53_41": 3266, "41_24": 3267, "24_41": 3268, "2_24": 3269, "24_2": 3270, "32_59": 3271, "2_34": 3272, "34_2": 3273, "2_14": 3274, "14_2": 3275, "42_34": 3276, "34_42": 3277, "42_41": 3278, "41_42": 3279, "6_2": 3280, "2_6": 3281, "41_3": 3282, "3_41": 3283, "28_71": 3284, "71_28": 3285, "20_23": 3286, "23_20": 3287, "20_49": 3288, "49_20": 3289, "38_71": 3290, "71_38": 3291, "71_74": 3292, "74_71": 3293, "33_71": 3294, "71_33": 3295, "14_70": 3296, "70_14": 3297, "19_50": 3298, "50_19": 3299, "14_23": 3300, "23_14": 3301, "14_24": 3302, "24_14": 3303, "14_19": 3304, "19_14": 3305, "38_19": 3306, "19_38": 3307, "14_61": 3308, "61_14": 3309, "19_13": 3310, "13_19": 3311, "14_13": 3312, "13_14": 3313, "19_59": 3314, "59_19": 3315, "14_49": 3316, "49_14": 3317, "58_69": 3318, "69_58": 3319, "15_68": 3320, "68_15": 3321, "33_67": 3322, "67_33": 3323, "13_53": 3324, "53_13": 3325, "44_52": 3326, "52_44": 3327, "50_16": 3328, "16_50": 3329, "48_22": 3330, "22_48": 3331, "66_22": 3332, "22_66": 3333, "49_22": 3334, "22_49": 3335, "8_22": 3336, "22_8": 3337, "15_22": 3338, "22_15": 3339, "58_46": 3340, "46_58": 3341, "22_45": 3342, "45_22": 3343, "24_22": 3344, "22_24": 3345, "72_68": 3346, "68_72": 3347, "22_68": 3348, "68_22": 3349, "22_42": 3350, "42_22": 3351, "22_71": 3352, "71_22": 3353, "22_16": 3354, "16_22": 3355, "23_22": 3356, "22_23": 3357, "22_5": 3358, "5_22": 3359, "34_22": 3360, "22_34": 3361, "4_22": 3362, "22_4": 3363, "43_68": 3364, "68_43": 3365, "22_32": 3366, "32_22": 3367, "22_10": 3368, "10_22": 3369, "22_29": 3370, "29_22": 3371, "62_11": 3372, "11_62": 3373, "48_17": 3374, "17_48": 3375, "36_48": 3376, "48_36": 3377, "30_2": 3378, "2_30": 3379, "71_14": 3380, "14_71": 3381, "2_26": 3382, "26_2": 3383, "62_69": 3384, "69_62": 3385, "62_17": 3386, "17_62": 3387, "36_34": 3388, "34_36": 3389, "36_29": 3390, "29_36": 3391, "64_16": 3392, "16_64": 3393, "2_67": 3394, "67_2": 3395, "2_72": 3396, "72_2": 3397, "2_31": 3398, "31_2": 3399, "2_55": 3400, "55_2": 3401, "2_19": 3402, "19_2": 3403, "2_8": 3404, "8_2": 3405, "2_69": 3406, "69_2": 3407, "2_38": 3408, "38_2": 3409, "2_18": 3410, "18_2": 3411, "2_32": 3412, "32_2": 3413, "2_66": 3414, "66_2": 3415, "13_9": 3416, "9_13": 3417, "60_73": 3418, "73_60": 3419, "2_5": 3420, "5_2": 3421, "71_51": 3422, "51_71": 3423, "71_21": 3424, "21_71": 3425, "62_70": 3426, "70_62": 3427, "36_67": 3428, "67_36": 3429, "36_6": 3430, "6_36": 3431, "23_66": 3432, "66_23": 3433, "2_61": 3434, "61_2": 3435, "2_53": 3436, "53_2": 3437, "2_59": 3438, "59_2": 3439, "2_68": 3440, "68_2": 3441, "71_69": 3442, "69_71": 3443, "46_2": 3444, "2_46": 3445, "71_16": 3446, "16_71": 3447, "71_56": 3448, "56_71": 3449, "36_49": 3450, "49_36": 3451, "71_45": 3452, "45_71": 3453, "2_65": 3454, "65_2": 3455, "2_21": 3456, "21_2": 3457, "2_33": 3458, 