{"PAD": 0, "DUMMY_START_RELATION": 1, "UNK": 2, "12_12": 3, "51_51": 4, "12_28": 5, "32_28": 6, "12_51": 7, "49_51": 8, "29_28": 9, "34_28": 10, "8_51": 11, "8_28": 12, "66_12": 13, "32_51": 14, "32_12": 15, "58_51": 16, "4_51": 17, "66_28": 18, "28_28": 19, "66_51": 20, "49_28": 21, "70_51": 22, "19_28": 23, "34_51": 24, "24_51": 25, "30_71": 26, "24_28": 27, "54_28": 28, "66_71": 29, "12_71": 30, "29_51": 31, "15_71": 32, "6_28": 33, "12_67": 34, "24_12": 35, "12_13": 36, "70_28": 37, "48_45": 38, "52_28": 39, "51_28": 40, "49_12": 41, "12_32": 42, "28_12": 43, "8_12": 44, "16_12": 45, "50_28": 46, "10_51": 47, "59_28": 48, "48_28": 49, "66_67": 50, "30_28": 51, "68_51": 52, "10_71": 53, "29_12": 54, "48_12": 55, "54_71": 56, "32_67": 57, "24_45": 58, "16_51": 59, "30_51": 60, "20_12": 61, "70_12": 62, "32_32": 63, "30_32": 64, "47_28": 65, "15_28": 66, "54_51": 67, "15_67": 68, "6_51": 69, "23_28": 70, "32_71": 71, "17_67": 72, "13_51": 73, "4_31": 74, "31_4": 75, "69_65": 76, "65_69": 77, "8_8": 78, "70_39": 79, "39_70": 80, "26_53": 81, "53_26": 82, "33_68": 83, "68_33": 84, "40_40": 85, "69_69": 86, "58_73": 87, "73_58": 88, "58_16": 89, "16_58": 90, "31_69": 91, "69_31": 92, "31_10": 93, "10_31": 94, "52_61": 95, "61_52": 96, "66_76": 97, "76_66": 98, "33_73": 99, "73_33": 100, "38_10": 101, "10_38": 102, "38_65": 103, "65_38": 104, "47_35": 105, "35_47": 106, "50_50": 107, "50_57": 108, "57_50": 109, "58_68": 110, "68_58": 111, "4_32": 112, "32_4": 113, "4_70": 114, "70_4": 115, "30_4": 116, "4_30": 117, "71_70": 118, "70_71": 119, "26_26": 120, "31_26": 121, "26_31": 122, "31_31": 123, "47_31": 124, "31_47": 125, "33_16": 126, "16_33": 127, "65_53": 128, "53_65": 129, "65_65": 130, "10_37": 131, "37_10": 132, "64_64": 133, "64_27": 134, "27_64": 135, "64_66": 136, "66_64": 137, "52_45": 138, "45_52": 139, "39_39": 140, "70_70": 141, "65_70": 142, "70_65": 143, "30_16": 144, "16_30": 145, "52_59": 146, "59_52": 147, "52_57": 148, "57_52": 149, "52_52": 150, "48_69": 151, "69_48": 152, "50_54": 153, "54_50": 154, "60_60": 155, "52_27": 156, "27_52": 157, "3_47": 158, "47_3": 159, "30_73": 160, "73_30": 161, "30_68": 162, "68_30": 163, "72_53": 164, "53_72": 165, "72_26": 166, "26_72": 167, "72_65": 168, "65_72": 169, "72_5": 170, "5_72": 171, "10_12": 172, "12_10": 173, "24_9": 174, "9_24": 175, "42_24": 176, "24_42": 177, "10_10": 178, "24_24": 179, "52_70": 180, "70_52": 181, "49_4": 182, "4_49": 183, "3_12": 184, "12_3": 185, "3_9": 186, "9_3": 187, "3_10": 188, "10_3": 189, "3_56": 190, "56_3": 191, "35_65": 192, "65_35": 193, "52_15": 194, "15_52": 195, "45_10": 196, "10_45": 197, "63_10": 198, "10_63": 199, "63_28": 200, "28_63": 201, "63_50": 202, "50_63": 203, "29_70": 204, "70_29": 205, "26_65": 206, "65_26": 207, "26_5": 208, "5_26": 209, "48_8": 210, "8_48": 211, "48_68": 212, "68_48": 213, "64_40": 214, "40_64": 215, "32_24": 216, "24_32": 217, "33_21": 218, "21_33": 219, "59_4": 220, "4_59": 221, "65_5": 222, "5_65": 223, "70_26": 224, "26_70": 225, "70_38": 226, "38_70": 227, "38_53": 228, "53_38": 229, "35_34": 230, "34_35": 231, "4_67": 232, "67_4": 233, "64_50": 234, "50_64": 235, "64_4": 236, "4_64": 237, "24_49": 238, "49_24": 239, "55_31": 240, "31_55": 241, "41_41": 242, "5_5": 243, "4_50": 244, "50_4": 245, "49_2": 246, "2_49": 247, "49_41": 248, "41_49": 249, "70_10": 250, "10_70": 251, "58_49": 252, "49_58": 253, "66_66": 254, "37_37": 255, "57_31": 256, "31_57": 257, "3_3": 258, "27_48": 259, "48_27": 260, "4_52": 261, "52_4": 262, "4_45": 263, "45_4": 264, "64_65": 265, "65_64": 266, "64_72": 267, "72_64": 268, "45_66": 269, "66_45": 270, "45_15": 271, "15_45": 272, "45_67": 273, "67_45": 274, "41_71": 275, "71_41": 276, "47_47": 277, "54_54": 278, "54_57": 279, "57_54": 280, "47_72": 281, "72_47": 282, "32_10": 283, "10_32": 284, "33_34": 285, "34_33": 286, "24_3": 287, "3_24": 288, "57_44": 289, "44_57": 290, "4_44": 291, "44_4": 292, "29_49": 293, "49_29": 294, "5_53": 295, "53_5": 296, "33_13": 297, "13_33": 298, "75_50": 299, "50_75": 300, "75_3": 301, "3_75": 302, "75_65": 303, "65_75": 304, "35_31": 305, "31_35": 306, "44_32": 307, "32_44": 308, "44_44": 309, "44_64": 310, "64_44": 311, "44_76": 312, "76_44": 313, "10_24": 314, "24_10": 315, "51_10": 316, "64_10": 317, "10_64": 318, "49_19": 319, "19_49": 320, "30_53": 321, "53_30": 322, "36_17": 323, "17_36": 324, "29_46": 325, "46_29": 326, "72_50": 327, "50_72": 328, "72_72": 329, "47_4": 330, "4_47": 331, "47_57": 332, "57_47": 333, "47_51": 334, "51_47": 335, "4_12": 336, "12_4": 337, "26_50": 338, "50_26": 339, "72_70": 340, "70_72": 341, "49_66": 342, "66_49": 343, "24_4": 344, "4_24": 345, "10_9": 346, "9_10": 347, "70_16": 348, "16_70": 349, "45_45": 350, "29_66": 351, "66_29": 352, "71_61": 353, "61_71": 354, "65_46": 355, "46_65": 356, "7_57": 357, "57_7": 358, "24_67": 359, "67_24": 360, "69_5": 361, "5_69": 362, "6_29": 363, "29_6": 364, "49_49": 365, "29_16": 366, "16_29": 367, "33_49": 368, "49_33": 369, "36_15": 370, "15_36": 371, "25_25": 372, "38_60": 373, "60_38": 374, "38_38": 375, "70_66": 376, "66_70": 377, "20_34": 378, "34_20": 379, "3_50": 380, "50_3": 381, "10_59": 382, "59_10": 383, "41_27": 384, "27_41": 385, "41_8": 386, "8_41": 387, "41_47": 388, "47_41": 389, "41_40": 390, "40_41": 391, "41_67": 392, "67_41": 393, "41_50": 394, "50_41": 395, "41_61": 396, "61_41": 397, "18_18": 398, "27_4": 399, "4_27": 400, "45_34": 401, "34_45": 402, "57_26": 403, "26_57": 404, "72_31": 405, "31_72": 406, "50_65": 407, "65_50": 408, "50_5": 409, "5_50": 410, "50_38": 411, "38_50": 412, "50_10": 413, "10_50": 414, "50_40": 415, "40_50": 416, "50_69": 417, "69_50": 418, "50_53": 419, "53_50": 420, "49_15": 421, "15_49": 422, "32_46": 423, "46_32": 424, "32_56": 425, "56_32": 426, "29_20": 427, "20_29": 428, "4_4": 429, "29_32": 430, "32_29": 431, "72_40": 432, "40_72": 433, "67_50": 434, "50_67": 435, "38_59": 436, "59_38": 437, "34_34": 438, "54_32": 439, "32_54": 440, "54_26": 441, "26_54": 442, "41_2": 443, "2_41": 444, "67_53": 445, "53_67": 446, "67_65": 447, "65_67": 448, "67_67": 449, "67_72": 450, "72_67": 451, "4_65": 452, "65_4": 453, "28_24": 454, "69_67": 455, "67_69": 456, "49_68": 457, "68_49": 458, "69_10": 459, "10_69": 460, "50_31": 461, "31_50": 462, "32_43": 463, "43_32": 464, "25_66": 465, "66_25": 466, "7_10": 467, "10_7": 468, "72_10": 469, "10_72": 470, "72_44": 471, "44_72": 472, "72_4": 473, "4_72": 474, "7_69": 475, "69_7": 476, "32_31": 477, "31_32": 478, "53_53": 479, "51_4": 480, "6_24": 481, "24_6": 482, "6_49": 483, "49_6": 484, "12_31": 485, "31_12": 486, "29_3": 487, "3_29": 488, "35_10": 489, "10_35": 490, "3_67": 491, "67_3": 492, "3_31": 493, "31_3": 494, "8_53": 495, "53_8": 496, "32_66": 497, "66_32": 498, "30_70": 499, "70_30": 500, "34_4": 501, "4_34": 502, "52_48": 503, "48_52": 504, "52_39": 505, "39_52": 506, "56_56": 507, "58_29": 508, "29_58": 509, "58_57": 510, "57_58": 511, "32_47": 512, "47_32": 513, "9_65": 514, "65_9": 515, "72_22": 516, "22_72": 517, "66_18": 518, "18_66": 519, "54_31": 520, "31_54": 521, "32_52": 522, "52_32": 523, "32_57": 524, "57_32": 525, "15_34": 526, "34_15": 527, "8_66": 528, "66_8": 529, "47_69": 530, "69_47": 531, "3_28": 532, "28_3": 533, "51_31": 534, "31_51": 535, "8_67": 536, "67_8": 537, "8_65": 538, "65_8": 539, "68_29": 540, "29_68": 541, "29_29": 542, "52_54": 543, "54_52": 544, "50_52": 545, "52_50": 546, "50_44": 547, "44_50": 548, "50_27": 549, "27_50": 550, "50_12": 551, "12_50": 552, "50_47": 553, "47_50": 554, "50_9": 555, "9_50": 556, "47_10": 557, "10_47": 558, "69_60": 559, "60_69": 560, "29_59": 561, "59_29": 562, "6_6": 563, "6_71": 564, "71_6": 565, "10_46": 566, "46_10": 567, "3_72": 568, "72_3": 569, "3_34": 570, "34_3": 571, "24_43": 572, "43_24": 573, "63_56": 574, "56_63": 575, "8_73": 576, "73_8": 577, "8_70": 578, "70_8": 579, "29_4": 580, "4_29": 581, "23_23": 582, "28_23": 583, "4_43": 584, "43_4": 585, "24_73": 586, "73_24": 587, "55_55": 588, "45_31": 589, "31_45": 590, "50_59": 591, "59_50": 592, "23_61": 593, "61_23": 594, "37_67": 595, "67_37": 596, "37_56": 597, "56_37": 598, "37_69": 599, "69_37": 600, "37_31": 601, "31_37": 602, "32_39": 603, "39_32": 604, "57_57": 605, "40_27": 606, "27_40": 607, "40_10": 608, "10_40": 609, "33_25": 610, "25_33": 611, "52_49": 612, "49_52": 613, "70_46": 614, "46_70": 615, "12_49": 616, "49_71": 617, "71_49": 618, "71_31": 619, "31_71": 620, "71_66": 621, "71_71": 622, "49_45": 623, "45_49": 624, "30_18": 625, "18_30": 626, "40_47": 627, "47_40": 628, "48_31": 629, "31_48": 630, "14_65": 631, "65_14": 632, "64_38": 633, "38_64": 634, "64_17": 635, "17_64": 636, "40_67": 637, "67_40": 638, "40_4": 639, "4_40": 640, "49_30": 641, "30_49": 642, "49_31": 643, "31_49": 644, "28_29": 645, "3_26": 646, "26_3": 647, "3_57": 648, "57_3": 649, "3_32": 650, "32_3": 651, "3_44": 652, "44_3": 653, "36_45": 654, "45_36": 655, "61_50": 656, "50_61": 657, "20_16": 658, "16_20": 659, "40_65": 660, "65_40": 661, "52_66": 662, "66_52": 663, "37_68": 664, "68_37": 665, "69_53": 666, "53_69": 667, "3_65": 668, "65_3": 669, "32_70": 670, "70_32": 671, "18_53": 672, "53_18": 673, "40_8": 674, "8_40": 675, "40_53": 676, "53_40": 677, "23_52": 678, "52_23": 679, "39_72": 680, "72_39": 681, "27_27": 682, "48_10": 683, "10_48": 684, "55_10": 685, "10_55": 686, "13_8": 687, "8_13": 688, "20_20": 689, "54_4": 690, "4_54": 691, "3_64": 692, "64_3": 693, "3_40": 694, "40_3": 695, "69_72": 696, "72_69": 697, "5_39": 698, "39_5": 699, "72_46": 700, "46_72": 701, "15_53": 702, "53_15": 703, "29_26": 704, "26_29": 705, "7_26": 706, "26_7": 707, "65_37": 708, "37_65": 709, "3_21": 710, "21_3": 711, "15_59": 712, "59_15": 713, "34_18": 714, "18_34": 715, "13_12": 716, "24_56": 717, "56_24": 718, "64_8": 719, "8_64": 720, "64_41": 721, "41_64": 722, "64_47": 723, "47_64": 724, "38_26": 725, "26_38": 726, "34_32": 727, "32_34": 728, "6_4": 729, "4_6": 730, "38_5": 731, "5_38": 732, "32_26": 733, "26_32": 734, "65_10": 735, "10_65": 736, "29_8": 737, "8_29": 738, "69_26": 739, "26_69": 740, "22_22": 741, "38_69": 742, "69_38": 743, "29_65": 744, "65_29": 745, "26_67": 746, "67_26": 747, "18_50": 748, "50_18": 749, "18_4": 750, "4_18": 751, "71_2": 752, "2_71": 753, "71_23": 754, "23_71": 755, "71_24": 756, "24_71": 757, "47_56": 758, "56_47": 759, "29_24": 760, "24_29": 761, "8_72": 762, "72_8": 763, "65_47": 764, "47_65": 765, "40_24": 766, "24_40": 767, "29_53": 768, "53_29": 769, "32_55": 770, "55_32": 771, "3_69": 772, "69_3": 773, "44_40": 774, "40_44": 775, "33_24": 776, "24_33": 777, "38_47": 778, "47_38": 779, "26_22": 780, "22_26": 781, "49_70": 782, "70_49": 783, "48_13": 784, "13_48": 785, "50_45": 786, "45_50": 787, "29_39": 788, "39_29": 789, "49_63": 790, "63_49": 791, "8_49": 792, "49_8": 793, "34_26": 794, "26_34": 795, "18_20": 796, "20_18": 797, "27_65": 798, "65_27": 799, "17_73": 800, "73_17": 801, "24_65": 802, "65_24": 803, "24_13": 804, "13_24": 805, "34_39": 806, "39_34": 807, "16_31": 808, "31_16": 809, "47_12": 810, "12_47": 811, "64_49": 812, "49_64": 813, "64_32": 814, "32_64": 815, "64_2": 816, "2_64": 817, "42_42": 818, "38_4": 819, "4_38": 820, "14_50": 821, "50_14": 822, "32_45": 823, "45_32": 824, "52_8": 825, "8_52": 826, "52_29": 827, "29_52": 828, "10_4": 829, "4_10": 830, "54_29": 831, "29_54": 832, "35_35": 833, "35_63": 834, "63_35": 835, "75_75": 836, "75_53": 837, "53_75": 838, "41_23": 839, "23_41": 840, "41_11": 841, "11_41": 842, "67_31": 843, "31_67": 844, "9_9": 845, "15_4": 846, "4_15": 847, "15_15": 848, "7_50": 849, "50_7": 850, "10_60": 851, "60_10": 852, "58_70": 853, "70_58": 854, "52_64": 855, "64_52": 856, "28_50": 857, "32_6": 858, "6_32": 859, "57_72": 860, "72_57": 861, "32_76": 862, "76_32": 863, "47_60": 864, "60_47": 865, "24_61": 866, "61_24": 867, "21_15": 868, "15_21": 869, "32_68": 870, "68_32": 871, "46_69": 872, "69_46": 873, "46_37": 874, "37_46": 875, "8_24": 876, "24_8": 877, "13_13": 878, "68_46": 879, "46_68": 880, "70_2": 881, "2_70": 882, "15_65": 883, "65_15": 884, "72_27": 885, "27_72": 886, "74_34": 887, "34_74": 888, "3_6": 889, "6_3": 890, "12_48": 891, "17_46": 892, "46_17": 893, "17_38": 894, "38_17": 895, "74_68": 896, "68_74": 897, "20_32": 898, "32_20": 899, "41_19": 900, "19_41": 901, "24_57": 902, "57_24": 903, "55_65": 904, "65_55": 905, "23_25": 906, "25_23": 907, "50_32": 908, "32_50": 909, "50_60": 910, "60_50": 911, "66_65": 912, "65_66": 913, "65_39": 914, "39_65": 915, "41_10": 916, "10_41": 917, "69_27": 918, "27_69": 919, "55_47": 920, "47_55": 921, "55_51": 922, "51_55": 923, "29_57": 924, "57_29": 925, "33_33": 926, "58_3": 927, "3_58": 928, "33_15": 929, "15_33": 930, "30_67": 931, "67_30": 932, "5_46": 933, "46_5": 934, "66_10": 935, "10_66": 936, "4_57": 937, "57_4": 938, "55_50": 939, "50_55": 940, "48_39": 941, "39_48": 942, "38_72": 943, "72_38": 944, "3_49": 945, "49_3": 946, "4_71": 947, "71_4": 948, "6_31": 949, "31_6": 950, "21_4": 951, "4_21": 952, "30_19": 953, "19_30": 954, "66_24": 955, "24_66": 956, "49_23": 957, "23_49": 958, "54_72": 959, "72_54": 960, "45_48": 961, "45_8": 962, "8_45": 963, "70_50": 964, "50_70": 965, "28_54": 966, "4_33": 967, "33_4": 968, "55_53": 969, "53_55": 970, "55_67": 971, "67_55": 972, "49_73": 973, "73_49": 974, "50_46": 975, "46_50": 976, "43_39": 977, "39_43": 978, "3_61": 979, "61_3": 980, "46_46": 981, "49_55": 982, "55_49": 983, "24_15": 984, "15_24": 985, "12_57": 986, "57_12": 987, "51_12": 988, "3_13": 989, "13_3": 990, "70_11": 991, "11_70": 992, "26_46": 993, "46_26": 994, "26_28": 995, "28_26": 996, "10_67": 997, "67_10": 998, "67_66": 999, "26_47": 1000, "47_26": 1001, "22_70": 1002, "70_22": 1003, "22_65": 1004, "65_22": 1005, "8_31": 1006, "31_8": 1007, "31_53": 1008, "53_31": 1009, "31_63": 1010, "63_31": 1011, "72_75": 1012, "75_72": 1013, "4_56": 1014, "56_4": 1015, "33_8": 1016, "8_33": 1017, "69_70": 1018, "70_69": 1019, "43_65": 1020, "65_43": 1021, "72_73": 1022, "73_72": 1023, "34_71": 1024, "71_34": 1025, "51_29": 1026, "4_26": 1027, "26_4": 1028, "24_70": 1029, "70_24": 1030, "45_64": 1031, "64_45": 1032, "29_67": 1033, "67_29": 1034, "25_20": 1035, "20_25": 1036, "32_49": 1037, "49_32": 1038, "30_58": 1039, "58_30": 1040, "27_70": 1041, "70_27": 1042, "50_49": 1043, "49_50": 1044, "10_56": 1045, "56_10": 1046, "10_44": 1047, "44_10": 1048, "10_57": 1049, "57_10": 1050, "10_75": 1051, "75_10": 1052, "10_18": 1053, "18_10": 1054, "64_53": 1055, "53_64": 1056, "43_43": 1057, "10_53": 1058, "53_10": 1059, "32_53": 1060, "53_32": 1061, "12_16": 1062, "8_59": 1063, "59_8": 1064, "25_70": 1065, "70_25": 1066, "25_3": 1067, "3_25": 1068, "25_65": 1069, "65_25": 1070, "45_29": 1071, "29_45": 1072, "35_37": 1073, "37_35": 1074, "35_28": 1075, "28_35": 1076, "21_70": 1077, "70_21": 1078, "38_40": 1079, "40_38": 1080, "57_45": 1081, "45_57": 1082, "29_61": 1083, "61_29": 1084, "24_55": 1085, "55_24": 1086, "75_31": 1087, "31_75": 1088, "75_56": 1089, "56_75": 1090, "49_72": 1091, "72_49": 1092, "70_15": 1093, "15_70": 1094, "51_3": 1095, "3_51": 1096, "18_7": 1097, "7_18": 1098, "42_10": 1099, "10_42": 1100, "37_70": 1101, "70_37": 1102, "7_31": 1103, "31_7": 1104, "4_28": 1105, "28_4": 1106, "48_70": 1107, "70_48": 1108, "34_21": 1109, "21_34": 1110, "69_56": 1111, "56_69": 1112, "70_73": 1113, "73_70": 1114, "63_34": 1115, "34_63": 1116, "70_59": 1117, "59_70": 1118, "64_57": 1119, "57_64": 1120, "70_45": 1121, "45_70": 1122, "45_24": 1123, "45_53": 1124, "53_45": 1125, "50_30": 1126, "30_50": 1127, "23_26": 1128, "26_23": 1129, "12_34": 1130, "34_12": 1131, "12_56": 1132, "56_12": 1133, "22_38": 1134, "38_22": 1135, "47_67": 1136, "67_47": 1137, "29_76": 1138, "76_29": 1139, "70_34": 1140, "34_70": 1141, "4_3": 1142, "3_4": 1143, "49_46": 1144, "46_49": 1145, "7_8": 1146, "8_7": 1147, "30_45": 1148, "45_30": 1149, "23_31": 1150, "31_23": 1151, "74_72": 1152, "72_74": 1153, "24_16": 1154, "16_24": 1155, "71_10": 1156, "73_15": 1157, "15_73": 1158, "69_64": 1159, "64_69": 1160, "23_2": 1161, "2_23": 1162, "54_65": 1163, "65_54": 1164, "5_14": 1165, "14_5": 1166, "48_3": 1167, "3_48": 1168, "46_53": 1169, "53_46": 1170, "15_48": 1171, "48_15": 1172, "36_65": 1173, "65_36": 1174, "45_65": 1175, "65_45": 1176, "48_72": 1177, "72_48": 1178, "65_56": 1179, "56_65": 1180, "3_30": 1181, "30_3": 1182, "71_30": 1183, "12_65": 1184, "65_12": 1185, "29_44": 1186, "44_29": 1187, "66_47": 1188, "47_66": 1189, "40_69": 1190, "69_40": 1191, "21_59": 1192, "59_21": 1193, "13_47": 1194, "47_13": 1195, "13_59": 1196, "59_13": 1197, "63_53": 1198, "53_63": 1199, "63_26": 1200, "26_63": 1201, "63_4": 1202, "4_63": 1203, "7_44": 1204, "44_7": 1205, "26_64": 1206, "64_26": 1207, "66_50": 1208, "50_66": 1209, "9_4": 1210, "4_9": 1211, "48_49": 1212, "49_48": 1213, "49_57": 1214, "57_49": 1215, "18_26": 1216, "26_18": 1217, "48_4": 1218, "4_48": 1219, "34_68": 1220, "68_34": 1221, "4_37": 1222, "37_4": 1223, "44_26": 1224, "26_44": 1225, "5_70": 1226, "70_5": 1227, "69_34": 1228, "34_69": 1229, "28_31": 1230, "31_28": 1231, "26_10": 1232, "10_26": 1233, "66_4": 1234, "4_66": 1235, "42_61": 1236, "61_42": 1237, "26_6": 1238, "6_26": 1239, "10_34": 1240, "34_10": 1241, "43_46": 1242, "46_43": 1243, "9_39": 1244, "39_9": 1245, "24_39": 1246, "39_24": 1247, "54_16": 1248, "16_54": 1249, "40_26": 1250, "26_40": 1251, "64_5": 1252, "5_64": 1253, "22_53": 1254, "53_22": 1255, "27_29": 1256, "29_27": 1257, "40_12": 1258, "12_40": 1259, "34_24": 1260, "24_34": 1261, "3_15": 1262, "15_3": 1263, "27_10": 1264, "10_27": 1265, "46_61": 1266, "61_46": 1267, "18_67": 1268, "67_18": 1269, "34_73": 1270, "73_34": 1271, "52_73": 1272, "73_52": 1273, "50_15": 1274, "15_50": 1275, "30_30": 1276, "70_19": 1277, "19_70": 1278, "70_68": 1279, "68_70": 1280, "70_6": 1281, "6_70": 1282, "70_64": 1283, "64_70": 1284, "60_65": 1285, "65_60": 1286, "44_69": 1287, "69_44": 1288, "44_65": 1289, "65_44": 1290, "44_27": 1291, "27_44": 1292, "72_66": 1293, "66_72": 1294, "72_18": 1295, "18_72": 1296, "49_34": 1297, "34_49": 1298, "23_72": 1299, "72_23": 1300, "23_12": 1301, "12_23": 1302, "19_24": 1303, "24_19": 1304, "8_16": 1305, "16_8": 1306, "60_34": 1307, "34_60": 1308, "37_73": 1309, "73_37": 1310, "29_15": 1311, "15_29": 1312, "74_67": 1313, "67_74": 1314, "52_55": 1315, "55_52": 1316, "32_18": 1317, "18_32": 1318, "32_38": 1319, "38_32": 1320, "64_36": 1321, "36_64": 1322, "49_53": 1323, "53_49": 1324, "48_50": 1325, "50_48": 1326, "48_65": 1327, "65_48": 1328, "34_29": 1329, "29_34": 1330, "41_66": 1331, "66_41": 1332, "41_25": 1333, "25_41": 1334, "4_69": 1335, "69_4": 1336, "41_69": 1337, "69_41": 1338, "41_12": 1339, "12_41": 1340, "8_32": 1341, "32_8": 1342, "39_68": 1343, "68_39": 1344, "64_24": 1345, "24_64": 1346, "47_44": 1347, "44_47": 1348, "10_28": 1349, "28_10": 1350, "67_34": 1351, "34_67": 1352, "32_61": 1353, "61_32": 1354, "27_53": 1355, "53_27": 1356, "65_31": 1357, "31_65": 1358, "17_32": 1359, "32_17": 1360, "4_5": 1361, "5_4": 1362, "52_31": 1363, "31_52": 1364, "6_68": 1365, "68_6": 1366, "47_74": 1367, "74_47": 1368, "75_55": 1369, "55_75": 1370, "32_72": 1371, "72_32": 1372, "26_39": 1373, "39_26": 1374, "57_46": 1375, "46_57": 1376, "3_70": 1377, "70_3": 1378, "53_28": 1379, "28_53": 1380, "24_31": 1381, "31_24": 1382, "29_71": 1383, "71_29": 1384, "12_29": 1385, "45_3": 1386, "3_45": 1387, "45_19": 1388, "19_45": 1389, "43_75": 1390, "75_43": 1391, "7_29": 1392, "29_7": 1393, "52_12": 1394, "12_52": 1395, "57_63": 1396, "63_57": 1397, "30_41": 1398, "41_30": 1399, "57_56": 1400, "56_57": 1401, "29_73": 1402, "73_29": 1403, "49_67": 1404, "67_49": 1405, "21_72": 1406, "72_21": 1407, "12_20": 1408, "24_53": 1409, "53_24": 1410, "42_3": 1411, "3_42": 1412, "33_45": 1413, "45_33": 1414, "33_55": 1415, "55_33": 1416, "61_68": 1417, "68_61": 1418, "35_53": 1419, "53_35": 1420, "48_34": 1421, "34_48": 1422, "49_76": 1423, "76_49": 1424, "32_27": 1425, "27_32": 1426, "52_3": 1427, "3_52": 1428, "35_69": 1429, "69_35": 1430, "24_54": 1431, "54_24": 1432, "43_67": 1433, "67_43": 1434, "35_72": 1435, "72_35": 1436, "7_7": 1437, "32_30": 1438, "38_61": 1439, "61_38": 1440, "34_19": 1441, "19_34": 1442, "10_16": 1443, "16_10": 1444, "5_28": 1445, "28_5": 1446, "5_73": 1447, "73_5": 1448, "5_71": 1449, "71_5": 1450, "5_13": 1451, "13_5": 1452, "33_6": 1453, "6_33": 1454, "3_27": 1455, "27_3": 1456, "3_66": 1457, "66_3": 1458, "68_18": 1459, "18_68": 1460, "36_69": 1461, "69_36": 1462, "30_15": 1463, "15_30": 1464, "38_39": 1465, "39_38": 1466, "70_57": 1467, "57_70": 1468, "18_31": 1469, "31_18": 1470, "70_61": 1471, "61_70": 1472, "4_13": 1473, "13_4": 1474, "70_31": 1475, "31_70": 1476, "48_55": 1477, "55_48": 1478, "21_69": 1479, "69_21": 1480, "66_5": 1481, "5_66": 1482, "66_68": 1483, "68_66": 1484, "21_50": 1485, "50_21": 1486, "37_34": 1487, "34_37": 1488, "58_19": 1489, "19_58": 1490, "48_26": 1491, "26_48": 1492, "71_25": 1493, "25_71": 1494, "71_26": 1495, "26_71": 1496, "49_18": 1497, "18_49": 1498, "73_16": 1499, "16_73": 1500, "33_10": 1501, "10_33": 1502, "48_18": 1503, "18_48": 1504, "52_38": 1505, "38_52": 1506, "57_28": 1507, "28_57": 1508, "71_72": 1509, "72_71": 1510, "56_26": 1511, "26_56": 1512, "56_72": 1513, "72_56": 1514, "56_73": 1515, "73_56": 1516, "56_50": 1517, "50_56": 1518, "40_2": 1519, "2_40": 1520, "58_45": 1521, "45_58": 1522, "34_17": 1523, "17_34": 1524, "57_55": 1525, "55_57": 1526, "23_19": 1527, "19_23": 1528, "66_27": 1529, "27_66": 1530, "32_16": 1531, "16_32": 1532, "5_45": 1533, "45_5": 1534, "43_31": 1535, "31_43": 1536, "31_56": 1537, "56_31": 1538, "44_18": 1539, "18_44": 1540, "43_66": 1541, "66_43": 1542, "33_66": 1543, "66_33": 1544, "34_53": 1545, "53_34": 1546, "58_31": 1547, "31_58": 1548, "52_26": 1549, "26_52": 1550, "18_59": 1551, "59_18": 1552, "38_67": 1553, "67_38": 1554, "30_24": 1555, "24_30": 1556, "42_4": 1557, "4_42": 1558, "51_15": 1559, "15_51": 1560, "65_21": 1561, "21_65": 1562, "52_65": 1563, "65_52": 1564, "30_12": 1565, "12_30": 1566, "52_18": 1567, "18_52": 1568, "28_25": 1569, "25_28": 1570, "18_64": 1571, "64_18": 1572, "26_24": 1573, "24_26": 1574, "66_63": 1575, "63_66": 1576, "34_66": 1577, "66_34": 1578, "57_61": 1579, "61_57": 1580, "57_51": 1581, "51_57": 1582, "57_9": 1583, "9_57": 1584, "4_55": 1585, "55_4": 1586, "51_59": 1587, "59_51": 1588, "6_16": 1589, "16_6": 1590, "70_76": 1591, "76_70": 1592, "28_49": 1593, "31_60": 1594, "60_31": 1595, "43_50": 1596, "50_43": 1597, "67_68": 1598, "68_67": 1599, "23_4": 1600, "4_23": 1601, "75_12": 1602, "12_75": 1603, "6_18": 1604, "18_6": 1605, "49_26": 1606, "26_49": 1607, "64_55": 1608, "55_64": 1609, "26_15": 1610, "15_26": 1611, "38_16": 1612, "16_38": 1613, "52_47": 1614, "47_52": 1615, "67_32": 1616, "42_12": 1617, "12_42": 1618, "64_67": 1619, "67_64": 1620, "69_57": 1621, "57_69": 1622, "69_63": 1623, "63_69": 1624, "69_28": 1625, "28_69": 1626, "69_17": 1627, "17_69": 1628, "70_54": 1629, "54_70": 1630, "49_54": 1631, "54_49": 1632, "47_37": 1633, "37_47": 1634, "49_25": 1635, "25_49": 1636, "43_10": 1637, "10_43": 1638, "55_60": 1639, "60_55": 1640, "40_15": 1641, "15_40": 1642, "40_66": 1643, "66_40": 1644, "18_47": 1645, "47_18": 1646, "33_65": 1647, "65_33": 1648, "19_25": 1649, "25_19": 1650, "8_26": 1651, "26_8": 1652, "74_4": 1653, "4_74": 1654, "34_65": 1655, "65_34": 1656, "40_25": 1657, "25_40": 1658, "29_13": 1659, "13_29": 1660, "25_24": 1661, "24_25": 1662, "50_8": 1663, "8_50": 1664, "50_71": 1665, "71_50": 1666, "52_72": 1667, "72_52": 1668, "70_67": 1669, "67_70": 1670, "5_49": 1671, "49_5": 1672, "72_43": 1673, "43_72": 1674, "74_53": 1675, "53_74": 1676, "34_59": 1677, "59_34": 1678, "43_70": 1679, "70_43": 1680, "43_64": 1681, "64_43": 1682, "67_27": 1683, "27_67": 1684, "3_59": 1685, "59_3": 1686, "3_33": 1687, "33_3": 1688, "43_3": 1689, "3_43": 1690, "6_42": 1691, "42_6": 1692, "47_63": 1693, "63_47": 1694, "52_56": 1695, "56_52": 1696, "27_18": 1697, "18_27": 1698, "15_18": 1699, "18_15": 1700, "29_50": 1701, "50_29": 1702, "10_76": 1703, "76_10": 1704, "23_70": 1705, "70_23": 1706, "47_53": 1707, "53_47": 1708, "64_30": 1709, "30_64": 1710, "12_24": 1711, "48_48": 1712, "32_63": 1713, "63_32": 1714, "66_26": 1715, "26_66": 1716, "21_73": 1717, "73_21": 1718, "52_34": 1719, "34_52": 1720, "50_58": 1721, "58_50": 1722, "50_76": 1723, "76_50": 1724, "48_29": 1725, "29_48": 1726, "25_10": 1727, "10_25": 1728, "21_53": 1729, "53_21": 1730, "28_30": 1731, "8_76": 1732, "76_8": 1733, "54_12": 1734, "12_54": 1735, "7_70": 1736, "70_7": 1737, "50_73": 1738, "73_50": 1739, "48_73": 1740, "73_48": 1741, "39_45": 1742, "45_39": 1743, "28_6": 1744, "52_24": 1745, "24_52": 1746, "12_66": 1747, "64_15": 1748, "15_64": 1749, "57_76": 1750, "76_57": 1751, "37_53": 1752, "53_37": 1753, "43_57": 1754, "57_43": 1755, "29_2": 1756, "2_29": 1757, "61_65": 1758, "65_61": 1759, "37_38": 1760, "38_37": 1761, "44_53": 1762, "53_44": 1763, "54_63": 1764, "63_54": 1765, "40_71": 1766, "71_40": 1767, "48_24": 1768, "24_48": 1769, "73_31": 1770, "31_73": 1771, "73_66": 1772, "66_73": 1773, "38_27": 1774, "27_38": 1775, "32_69": 1776, "69_32": 1777, "21_64": 1778, "64_21": 1779, "52_37": 1780, "37_52": 1781, "30_8": 1782, "8_30": 1783, "3_7": 1784, "7_3": 1785, "75_5": 1786, "5_75": 1787, "75_52": 1788, "52_75": 1789, "57_53": 1790, "53_57": 1791, "72_9": 1792, "9_72": 1793, "58_71": 1794, "71_58": 1795, "36_38": 1796, "38_36": 1797, "8_25": 1798, "25_8": 1799, "43_47": 1800, "47_43": 1801, "41_6": 1802, "6_41": 1803, "9_69": 1804, "69_9": 1805, "54_45": 1806, "45_54": 1807, "12_70": 1808, "67_12": 1809, "72_45": 1810, "45_72": 1811, "57_42": 1812, "42_57": 1813, "57_18": 1814, "18_57": 1815, "57_66": 1816, "66_57": 1817, "12_37": 1818, "37_12": 1819, "71_67": 1820, "67_71": 1821, "6_15": 1822, "15_6": 1823, "50_35": 1824, "35_50": 1825, "6_25": 1826, "25_6": 1827, "50_24": 1828, "24_50": 1829, "66_31": 1830, "31_66": 1831, "40_5": 1832, "5_40": 1833, "64_46": 1834, "46_64": 1835, "64_31": 1836, "31_64": 1837, "16_16": 1838, "8_4": 1839, "4_8": 1840, "12_53": 1841, "53_12": 1842, "12_45": 1843, "45_12": 1844, "12_19": 1845, "19_12": 1846, "72_51": 1847, "51_72": 1848, "24_59": 1849, "59_24": 1850, "10_13": 1851, "13_10": 1852, "51_67": 1853, "67_51": 1854, "28_51": 1855, "51_37": 1856, "37_51": 1857, "51_56": 1858, "56_51": 1859, "51_53": 1860, "53_51": 1861, "29_30": 1862, "30_29": 1863, "70_18": 1864, "18_70": 1865, "66_56": 1866, "56_66": 1867, "26_45": 1868, "45_26": 1869, "44_31": 1870, "31_44": 1871, "8_15": 1872, "15_8": 1873, "7_67": 1874, "67_7": 1875, "3_53": 1876, "53_3": 1877, "20_70": 1878, "70_20": 1879, "6_30": 1880, "30_6": 1881, "53_56": 1882, "56_53": 1883, "73_27": 1884, "27_73": 1885, "4_53": 1886, "53_4": 1887, "6_45": 1888, "45_6": 1889, "27_49": 1890, "49_27": 1891, "21_48": 1892, "48_21": 1893, "54_34": 1894, "34_54": 1895, "49_7": 1896, "7_49": 1897, "64_71": 1898, "71_64": 1899, "15_17": 1900, "17_15": 1901, "13_31": 1902, "31_13": 1903, "35_60": 1904, "60_35": 1905, "2_2": 1906, "23_45": 1907, "45_23": 1908, "49_16": 1909, "16_49": 1910, "40_31": 1911, "31_40": 1912, "68_65": 1913, "65_68": 1914, "12_55": 1915, "55_12": 1916, "28_72": 1917, "72_28": 1918, "49_74": 1919, "74_49": 1920, "76_53": 1921, "53_76": 1922, "38_46": 1923, "46_38": 1924, "3_8": 1925, "8_3": 1926, "12_27": 1927, "27_12": 1928, "12_8": 1929, "64_76": 1930, "76_64": 1931, "64_56": 1932, "56_64": 1933, "44_66": 1934, "66_44": 1935, "18_65": 1936, "65_18": 1937, "45_25": 1938, "25_45": 1939, "58_2": 1940, "2_58": 1941, "35_40": 1942, "40_35": 1943, "70_53": 1944, "53_70": 1945, "30_48": 1946, "48_30": 1947, "30_25": 1948, "25_30": 1949, "54_56": 1950, "56_54": 1951, "20_31": 1952, "31_20": 1953, "54_8": 1954, "8_54": 1955, "28_59": 1956, "66_15": 1957, "15_66": 1958, "3_74": 1959, "74_3": 1960, "20_4": 1961, "4_20": 1962, "10_68": 1963, "68_10": 1964, "16_66": 1965, "66_16": 1966, "26_17": 1967, "17_26": 1968, "51_58": 1969, "51_13": 1970, "74_73": 1971, "73_74": 1972, "67_25": 1973, "25_67": 1974, "58_8": 1975, "8_58": 1976, "57_68": 1977, "68_57": 1978, "3_20": 1979, "20_3": 1980, "57_67": 1981, "67_57": 1982, "5_16": 1983, "16_5": 1984, "53_48": 1985, "48_53": 1986, "53_23": 1987, "23_53": 1988, "53_71": 1989, "71_53": 1990, "6_61": 1991, "61_6": 1992, "29_56": 1993, "56_29": 1994, "64_59": 1995, "59_64": 1996, "54_55": 1997, "55_54": 1998, "35_55": 1999, "55_35": 2000, "44_35": 2001, "35_44": 2002, "7_72": 2003, "72_7": 2004, "15_31": 2005, "31_15": 2006, "24_68": 2007, "68_24": 2008, "52_30": 2009, "30_52": 2010, "9_31": 2011, "31_9": 2012, "58_34": 2013, "34_58": 2014, "8_57": 2015, "57_8": 2016, "29_18": 2017, "18_29": 2018, "42_7": 2019, "7_42": 2020, "42_31": 2021, "31_42": 2022, "68_4": 2023, "4_68": 2024, "64_29": 2025, "29_64": 2026, "64_7": 2027, "7_64": 2028, "14_72": 2029, "72_14": 2030, "60_26": 2031, "26_60": 2032, "4_35": 2033, "35_4": 2034, "40_75": 2035, "75_40": 2036, "8_18": 2037, "18_8": 2038, "29_38": 2039, "38_29": 2040, "32_25": 2041, "25_32": 2042, "74_10": 2043, "10_74": 2044, "3_5": 2045, "5_3": 2046, "19_9": 2047, "9_19": 2048, "45_69": 2049, "69_45": 2050, "17_72": 2051, "72_17": 2052, "48_35": 2053, "35_48": 2054, "18_25": 2055, "25_18": 2056, "46_4": 2057, "4_46": 2058, "64_48": 2059, "48_64": 2060, "42_26": 2061, "26_42": 2062, "10_5": 2063, "5_10": 2064, "51_9": 2065, "9_51": 2066, "37_72": 2067, "72_37": 2068, "19_18": 2069, "18_19": 2070, "59_65": 2071, "65_59": 2072, "72_15": 2073, "15_72": 2074, "7_65": 2075, "65_7": 2076, "8_71": 2077, "71_8": 2078, "30_72": 2079, "72_30": 2080, "12_72": 2081, "72_12": 2082, "13_28": 2083, "28_13": 2084, "17_65": 2085, "65_17": 2086, "52_58": 2087, "58_52": 2088, "49_38": 2089, "38_49": 2090, "30_34": 2091, "34_30": 2092, "19_68": 2093, "68_19": 2094, "74_74": 2095, "13_65": 2096, "65_13": 2097, "10_20": 2098, "20_10": 2099, "61_4": 2100, "4_61": 2101, "49_39": 2102, "39_49": 2103, "23_24": 2104, "24_23": 2105, "32_60": 2106, "60_32": 2107, "18_61": 2108, "61_18": 2109, "75_54": 2110, "54_75": 2111, "33_70": 2112, "70_33": 2113, "41_65": 2114, "65_41": 2115, "43_2": 2116, "2_43": 2117, "8_44": 2118, "44_8": 2119, "32_58": 2120, "58_32": 2121, "40_49": 2122, "49_40": 2123, "35_24": 2124, "24_35": 2125, "36_24": 2126, "24_36": 2127, "7_47": 2128, "47_7": 2129, "7_54": 2130, "54_7": 2131, "7_32": 2132, "32_7": 2133, "23_6": 2134, "6_23": 2135, "74_29": 2136, "29_74": 2137, "5_17": 2138, "17_5": 2139, "58_23": 2140, "23_58": 2141, "25_48": 2142, "48_25": 2143, "3_37": 2144, "37_3": 2145, "54_3": 2146, "3_54": 2147, "10_61": 2148, "61_10": 2149, "3_68": 2150, "68_3": 2151, "21_10": 2152, "10_21": 2153, "49_59": 2154, "59_49": 2155, "28_32": 2156, "42_49": 2157, "49_42": 2158, "44_56": 2159, "56_44": 2160, "48_47": 2161, "47_48": 2162, "48_67": 2163, "67_48": 2164, "57_65": 2165, "65_57": 2166, "27_26": 2167, "26_27": 2168, "27_59": 2169, "59_27": 2170, "58_58": 2171, "26_73": 2172, "73_26": 2173, "43_48": 2174, "48_43": 2175, "52_13": 2176, "13_52": 2177, "6_67": 2178, "67_6": 2179, "59_48": 2180, "48_59": 2181, "38_31": 2182, "31_38": 2183, "38_35": 2184, "35_38": 2185, "18_69": 2186, "69_18": 2187, "69_39": 2188, "39_69": 2189, "3_71": 2190, "71_3": 2191, "34_25": 2192, "25_34": 2193, "27_23": 2194, "23_27": 2195, "65_63": 2196, "63_65": 2197, "10_58": 2198, "58_10": 2199, "28_47": 2200, "48_56": 2201, "56_48": 2202, "48_42": 2203, "42_48": 2204, "3_55": 2205, "55_3": 2206, "8_23": 2207, "23_8": 2208, "29_43": 2209, "43_29": 2210, "29_55": 2211, "55_29": 2212, "20_19": 2213, "19_20": 2214, "55_59": 2215, "59_55": 2216, "64_9": 2217, "9_64": 2218, "58_24": 2219, "24_58": 2220, "38_73": 2221, "73_38": 2222, "38_3": 2223, "3_38": 2224, "43_26": 2225, "26_43": 2226, "36_70": 2227, "70_36": 2228, "36_46": 2229, "46_36": 2230, "36_72": 2231, "72_36": 2232, "29_23": 2233, "23_29": 2234, "3_39": 2235, "39_3": 2236, "19_29": 2237, "29_19": 2238, "62_62": 2239, "52_68": 2240, "68_52": 2241, "35_26": 2242, "26_35": 2243, "29_31": 2244, "31_29": 2245, "67_15": 2246, "55_56": 2247, "56_55": 2248, "25_68": 2249, "68_25": 2250, "41_34": 2251, "34_41": 2252, "3_60": 2253, "60_3": 2254, "50_6": 2255, "6_50": 2256, "50_17": 2257, "17_50": 2258, "24_20": 2259, "20_24": 2260, "33_48": 2261, "48_33": 2262, "59_23": 2263, "23_59": 2264, "54_25": 2265, "25_54": 2266, "71_32": 2267, "39_53": 2268, "53_39": 2269, "66_53": 2270, "53_66": 2271, "54_68": 2272, "68_54": 2273, "58_65": 2274, "65_58": 2275, "6_20": 2276, "20_6": 2277, "34_31": 2278, "31_34": 2279, "13_39": 2280, "39_13": 2281, "29_69": 2282, "69_29": 2283, "45_76": 2284, "76_45": 2285, "17_17": 2286, "55_63": 2287, "63_55": 2288, "66_39": 2289, "39_66": 2290, "15_25": 2291, "25_15": 2292, "37_26": 2293, "26_37": 2294, "39_36": 2295, "36_39": 2296, "35_56": 2297, "56_35": 2298, "40_54": 2299, "54_40": 2300, "52_16": 2301, "16_52": 2302, "34_16": 2303, "16_34": 2304, "67_56": 2305, "56_67": 2306, "67_60": 2307, "60_67": 2308, "67_63": 2309, "63_67": 2310, "45_28": 2311, "28_45": 2312, "8_27": 2313, "27_8": 2314, "6_59": 2315, "59_6": 2316, "5_27": 2317, "27_5": 2318, "14_14": 2319, "43_25": 2320, "25_43": 2321, "34_46": 2322, "46_34": 2323, "42_2": 2324, "2_42": 2325, "34_57": 2326, "57_34": 2327, "51_50": 2328, "50_51": 2329, "68_53": 2330, "53_68": 2331, "49_13": 2332, "13_49": 2333, "66_55": 2334, "55_66": 2335, "51_24": 2336, "29_9": 2337, "9_29": 2338, "50_34": 2339, "34_50": 2340, "5_35": 2341, "35_5": 2342, "21_24": 2343, "24_21": 2344, "21_52": 2345, "52_21": 2346, "21_66": 2347, "66_21": 2348, "21_18": 2349, "18_21": 2350, "15_27": 2351, "27_15": 2352, "3_35": 2353, "35_3": 2354, "40_61": 2355, "61_40": 2356, "49_61": 2357, "61_49": 2358, "40_48": 2359, "48_40": 2360, "68_68": 2361, "54_13": 2362, "13_54": 2363, "57_40": 2364, "40_57": 2365, "8_34": 2366, "34_8": 2367, "45_16": 2368, "16_45": 2369, "66_6": 2370, "6_66": 2371, "29_72": 2372, "72_29": 2373, "59_41": 2374, "41_59": 2375, "8_61": 2376, "61_8": 2377, "72_16": 2378, "16_72": 2379, "28_73": 2380, "73_28": 2381, "63_63": 2382, "63_72": 2383, "72_63": 2384, "63_37": 2385, "37_63": 2386, "63_12": 2387, "12_63": 2388, "63_60": 2389, "60_63": 2390, "69_61": 2391, "61_69": 2392, "14_64": 2393, "64_14": 2394, "21_43": 2395, "43_21": 2396, "48_71": 2397, "71_48": 2398, "26_61": 2399, "61_26": 2400, "67_59": 2401, "59_67": 2402, "75_47": 2403, "47_75": 2404, "75_9": 2405, "9_75": 2406, "75_64": 2407, "64_75": 2408, "59_47": 2409, "47_59": 2410, "34_61": 2411, "61_34": 2412, "11_10": 2413, "10_11": 2414, "11_8": 2415, "8_11": 2416, "30_33": 2417, "33_30": 2418, "41_28": 2419, "28_41": 2420, "46_73": 2421, "73_46": 2422, "42_15": 2423, "15_42": 2424, "37_16": 2425, "16_37": 2426, "35_12": 2427, "12_35": 2428, "35_57": 2429, "57_35": 2430, "10_73": 2431, "73_10": 2432, "67_54": 2433, "54_67": 2434, "28_52": 2435, "55_69": 2436, "69_55": 2437, "18_45": 2438, "45_18": 2439, "43_54": 2440, "54_43": 2441, "71_15": 2442, "15_23": 2443, "23_15": 2444, "20_71": 2445, "71_20": 2446, "42_47": 2447, "47_42": 2448, "52_67": 2449, "67_52": 2450, "58_48": 2451, "48_58": 2452, "45_7": 2453, "7_45": 2454, "45_37": 2455, "37_45": 2456, "45_55": 2457, "55_45": 2458, "61_15": 2459, "15_61": 2460, "58_67": 2461, "67_58": 2462, "16_68": 2463, "68_16": 2464, "30_65": 2465, "65_30": 2466, "43_56": 2467, "56_43": 2468, "6_48": 2469, "48_6": 2470, "9_53": 2471, "53_9": 2472, "3_73": 2473, "73_3": 2474, "76_18": 2475, "18_76": 2476, "76_46": 2477, "46_76": 2478, "7_4": 2479, "4_7": 2480, "37_55": 2481, "55_37": 2482, "45_63": 2483, "63_45": 2484, "45_46": 2485, "46_45": 2486, "48_63": 2487, "63_48": 2488, "24_18": 2489, "18_24": 2490, "4_16": 2491, "16_4": 2492, "72_60": 2493, "60_72": 2494, "21_54": 2495, "54_21": 2496, "67_35": 2497, "35_67": 2498, "10_49": 2499, "49_10": 2500, "10_17": 2501, "17_10": 2502, "10_23": 2503, "23_10": 2504, "60_4": 2505, "4_60": 2506, "18_46": 2507, "46_18": 2508, "45_27": 2509, "27_45": 2510, "66_42": 2511, "42_66": 2512, "13_50": 2513, "50_13": 2514, "30_66": 2515, "66_30": 2516, "46_14": 2517, "14_46": 2518, "59_73": 2519, "73_59": 2520, "52_5": 2521, "5_52": 2522, "18_74": 2523, "74_18": 2524, "5_34": 2525, "34_5": 2526, "36_5": 2527, "5_36": 2528, "37_44": 2529, "44_37": 2530, "37_40": 2531, "40_37": 2532, "37_50": 2533, "50_37": 2534, "70_55": 2535, "55_70": 2536, "54_46": 2537, "46_54": 2538, "8_55": 2539, "55_8": 2540, "74_39": 2541, "39_74": 2542, "54_61": 2543, "61_54": 2544, "61_53": 2545, "53_61": 2546, "23_18": 2547, "18_23": 2548, "21_29": 2549, "29_21": 2550, "18_5": 2551, "5_18": 2552, "68_73": 2553, "73_68": 2554, "66_46": 2555, "46_66": 2556, "6_73": 2557, "73_6": 2558, "32_19": 2559, "19_32": 2560, "45_9": 2561, "9_45": 2562, "33_54": 2563, "54_33": 2564, "15_32": 2565, "32_15": 2566, "43_69": 2567, "69_43": 2568, "30_21": 2569, "21_30": 2570, "54_18": 2571, "18_54": 2572, "41_31": 2573, "31_41": 2574, "6_7": 2575, "7_6": 2576, "49_35": 2577, "35_49": 2578, "21_8": 2579, "8_21": 2580, "21_57": 2581, "57_21": 2582, "54_19": 2583, "19_54": 2584, "57_30": 2585, "30_57": 2586, "6_37": 2587, "37_6": 2588, "3_2": 2589, "2_3": 2590, "49_17": 2591, "17_49": 2592, "29_17": 2593, "17_29": 2594, "74_65": 2595, "65_74": 2596, "58_42": 2597, "42_58": 2598, "73_4": 2599, "4_73": 2600, "27_47": 2601, "47_27": 2602, "32_73": 2603, "73_32": 2604, "57_37": 2605, "37_57": 2606, "32_35": 2607, "35_32": 2608, "38_48": 2609, "48_38": 2610, "57_27": 2611, "27_57": 2612, "57_5": 2613, "5_57": 2614, "57_36": 2615, "36_57": 2616, "18_3": 2617, "3_18": 2618, "39_46": 2619, "46_39": 2620, "43_53": 2621, "53_43": 2622, "65_23": 2623, "23_65": 2624, "52_60": 2625, "60_52": 2626, "59_16": 2627, "16_59": 2628, "15_16": 2629, "16_15": 2630, "32_13": 2631, "13_32": 2632, "43_49": 2633, "49_43": 2634, "19_19": 2635, "59_59": 2636, "9_66": 2637, "66_9": 2638, "52_10": 2639, "10_52": 2640, "28_15": 2641, "48_32": 2642, "32_48": 2643, "48_66": 2644, "66_48": 2645, "58_4": 2646, "4_58": 2647, "49_9": 2648, "9_49": 2649, "50_22": 2650, "22_50": 2651, "33_53": 2652, "53_33": 2653, "29_47": 2654, "47_29": 2655, "44_70": 2656, "70_44": 2657, "4_25": 2658, "25_4": 2659, "29_10": 2660, "10_29": 2661, "34_72": 2662, "72_34": 2663, "36_66": 2664, "66_36": 2665, "57_13": 2666, "13_57": 2667, "5_67": 2668, "67_5": 2669, "28_34": 2670, "8_37": 2671, "37_8": 2672, "6_57": 2673, "57_6": 2674, "23_57": 2675, "57_23": 2676, "15_57": 2677, "57_15": 2678, "30_31": 2679, "31_30": 2680, "49_56": 2681, "56_49": 2682, "54_35": 2683, "35_54": 2684, "48_57": 2685, "57_48": 2686, "71_57": 2687, "57_71": 2688, "59_57": 2689, "57_59": 2690, "59_63": 2691, "63_59": 2692, "73_57": 2693, "57_73": 2694, "54_47": 2695, "47_54": 2696, "71_54": 2697, "20_57": 2698, "57_20": 2699, "54_69": 2700, "69_54": 2701, "42_32": 2702, "32_42": 2703, "25_57": 2704, "57_25": 2705, "34_56": 2706, "56_34": 2707, "6_56": 2708, "56_6": 2709, "54_44": 2710, "44_54": 2711, "74_24": 2712, "24_74": 2713, "74_8": 2714, "8_74": 2715, "15_74": 2716, "74_15": 2717, "10_8": 2718, "8_10": 2719, "74_69": 2720, "69_74": 2721, "55_74": 2722, "74_55": 2723, "74_66": 2724, "66_74": 2725, "74_58": 2726, "58_74": 2727, "74_35": 2728, "35_74": 2729, "74_48": 2730, "48_74": 2731, "74_16": 2732, "16_74": 2733, "74_30": 2734, "30_74": 2735, "74_31": 2736, "31_74": 2737, "74_38": 2738, "38_74": 2739, "74_21": 2740, "21_74": 2741, "34_55": 2742, "55_34": 2743, "19_31": 2744, "31_19": 2745, "24_47": 2746, "47_24": 2747, "66_69": 2748, "69_66": 2749, "58_47": 2750, "47_58": 2751, "42_72": 2752, "72_42": 2753, "24_72": 2754, "72_24": 2755, "30_47": 2756, "47_30": 2757, "33_47": 2758, "47_33": 2759, "9_34": 2760, "34_9": 2761, "9_7": 2762, "7_9": 2763, "9_67": 2764, "67_9": 2765, "18_56": 2766, "56_18": 2767, "9_60": 2768, "60_9": 2769, "9_55": 2770, "55_9": 2771, "21_67": 2772, "67_21": 2773, "9_32": 2774, "32_9": 2775, "61_67": 2776, "67_61": 2777, "67_73": 2778, "73_67": 2779, "58_18": 2780, "18_58": 2781, "67_75": 2782, "75_67": 2783, "55_18": 2784, "18_55": 2785, "67_16": 2786, "16_67": 2787, "33_18": 2788, "18_33": 2789, "43_18": 2790, "18_43": 2791, "42_67": 2792, "67_42": 2793, "23_67": 2794, "67_23": 2795, "60_53": 2796, "53_60": 2797, "56_60": 2798, "60_56": 2799, "70_47": 2800, "47_70": 2801, "8_47": 2802, "47_8": 2803, "49_47": 2804, "47_49": 2805, "23_69": 2806, "69_23": 2807, "25_31": 2808, "31_25": 2809, "42_69": 2810, "69_42": 2811, "42_63": 2812, "63_42": 2813, "42_18": 2814, "18_42": 2815, "23_73": 2816, "73_23": 2817, "42_55": 2818, "55_42": 2819, "25_26": 2820, "26_25": 2821, "6_72": 2822, "72_6": 2823, "58_72": 2824, "72_58": 2825, "70_35": 2826, "35_70": 2827, "42_16": 2828, "16_42": 2829, "42_30": 2830, "30_42": 2831, "42_37": 2832, "37_42": 2833, "42_68": 2834, "68_42": 2835, "42_73": 2836, "73_42": 2837, "30_26": 2838, "26_30": 2839, "58_63": 2840, "63_58": 2841, "23_56": 2842, "56_23": 2843, "42_56": 2844, "56_42": 2845, "42_74": 2846, "74_42": 2847, "20_73": 2848, "73_20": 2849, "33_63": 2850, "63_33": 2851, "59_31": 2852, "31_59": 2853, "33_72": 2854, "72_33": 2855, "48_7": 2856, "7_48": 2857, "47_34": 2858, "34_47": 2859, "48_16": 2860, "16_48": 2861, "30_55": 2862, "55_30": 2863, "48_37": 2864, "37_48": 2865, "28_18": 2866, "18_28": 2867, "28_55": 2868, "55_28": 2869, "28_56": 2870, "56_28": 2871, "58_56": 2872, "56_58": 2873, "28_37": 2874, "37_28": 2875, "28_16": 2876, "16_28": 2877, "28_48": 2878, "28_67": 2879, "67_28": 2880, "28_68": 2881, "68_28": 2882, "33_58": 2883, "58_33": 2884, "28_74": 2885, "74_28": 2886, "68_8": 2887, "8_68": 2888, "21_56": 2889, "56_21": 2890, "6_74": 2891, "74_6": 2892, "56_74": 2893, "74_56": 2894, "60_74": 2895, "74_60": 2896, "35_66": 2897, "66_35": 2898, "26_74": 2899, "74_26": 2900, "37_60": 2901, "60_37": 2902, "70_13": 2903, "13_70": 2904, "57_74": 2905, "74_57": 2906, "18_9": 2907, "9_18": 2908, "63_74": 2909, "74_63": 2910, "18_35": 2911, "35_18": 2912, "61_61": 2913, "55_72": 2914, "72_55": 2915, "59_74": 2916, "74_59": 2917, "70_74": 2918, "74_70": 2919, "37_74": 2920, "74_37": 2921, "32_74": 2922, "74_32": 2923, "56_45": 2924, "45_56": 2925, "33_31": 2926, "31_33": 2927, "63_9": 2928, "9_63": 2929, "45_73": 2930, "73_45": 2931, "47_45": 2932, "45_47": 2933, "18_71": 2934, "71_18": 2935, "43_8": 2936, "8_43": 2937, "72_13": 2938, "13_72": 2939, "21_21": 2940, "6_19": 2941, "19_6": 2942, "54_74": 2943, "74_54": 2944, "20_67": 2945, "67_20": 2946, "18_13": 2947, "13_18": 2948, "50_74": 2949, "74_50": 2950, "56_33": 2951, "33_56": 2952, "18_60": 2953, "60_18": 2954, "63_73": 2955, "73_63": 2956, "47_9": 2957, "9_47": 2958, "43_74": 2959, "74_43": 2960, "49_69": 2961, "69_49": 2962, "49_60": 2963, "60_49": 2964, "34_6": 2965, "6_34": 2966, "33_32": 2967, "32_33": 2968, "71_43": 2969, "43_71": 2970, "67_19": 2971, "19_67": 2972, "12_60": 2973, "60_12": 2974, "12_43": 2975, "43_12": 2976, "12_18": 2977, "18_12": 2978, "8_56": 2979, "56_8": 2980, "12_59": 2981, "59_12": 2982, "71_12": 2983, "12_69": 2984, "69_12": 2985, "12_26": 2986, "26_12": 2987, "51_63": 2988, "63_51": 2989, "68_31": 2990, "31_68": 2991, "12_61": 2992, "61_12": 2993, "12_68": 2994, "68_12": 2995, "33_29": 2996, "29_33": 2997, "23_34": 2998, "34_23": 2999, "21_31": 3000, "31_21": 3001, "30_56": 3002, "56_30": 3003, "13_63": 3004, "63_13": 3005, "23_16": 3006, "16_23": 3007, "8_6": 3008, "6_8": 3009, "8_20": 3010, "20_8": 3011, "13_66": 3012, "66_13": 3013, "21_25": 3014, "25_21": 3015, "25_29": 3016, "29_25": 3017, "43_6": 3018, "6_43": 3019, "25_74": 3020, "74_25": 3021, "9_48": 3022, "48_9": 3023, "21_6": 3024, "6_21": 3025, "21_23": 3026, "23_21": 3027, "32_23": 3028, "23_32": 3029, "25_59": 3030, "59_25": 3031, "42_29": 3032, "29_42": 3033, "42_8": 3034, "8_42": 3035, "42_23": 3036, "23_42": 3037, "67_13": 3038, "13_67": 3039, "13_23": 3040, "23_13": 3041, "12_33": 3042, "33_12": 3043, "12_5": 3044, "5_12": 3045, "38_12": 3046, "12_38": 3047, "68_21": 3048, "21_68": 3049, "32_21": 3050, "21_32": 3051, "59_7": 3052, "7_59": 3053, "59_58": 3054, "58_59": 3055, "25_52": 3056, "52_25": 3057, "42_52": 3058, "52_42": 3059, "59_66": 3060, "66_59": 3061, "6_52": 3062, "52_6": 3063, "58_21": 3064, "21_58": 3065, "16_53": 3066, "53_16": 3067, "72_76": 3068, "76_72": 3069, "76_9": 3070, "9_76": 3071, "76_76": 3072, "76_26": 3073, "26_76": 3074, "46_9": 3075, "9_46": 3076, "76_24": 3077, "24_76": 3078, "26_9": 3079, "9_26": 3080, "76_48": 3081, "48_76": 3082, "76_5": 3083, "5_76": 3084, "76_38": 3085, "38_76": 3086, "76_65": 3087, "65_76": 3088, "76_17": 3089, "17_76": 3090, "76_16": 3091, "16_76": 3092, "76_6": 3093, "6_76": 3094, "24_7": 3095, "7_24": 3096, "76_55": 3097, "55_76": 3098, "76_47": 3099, "47_76": 3100, "8_9": 3101, "9_8": 3102, "76_51": 3103, "51_76": 3104, "34_64": 3105, "64_34": 3106, "76_27": 3107, "27_76": 3108, "21_9": 3109, "9_21": 3110, "9_30": 3111, "30_9": 3112, "42_9": 3113, "9_42": 3114, "58_9": 3115, "9_58": 3116, "70_9": 3117, "9_70": 3118, "51_61": 3119, "61_51": 3120, "25_61": 3121, "61_25": 3122, "8_19": 3123, "19_8": 3124, "66_61": 3125, "61_66": 3126, "8_5": 3127, "5_8": 3128, "8_38": 3129, "38_8": 3130, "25_72": 3131, "72_25": 3132, "6_12": 3133, "12_6": 3134, "15_12": 3135, "12_15": 3136, "51_8": 3137, "66_19": 3138, "19_66": 3139, "30_61": 3140, "61_30": 3141, "43_61": 3142, "61_43": 3143, "59_61": 3144, "61_59": 3145, "34_7": 3146, "7_34": 3147, "73_61": 3148, "61_73": 3149, "48_61": 3150, "61_48": 3151, "19_61": 3152, "61_19": 3153, "19_57": 3154, "57_19": 3155, "19_52": 3156, "52_19": 3157, "19_42": 3158, "42_19": 3159, "19_7": 3160, "7_19": 3161, "19_48": 3162, "48_19": 3163, "19_26": 3164, "26_19": 3165, "19_16": 3166, "16_19": 3167, "11_11": 3168, "71_11": 3169, "11_71": 3170, "11_24": 3171, "24_11": 3172, "11_29": 3173, "29_11": 3174, "11_65": 3175, "65_11": 3176, "23_11": 3177, "11_23": 3178, "48_11": 3179, "11_48": 3180, "32_11": 3181, "11_32": 3182, "49_65": 3183, "65_49": 3184, "11_49": 3185, "49_11": 3186, "11_66": 3187, "66_11": 3188, "11_6": 3189, "6_11": 3190, "59_71": 3191, "71_59": 3192, "11_15": 3193, "15_11": 3194, "11_61": 3195, "61_11": 3196, "33_11": 3197, "11_33": 3198, "11_13": 3199, "13_11": 3200, "11_59": 3201, "59_11": 3202, "11_68": 3203, "68_11": 3204, "11_42": 3205, "42_11": 3206, "11_34": 3207, "34_11": 3208, "11_26": 3209, "26_11": 3210, "11_4": 3211, "4_11": 3212, "54_11": 3213, "11_54": 3214, "41_68": 3215, "68_41": 3216, "41_70": 3217, "70_41": 3218, "41_29": 3219, "29_41": 3220, "32_41": 3221, "41_32": 3222, "43_41": 3223, "41_43": 3224, "48_23": 3225, "23_48": 3226, "48_2": 3227, "2_48": 3228, "41_15": 3229, "15_41": 3230, "41_48": 3231, "48_41": 3232, "41_58": 3233, "58_41": 3234, "43_13": 3235, "13_43": 3236, "4_41": 3237, "41_4": 3238, "41_72": 3239, "72_41": 3240, "41_26": 3241, "26_41": 3242, "41_53": 3243, "53_41": 3244, "41_24": 3245, "24_41": 3246, "2_24": 3247, "24_2": 3248, "32_59": 3249, "59_32": 3250, "2_34": 3251, "34_2": 3252, "2_14": 3253, "14_2": 3254, "42_34": 3255, "34_42": 3256, "42_41": 3257, "41_42": 3258, "6_2": 3259, "2_6": 3260, "41_3": 3261, "3_41": 3262, "28_71": 3263, "71_28": 3264, "20_23": 3265, "23_20": 3266, "20_49": 3267, "49_20": 3268, "38_71": 3269, "71_38": 3270, "71_74": 3271, "74_71": 3272, "33_71": 3273, "71_33": 3274, "14_70": 3275, "70_14": 3276, "19_50": 3277, "50_19": 3278, "14_23": 3279, "23_14": 3280, "14_24": 3281, "24_14": 3282, "14_19": 3283, "19_14": 3284, "38_19": 3285, "19_38": 3286, "14_61": 3287, "61_14": 3288, "19_13": 3289, "13_19": 3290, "14_13": 3291, "13_14": 3292, "19_59": 3293, "59_19": 3294, "14_49": 3295, "49_14": 3296, "58_69": 3297, "69_58": 3298, "15_68": 3299, "68_15": 3300, "33_67": 3301, "67_33": 3302, "13_53": 3303, "53_13": 3304, "44_52": 3305, "52_44": 3306, "50_16": 3307, "16_50": 3308, "48_22": 3309, "22_48": 3310, "66_22": 3311, "22_66": 3312, "49_22": 3313, "22_49": 3314, "8_22": 3315, "22_8": 3316, "15_22": 3317, "22_15": 3318, "58_46": 3319, "46_58": 3320, "22_45": 3321, "45_22": 3322, "24_22": 3323, "22_24": 3324, "72_68": 3325, "68_72": 3326, "22_68": 3327, "68_22": 3328, "22_42": 3329, "42_22": 3330, "22_71": 3331, "71_22": 3332, "22_16": 3333, "16_22": 3334, "23_22": 3335, "22_23": 3336, "22_5": 3337, "5_22": 3338, "34_22": 3339, "22_34": 3340, "4_22": 3341, "22_4": 3342, "43_68": 3343, "68_43": 3344, "22_32": 3345, "32_22": 3346, "22_10": 3347, "10_22": 3348, "22_29": 3349, "29_22": 3350, "62_11": 3351, "11_62": 3352, "48_17": 3353, "17_48": 3354, "36_48": 3355, "48_36": 3356, "30_2": 3357, "2_30": 3358, "71_14": 3359, "14_71": 3360, "2_26": 3361, "26_2": 3362, "62_69": 3363, "69_62": 3364, "62_17": 3365, "17_62": 3366, "36_34": 3367, "34_36": 3368, "36_29": 3369, "29_36": 3370, "64_16": 3371, "16_64": 3372, "2_67": 3373, "67_2": 3374, "2_72": 3375, "72_2": 3376, "2_31": 3377, "31_2": 3378, "2_55": 3379, "55_2": 3380, "2_19": 3381, "19_2": 3382, "2_8": 3383, "8_2": 3384, "2_69": 3385, "69_2": 3386, "2_38": 3387, "38_2": 3388, "2_18": 3389, "18_2": 3390, "2_32": 3391, "32_2": 3392, "2_66": 3393, "66_2": 3394, "13_9": 3395, "9_13": 3396, "60_73": 3397, "73_60": 3398, "2_5": 3399, "5_2": 3400, "71_51": 3401, "51_71": 3402, "71_21": 3403, "21_71": 3404, "62_70": 3405, "70_62": 3406, "36_67": 3407, "67_36": 3408, "36_6": 3409, "6_36": 3410, "23_66": 3411, "66_23": 3412, "2_61": 3413, "61_2": 3414, "2_53": 3415, "53_2": 3416, "2_59": 3417, "59_2": 3418, "2_68": 3419, "68_2": 3420, "71_69": 3421, "69_71": 3422, "46_2": 3423, "2_46": 3424, "71_16": 3425, "16_71": 3426, "71_56": 3427, "56_71": 3428, "36_49": 3429, "49_36": 3430, "71_45": 3431, "45_71": 3432, "2_65": 3433, "65_2": 3434, "2_21": 3435, "21_2": 3436, "2_33": 3437, "33_2": 3438, "2_56": 3439, "56_2": 3440, "2_47": 3441, "47_2": 3442, "2_60": 3443, "60_2": 3444, "15_54": 3445, "54_15": 3446, "25_56": 3447, "56_25": 3448, "27_24": 3449, "24_27": 3450, "27_25": 3451, "25_27": 3452, "27_16": 3453, "16_27": 3454, "27_21": 3455, "21_27": 3456, "27_17": 3457, "17_27": 3458, 