{"PAD": 0, "DUMMY_START_RELATION": 1, "UNK": 2, "72_71": 3, "10_10": 4, "13_2": 5, "49_63": 6, "56_56": 7, "13_72": 8, "43_23": 9, "52_9": 10, "37_37": 11, "52_72": 12, "48_48": 13, "53_68": 14, "56_7": 15, "76_20": 16, "14_71": 17, "8_8": 18, "66_15": 19, "30_39": 20, "30_30": 21, "31_14": 22, "31_56": 23, "17_17": 24, "63_63": 25, "28_52": 26, "21_21": 27, "20_31": 28, "3_3": 29, "20_53": 30, "64_74": 31, "49_7": 32, "66_17": 33, "23_23": 34, "2_26": 35, "19_19": 36, "70_70": 37, "62_13": 38, "19_35": 39, "8_18": 40, "64_64": 41, "18_31": 42, "5_5": 43, "55_71": 44, "71_71": 45, "47_26": 46, "34_71": 47, "42_42": 48, "63_26": 49, "63_71": 50, "55_63": 51, "7_66": 52, "2_64": 53, "22_22": 54, "24_24": 55, "36_34": 56, "20_20": 57, "51_51": 58, "57_57": 59, "14_56": 60, "68_39": 61, "18_18": 62, "76_76": 63, "74_35": 64, "24_12": 65, "75_44": 66, "47_49": 67, "50_67": 68, "73_73": 69, "44_55": 70, "64_37": 71, "44_74": 72, "39_39": 73, "4_42": 74, "51_26": 75, "15_66": 76, "58_68": 77, "9_3": 78, "74_21": 79, "59_62": 80, "73_51": 81, "42_17": 82, "14_28": 83, "15_15": 84, "23_71": 85, "2_47": 86, "40_40": 87, "7_24": 88, "19_44": 89, "26_14": 90, "66_66": 91, "14_10": 92, "72_28": 93, "66_11": 94, "50_50": 95, "15_44": 96, "63_14": 97, "62_47": 98, "38_18": 99, "47_11": 100, "62_62": 101, "20_23": 102, "68_26": 103, "63_23": 104, "47_10": 105, "75_75": 106, "68_14": 107, "11_45": 108, "32_32": 109, "62_9": 110, "40_18": 111, "9_9": 112, "28_28": 113, "29_19": 114, "49_41": 115, "34_73": 116, "9_53": 117, "38_38": 118, "50_71": 119, "34_10": 120, "24_49": 121, "71_17": 122, "59_63": 123, "65_65": 124, "74_68": 125, "11_56": 126, "54_54": 127, "67_37": 128, "11_63": 129, "52_52": 130, "46_46": 131, "68_68": 132, "76_10": 133, "41_41": 134, "58_71": 135, "22_20": 136, "25_71": 137, "25_7": 138, "73_11": 139, "2_2": 140, "3_71": 141, "2_23": 142, "42_10": 143, "66_55": 144, "67_71": 145, "3_31": 146, "50_25": 147, "12_23": 148, "42_47": 149, "19_63": 150, "70_50": 151, "59_53": 152, "74_23": 153, "27_27": 154, "60_60": 155, "56_53": 156, "38_22": 157, "36_68": 158, "43_7": 159, "58_66": 160, "68_11": 161, "26_2": 162, "14_53": 163, "73_19": 164, "75_53": 165, "47_47": 166, "42_53": 167, "76_71": 168, "75_42": 169, "73_42": 170, "60_43": 171, "50_62": 172, "59_59": 173, "56_52": 174, "71_56": 175, "75_51": 176, "52_19": 177, "33_33": 178, "73_9": 179, "69_69": 180, "2_10": 181, "74_26": 182, "3_50": 183, "52_44": 184, "26_23": 185, "24_57": 186, "56_62": 187, "58_26": 188, "55_73": 189, "9_73": 190, "3_74": 191, "14_17": 192, "43_43": 193, "44_7": 194, "35_35": 195, "63_45": 196, "42_45": 197, "29_76": 198, "62_71": 199, "67_23": 200, "4_4": 201, "34_31": 202, "53_4": 203, "10_26": 204, "28_20": 205, "74_45": 206, "71_7": 207, "2_17": 208, "66_72": 209, "74_11": 210, "42_66": 211, "11_71": 212, "67_67": 213, "72_52": 214, "30_60": 215, "55_55": 216, "46_21": 217, "63_22": 218, "53_14": 219, "9_20": 220, "20_28": 221, "67_47": 222, "35_59": 223, "22_59": 224, "45_45": 225, "12_67": 226, "62_59": 227, "74_71": 228, "7_64": 229, "73_62": 230, "7_50": 231, "10_53": 232, "23_26": 233, "20_50": 234, "11_11": 235, "29_53": 236, "35_34": 237, "25_28": 238, "61_61": 239, "18_7": 240, "71_11": 241, "14_27": 242, "36_36": 243, "43_11": 244, "19_50": 245, "68_22": 246, "29_68": 247, "36_5": 248, "63_50": 249, "12_11": 250, "20_19": 251, "25_34": 252, "47_51": 253, "50_11": 254, "75_3": 255, "55_18": 256, "22_2": 257, "19_18": 258, "23_35": 259, "14_67": 260, "42_55": 261, "22_14": 262, "11_28": 263, "72_12": 264, "7_9": 265, "41_71": 266, "41_10": 267, "50_39": 268, "53_53": 269, "16_16": 270, "64_13": 271, "15_63": 272, "47_74": 273, "64_56": 274, "73_26": 275, "59_73": 276, "3_75": 277, "44_50": 278, "25_25": 279, "2_41": 280, "59_71": 281, "47_71": 282, "14_22": 283, "2_20": 284, "4_75": 285, "49_23": 286, "72_67": 287, "24_53": 288, "16_71": 289, "25_36": 290, "30_36": 291, "50_76": 292, "76_50": 293, "69_62": 294, "31_53": 295, "42_3": 296, "51_9": 297, "6_6": 298, "25_44": 299, "39_52": 300, "9_4": 301, "58_58": 302, "55_59": 303, "44_44": 304, "53_71": 305, "31_71": 306, "72_72": 307, "7_72": 308, "47_36": 309, "35_11": 310, "73_36": 311, "11_53": 312, "15_20": 313, "19_9": 314, "72_49": 315, "34_34": 316, "7_7": 317, "23_43": 318, "11_66": 319, "55_56": 320, "32_25": 321, "25_23": 322, "26_63": 323, "50_66": 324, "47_56": 325, "30_38": 326, "3_45": 327, "63_66": 328, "19_28": 329, "71_75": 330, "25_3": 331, "26_26": 332, "76_55": 333, "45_76": 334, "19_43": 335, "56_24": 336, "64_63": 337, "5_51": 338, "51_23": 339, "29_73": 340, "50_51": 341, "57_68": 342, "10_18": 343, "73_20": 344, "17_58": 345, "55_22": 346, "27_41": 347, "25_53": 348, "67_49": 349, "24_23": 350, "12_43": 351, "75_71": 352, "71_4": 353, "23_74": 354, "41_43": 355, "29_37": 356, "29_59": 357, "36_71": 358, "56_10": 359, "55_23": 360, "12_73": 361, "45_52": 362, "45_47": 363, "2_35": 364, "55_62": 365, "62_22": 366, "72_42": 367, "4_73": 368, "30_52": 369, "45_66": 370, "50_56": 371, "63_62": 372, "58_15": 373, "68_53": 374, "17_50": 375, "2_74": 376, "34_44": 377, "44_4": 378, "14_14": 379, "11_47": 380, "57_49": 381, "15_37": 382, "20_68": 383, "43_56": 384, "10_2": 385, "49_42": 386, "4_18": 387, "49_49": 388, "43_59": 389, "52_75": 390, "75_7": 391, "9_31": 392, "63_76": 393, "74_14": 394, "66_9": 395, "18_22": 396, "31_31": 397, "17_71": 398, "26_4": 399, "35_56": 400, "31_4": 401, "75_25": 402, "4_71": 403, "73_7": 404, "49_22": 405, "66_58": 406, "37_42": 407, "45_2": 408, "50_44": 409, "68_63": 410, "53_2": 411, "55_19": 412, "6_66": 413, "44_56": 414, "24_7": 415, "23_56": 416, "23_68": 417, "7_18": 418, "58_9": 419, "63_42": 420, "24_16": 421, "65_7": 422, "74_74": 423, "45_48": 424, "22_50": 425, "13_13": 426, "30_59": 427, "71_67": 428, "42_67": 429, "45_4": 430, "2_56": 431, "56_15": 432, "53_28": 433, "11_14": 434, "35_62": 435, "9_45": 436, "42_31": 437, "16_26": 438, "3_34": 439, "66_20": 440, "74_52": 441, "23_51": 442, "44_3": 443, "45_40": 444, "38_10": 445, "49_57": 446, "21_64": 447, "74_34": 448, "52_63": 449, "2_43": 450, "30_51": 451, "29_50": 452, "8_21": 453, "56_59": 454, "24_26": 455, "9_17": 456, "7_39": 457, "67_10": 458, "19_59": 459, "43_34": 460, "9_24": 461, "52_22": 462, "71_52": 463, "11_42": 464, "70_43": 465, "31_9": 466, "44_71": 467, "56_71": 468, "70_54": 469, "29_52": 470, "74_62": 471, "9_7": 472, "62_50": 473, "42_75": 474, "49_71": 475, "51_75": 476, "23_53": 477, "64_30": 478, "61_19": 479, "71_20": 480, "22_18": 481, "67_30": 482, "17_7": 483, "22_63": 484, "35_2": 485, "76_59": 486, "63_39": 487, "29_23": 488, "66_50": 489, "26_7": 490, "76_72": 491, "37_23": 492, "72_68": 493, "48_70": 494, "47_73": 495, "47_62": 496, "42_2": 497, "3_26": 498, "53_76": 499, "46_51": 500, "15_45": 501, "26_31": 502, "22_62": 503, "76_36": 504, "45_71": 505, "35_9": 506, "63_51": 507, "32_64": 508, "45_5": 509, "47_45": 510, "44_2": 511, "66_12": 512, "40_5": 513, "22_31": 514, "28_59": 515, "10_34": 516, "26_59": 517, "30_61": 518, "73_53": 519, "24_19": 520, "2_50": 521, "50_17": 522, "47_34": 523, "42_23": 524, "53_20": 525, "17_49": 526, "76_19": 527, "59_56": 528, "7_59": 529, "58_24": 530, "55_53": 531, "58_37": 532, "7_76": 533, "15_56": 534, "55_9": 535, "62_55": 536, "29_49": 537, "48_39": 538, "35_67": 539, "22_37": 540, "29_63": 541, "26_20": 542, "49_72": 543, "12_59": 544, "59_52": 545, "22_71": 546, "34_59": 547, "9_66": 548, "35_36": 549, "45_13": 550, "74_53": 551, "76_66": 552, "41_37": 553, "29_71": 554, "2_39": 555, "59_2": 556, "7_56": 557, "66_2": 558, "12_72": 559, "66_45": 560, "22_66": 561, "34_63": 562, "55_72": 563, "47_39": 564, "9_40": 565, "17_62": 566, "24_46": 567, "72_9": 568, "23_34": 569, "32_3": 570, "51_22": 571, "41_44": 572, "36_26": 573, "20_55": 574, "74_19": 575, "35_71": 576, "45_11": 577, "68_59": 578, "53_56": 579, "22_3": 580, "44_53": 581, "30_32": 582, "19_71": 583, "20_10": 584, "44_19": 585, "76_75": 586, "8_7": 587, "60_18": 588, "34_53": 589, "76_42": 590, "41_23": 591, "49_32": 592, "72_53": 593, "39_68": 594, "67_63": 595, "28_53": 596, "64_71": 597, "27_76": 598, "30_25": 599, "18_5": 600, "67_56": 601, "74_29": 602, "19_20": 603, "63_9": 604, "53_3": 605, "74_72": 606, "61_30": 607, "4_2": 608, "73_47": 609, "13_30": 610, "44_31": 611, "44_51": 612, "64_50": 613, "43_19": 614, "60_4": 615, "62_69": 616, "59_5": 617, "39_50": 618, "51_71": 619, "23_11": 620, "70_10": 621, "47_17": 622, "35_74": 623, "25_51": 624, "45_10": 625, "55_35": 626, "62_14": 627, "16_57": 628, "19_10": 629, "49_17": 630, "59_24": 631, "9_63": 632, "31_62": 633, "2_19": 634, "28_71": 635, "72_70": 636, "60_25": 637, "73_34": 638, "72_19": 639, "17_10": 640, "42_71": 641, "36_75": 642, "14_51": 643, "26_71": 644, "75_34": 645, "12_62": 646, "52_53": 647, "58_4": 648, "48_7": 649, "59_25": 650, "14_25": 651, "50_59": 652, "71_22": 653, "71_73": 654, "38_31": 655, "46_18": 656, "50_10": 657, "55_52": 658, "18_45": 659, "41_14": 660, "29_13": 661, "51_7": 662, "20_49": 663, "9_71": 664, "15_34": 665, "52_31": 666, "73_55": 667, "67_25": 668, "10_7": 669, "16_7": 670, "36_14": 671, "44_68": 672, "51_42": 673, "71_74": 674, "51_37": 675, "24_58": 676, "14_19": 677, "17_26": 678, "31_7": 679, "35_17": 680, "31_63": 681, "41_31": 682, "55_66": 683, "41_66": 684, "66_71": 685, "18_51": 686, "72_74": 687, "2_11": 688, "19_53": 689, "13_48": 690, "59_11": 691, "20_47": 692, "55_17": 693, "70_22": 694, "53_63": 695, "9_36": 696, "51_72": 697, "26_76": 698, "59_14": 699, "4_24": 700, "42_9": 701, "31_11": 702, "38_36": 703, "9_72": 704, "50_45": 705, "55_76": 706, "25_26": 707, "23_9": 708, "19_4": 709, "56_20": 710, "2_28": 711, "41_22": 712, "68_19": 713, "58_22": 714, "42_7": 715, "58_56": 716, "19_76": 717, "44_61": 718, "71_3": 719, "36_17": 720, "19_58": 721, "51_62": 722, "34_42": 723, "46_5": 724, "43_41": 725, "20_52": 726, "72_73": 727, "3_55": 728, "75_23": 729, "66_53": 730, "47_75": 731, "3_51": 732, "16_41": 733, "59_44": 734, "22_73": 735, "19_75": 736, "74_49": 737, "27_36": 738, "51_55": 739, "53_55": 740, "14_74": 741, "43_26": 742, "23_45": 743, "5_50": 744, "68_37": 745, "52_55": 746, "14_50": 747, "75_20": 748, "35_25": 749, "47_23": 750, "17_4": 751, "12_26": 752, "42_39": 753, "23_36": 754, "34_19": 755, "54_55": 756, "71_13": 757, "19_39": 758, "56_8": 759, "50_63": 760, "25_66": 761, "31_43": 762, "53_17": 763, "58_55": 764, "58_10": 765, "10_73": 766, "66_43": 767, "69_18": 768, "68_71": 769, "43_71": 770, "9_39": 771, "44_75": 772, "75_59": 773, "59_9": 774, "36_59": 775, "3_39": 776, "36_3": 777, "49_52": 778, "12_12": 779, "63_17": 780, "41_55": 781, "51_59": 782, "23_41": 783, "2_44": 784, "41_25": 785, "43_51": 786, "10_75": 787, "68_21": 788, "45_62": 789, "59_50": 790, "43_14": 791, "10_71": 792, "44_73": 793, "62_63": 794, "67_11": 795, "9_52": 796, "15_59": 797, "41_39": 798, "67_18": 799, "75_11": 800, "2_73": 801, "71_51": 802, "51_3": 803, "17_11": 804, "53_15": 805, "27_68": 806, "49_53": 807, "2_31": 808, "76_67": 809, "35_72": 810, "53_25": 811, "45_31": 812, "22_56": 813, "51_56": 814, "17_61": 815, "4_63": 816, "4_29": 817, "70_2": 818, "13_45": 819, "44_20": 820, "36_52": 821, "50_14": 822, "53_31": 823, "71_64": 824, "12_42": 825, "14_9": 826, "17_56": 827, "42_68": 828, "28_51": 829, "62_73": 830, "74_76": 831, "13_70": 832, "44_11": 833, "43_18": 834, "2_34": 835, "14_62": 836, "43_72": 837, "45_39": 838, "20_13": 839, "19_62": 840, "4_35": 841, "71_50": 842, "11_68": 843, "30_13": 844, "44_47": 845, "5_7": 846, "8_44": 847, "13_68": 848, "36_19": 849, "16_49": 850, "52_37": 851, "31_58": 852, "42_62": 853, "44_45": 854, "23_55": 855, "18_14": 856, "73_10": 857, "47_53": 858, "68_31": 859, "12_31": 860, "56_43": 861, "61_25": 862, "47_63": 863, "46_44": 864, "53_73": 865, "74_9": 866, "44_59": 867, "10_67": 868, "31_26": 869, "20_66": 870, "4_50": 871, "72_18": 872, "68_41": 873, "20_73": 874, "34_76": 875, "64_53": 876, "14_37": 877, "52_47": 878, "68_47": 879, "24_71": 880, "74_41": 881, "12_9": 882, "56_11": 883, "24_6": 884, "17_73": 885, "23_17": 886, "71_36": 887, "45_25": 888, "52_66": 889, "50_3": 890, "44_72": 891, "52_34": 892, "36_39": 893, "51_50": 894, "59_18": 895, "23_52": 896, "42_59": 897, "73_56": 898, "55_3": 899, "3_23": 900, "15_43": 901, "53_74": 902, "19_31": 903, "68_64": 904, "74_24": 905, "68_23": 906, "17_68": 907, "74_2": 908, "43_47": 909, "76_53": 910, "17_36": 911, "72_59": 912, "43_10": 913, "59_34": 914, "56_76": 915, "71_45": 916, "53_75": 917, "67_52": 918, "73_71": 919, "20_2": 920, "44_10": 921, "74_33": 922, "2_68": 923, "19_36": 924, "17_18": 925, "7_12": 926, "47_18": 927, "68_50": 928, "66_75": 929, "44_43": 930, "41_67": 931, "20_63": 932, "17_35": 933, "42_20": 934, "64_39": 935, "19_23": 936, "66_74": 937, "23_10": 938, "31_66": 939, "42_25": 940, "7_26": 941, "72_31": 942, "12_53": 943, "45_43": 944, "49_50": 945, "29_72": 946, "26_50": 947, "2_66": 948, "58_7": 949, "36_53": 950, "32_50": 951, "27_64": 952, "38_44": 953, "73_18": 954, "37_17": 955, "52_59": 956, "15_11": 957, "44_14": 958, "25_74": 959, "9_14": 960, "50_55": 961, "22_23": 962, "56_19": 963, "26_10": 964, "53_35": 965, "49_47": 966, "32_19": 967, "22_70": 968, "34_51": 969, "11_73": 970, "62_2": 971, "59_28": 972, "50_12": 973, "53_23": 974, "64_25": 975, "47_35": 976, "30_12": 977, "37_43": 978, "72_50": 979, "64_10": 980, "60_47": 981, "64_26": 982, "72_55": 983, "16_58": 984, "59_76": 985, "50_73": 986, "72_62": 987, "20_71": 988, "68_72": 989, "71_14": 990, "75_73": 991, "45_56": 992, "41_4": 993, "7_43": 994, "22_76": 995, "34_62": 996, "55_41": 997, "71_15": 998, "64_42": 999, "43_17": 1000, "17_63": 1001, "13_53": 1002, "16_22": 1003, "36_9": 1004, "19_72": 1005, "2_53": 1006, "8_13": 1007, "76_23": 1008, "42_43": 1009, "64_75": 1010, "17_34": 1011, "48_23": 1012, "7_44": 1013, "67_28": 1014, "71_29": 1015, "23_70": 1016, "66_39": 1017, "3_53": 1018, "22_52": 1019, "14_42": 1020, "68_43": 1021, "53_10": 1022, "64_62": 1023, "59_47": 1024, "36_42": 1025, "45_23": 1026, "60_66": 1027, "55_44": 1028, "24_51": 1029, "51_39": 1030, "10_62": 1031, "32_7": 1032, "10_17": 1033, "65_21": 1034, "14_11": 1035, "72_15": 1036, "55_67": 1037, "74_7": 1038, "17_74": 1039, "2_9": 1040, "28_2": 1041, "71_53": 1042, "20_51": 1043, "39_59": 1044, "10_23": 1045, "26_67": 1046, "44_26": 1047, "34_75": 1048, "17_23": 1049, "25_41": 1050, "62_19": 1051, "38_3": 1052, "25_50": 1053, "19_17": 1054, "52_18": 1055, "39_73": 1056, "36_35": 1057, "4_45": 1058, "14_35": 1059, "68_60": 1060, "49_76": 1061, "31_45": 1062, "53_51": 1063, "13_64": 1064, "44_54": 1065, "67_19": 1066, "64_18": 1067, "61_42": 1068, "42_63": 1069, "5_44": 1070, "71_31": 1071, "29_66": 1072, "71_55": 1073, "66_3": 1074, "9_48": 1075, "72_47": 1076, "36_23": 1077, "62_48": 1078, "59_19": 1079, "9_43": 1080, "62_74": 1081, "58_44": 1082, "71_63": 1083, "73_23": 1084, "64_48": 1085, "17_72": 1086, "20_62": 1087, "36_64": 1088, "76_18": 1089, "12_39": 1090, "20_75": 1091, "10_27": 1092, "52_71": 1093, "68_52": 1094, "41_51": 1095, "11_23": 1096, "16_24": 1097, "62_7": 1098, "72_2": 1099, "67_17": 1100, "74_58": 1101, "62_51": 1102, "34_74": 1103, "34_39": 1104, "42_26": 1105, "10_14": 1106, "18_60": 1107, "29_41": 1108, "17_39": 1109, "49_20": 1110, "22_26": 1111, "73_76": 1112, "35_13": 1113, "8_64": 1114, "62_52": 1115, "19_55": 1116, "12_52": 1117, "44_52": 1118, "52_73": 1119, "68_10": 1120, "56_67": 1121, "73_3": 1122, "53_44": 1123, "39_62": 1124, "20_76": 1125, "6_9": 1126, "2_42": 1127, "72_23": 1128, "42_4": 1129, "38_20": 1130, "40_47": 1131, "76_62": 1132, "71_18": 1133, "14_72": 1134, "42_72": 1135, "70_3": 1136, "23_14": 1137, "12_19": 1138, "51_11": 1139, "72_14": 1140, "26_66": 1141, "49_16": 1142, "56_34": 1143, "23_66": 1144, "13_69": 1145, "37_34": 1146, "69_68": 1147, "10_22": 1148, "14_31": 1149, "10_56": 1150, "47_64": 1151, "14_59": 1152, "31_36": 1153, "41_58": 1154, "3_20": 1155, "54_18": 1156, "63_44": 1157, "4_10": 1158, "23_67": 1159, "63_3": 1160, "25_31": 1161, "15_49": 1162, "4_47": 1163, "36_2": 1164, "17_20": 1165, "63_7": 1166, "19_74": 1167, "34_11": 1168, "22_43": 1169, "10_39": 1170, "20_26": 1171, "27_19": 1172, "29_35": 1173, "26_56": 1174, "41_56": 1175, "68_18": 1176, "59_3": 1177, "34_56": 1178, "74_10": 1179, "72_63": 1180, "63_31": 1181, "51_10": 1182, "27_50": 1183, "4_74": 1184, "34_17": 1185, "40_43": 1186, "14_39": 1187, "75_31": 1188, "35_53": 1189, "29_12": 1190, "56_3": 1191, "5_68": 1192, "25_10": 1193, "13_8": 1194, "59_43": 1195, "68_3": 1196, "75_76": 1197, "14_3": 1198, "66_63": 1199, "74_73": 1200, "74_22": 1201, "42_16": 1202, "75_55": 1203, "47_41": 1204, "71_59": 1205, "69_14": 1206, "53_66": 1207, "45_44": 1208, "17_2": 1209, "15_2": 1210, "7_38": 1211, "48_55": 1212, "25_68": 1213, "27_73": 1214, "24_68": 1215, "22_53": 1216, "37_55": 1217, "20_43": 1218, "72_44": 1219, "76_3": 1220, "33_56": 1221, "68_55": 1222, "54_19": 1223, "62_31": 1224, "16_53": 1225, "56_64": 1226, "43_39": 1227, "54_59": 1228, "40_7": 1229, "33_14": 1230, "35_12": 1231, "20_7": 1232, "73_25": 1233, "3_42": 1234, "53_59": 1235, "16_12": 1236, "10_43": 1237, "42_56": 1238, "2_71": 1239, "53_72": 1240, "71_66": 1241, "12_29": 1242, "9_11": 1243, "34_55": 1244, "68_42": 1245, "32_71": 1246, "24_31": 1247, "35_19": 1248, "62_29": 1249, "44_24": 1250, "2_25": 1251, "56_68": 1252, "12_49": 1253, "4_26": 1254, "9_62": 1255, "16_66": 1256, "34_9": 1257, "19_7": 1258, "39_55": 1259, "11_2": 1260, "66_51": 1261, "56_14": 1262, "56_17": 1263, "71_10": 1264, "50_75": 1265, "42_11": 1266, "23_3": 1267, "26_32": 1268, "53_62": 1269, "7_31": 1270, "45_3": 1271, "63_20": 1272, "42_44": 1273, "45_51": 1274, "49_58": 1275, "70_73": 1276, "62_76": 1277, "64_34": 1278, "42_32": 1279, "11_4": 1280, "51_53": 1281, "24_66": 1282, "56_72": 1283, "44_49": 1284, "71_26": 1285, "35_51": 1286, "19_3": 1287, "7_74": 1288, "50_52": 1289, "71_76": 1290, "72_3": 1291, "31_50": 1292, "18_21": 1293, "74_4": 1294, "49_68": 1295, "26_58": 1296, "9_47": 1297, "29_29": 1298, "56_47": 1299, "19_2": 1300, "75_12": 1301, "13_33": 1302, "7_19": 1303, "70_45": 1304, "46_7": 1305, "11_59": 1306, "26_27": 1307, "59_26": 1308, "31_44": 1309, "66_26": 1310, "7_67": 1311, "22_72": 1312, "69_70": 1313, "7_34": 1314, "71_72": 1315, "55_20": 1316, "45_73": 1317, "35_20": 1318, "68_36": 1319, "45_18": 1320, "31_72": 1321, "13_10": 1322, "34_2": 1323, "8_5": 1324, "72_36": 1325, "47_7": 1326, "29_4": 1327, "23_73": 1328, "62_75": 1329, "36_18": 1330, "13_9": 1331, "36_73": 1332, "66_34": 1333, "29_45": 1334, "39_42": 1335, "43_62": 1336, "22_15": 1337, "36_22": 1338, "9_55": 1339, "60_13": 1340, "4_21": 1341, "22_34": 1342, "35_66": 1343, "19_14": 1344, "31_74": 1345, "76_68": 1346, "68_51": 1347, "62_23": 1348, "15_71": 1349, "11_3": 1350, "31_2": 1351, "28_3": 1352, "7_5": 1353, "38_26": 1354, "63_72": 1355, "40_74": 1356, "7_10": 1357, "66_7": 1358, "69_19": 1359, "57_67": 1360, "17_31": 1361, "73_74": 1362, "38_53": 1363, "3_62": 1364, "40_14": 1365, "9_10": 1366, "75_68": 1367, "7_63": 1368, "50_27": 1369, "74_20": 1370, "19_5": 1371, "18_35": 1372, "56_50": 1373, "31_19": 1374, "32_55": 1375, "32_9": 1376, "51_73": 1377, "10_50": 1378, "72_11": 1379, "33_71": 1380, "73_31": 1381, "60_62": 1382, "39_71": 1383, "22_36": 1384, "50_20": 1385, "18_17": 1386, "55_24": 1387, "41_53": 1388, "67_39": 1389, "23_62": 1390, "23_75": 1391, "9_25": 1392, "56_9": 1393, "3_52": 1394, "44_41": 1395, "49_26": 1396, "59_45": 1397, "66_56": 1398, "63_55": 1399, "72_35": 1400, "39_34": 1401, "13_32": 1402, "52_62": 1403, "10_42": 1404, "76_56": 1405, "37_19": 1406, "75_38": 1407, "60_17": 1408, "66_67": 1409, "56_12": 1410, "56_31": 1411, "31_28": 1412, "56_66": 1413, "61_51": 1414, "60_75": 1415, "73_72": 1416, "20_18": 1417, "11_55": 1418, "32_52": 1419, "63_34": 1420, "7_32": 1421, "41_48": 1422, "14_20": 1423, "17_25": 1424, "39_47": 1425, "56_51": 1426, "20_42": 1427, "64_61": 1428, "9_56": 1429, "23_72": 1430, "72_7": 1431, "35_50": 1432, "11_15": 1433, "3_9": 1434, "62_17": 1435, "63_53": 1436, "31_22": 1437, "17_53": 1438, "59_7": 1439, "42_22": 1440, "11_44": 1441, "7_41": 1442, "52_67": 1443, "10_55": 1444, "55_68": 1445, "44_67": 1446, "35_45": 1447, "35_70": 1448, "2_62": 1449, "73_64": 1450, "51_36": 1451, "62_72": 1452, "26_55": 1453, "71_47": 1454, "34_14": 1455, "47_42": 1456, "64_2": 1457, "36_63": 1458, "45_50": 1459, "11_22": 1460, "20_17": 1461, "64_31": 1462, "74_13": 1463, "53_61": 1464, "25_69": 1465, "67_55": 1466, "76_63": 1467, "14_48": 1468, "42_60": 1469, "42_41": 1470, "37_59": 1471, "23_63": 1472, "65_18": 1473, "58_19": 1474, "67_59": 1475, "17_14": 1476, "40_21": 1477, "40_63": 1478, "28_75": 1479, "22_67": 1480, "10_47": 1481, "9_74": 1482, "44_62": 1483, "69_34": 1484, "4_31": 1485, "51_47": 1486, "75_39": 1487, "74_64": 1488, "55_38": 1489, "51_63": 1490, "3_73": 1491, "34_50": 1492, "9_68": 1493, "75_72": 1494, "14_15": 1495, "17_75": 1496, "74_67": 1497, "65_25": 1498, "26_39": 1499, "64_7": 1500, "16_55": 1501, "25_11": 1502, "11_10": 1503, "63_25": 1504, "74_56": 1505, "49_15": 1506, "45_19": 1507, "4_11": 1508, "25_2": 1509, "14_23": 1510, "4_53": 1511, "46_53": 1512, "14_63": 1513, "36_47": 1514, "46_52": 1515, "71_39": 1516, "3_4": 1517, "76_12": 1518, "31_10": 1519, "55_31": 1520, "2_52": 1521, "64_47": 1522, "63_68": 1523, "24_11": 1524, "50_2": 1525, "65_63": 1526, "58_47": 1527, "51_43": 1528, "71_68": 1529, "19_22": 1530, "71_42": 1531, "15_7": 1532, "38_70": 1533, "55_43": 1534, "19_32": 1535, "67_50": 1536, "56_25": 1537, "15_52": 1538, "13_51": 1539, "47_20": 1540, "34_4": 1541, "73_14": 1542, "42_35": 1543, "62_26": 1544, "71_35": 1545, "20_74": 1546, "33_7": 1547, "43_2": 1548, "43_74": 1549, "11_17": 1550, "49_3": 1551, "31_20": 1552, "45_35": 1553, "27_9": 1554, "76_34": 1555, "25_15": 1556, "2_14": 1557, "17_15": 1558, "18_9": 1559, "48_10": 1560, "56_22": 1561, "26_75": 1562, "72_22": 1563, "52_76": 1564, "14_33": 1565, "17_69": 1566, "12_38": 1567, "29_42": 1568, "41_28": 1569, "58_74": 1570, "74_66": 1571, "39_7": 1572, "76_7": 1573, "9_70": 1574, "15_47": 1575, "14_73": 1576, "73_63": 1577, "35_3": 1578, "63_15": 1579, "28_19": 1580, "37_41": 1581, "7_71": 1582, "3_68": 1583, "20_34": 1584, "68_75": 1585, "34_20": 1586, "63_11": 1587, "14_34": 1588, "70_74": 1589, "45_22": 1590, "38_48": 1591, "67_9": 1592, "23_22": 1593, "59_42": 1594, "7_16": 1595, "23_20": 1596, "64_4": 1597, "39_36": 1598, "14_68": 1599, "66_23": 1600, "49_38": 1601, "32_62": 1602, "35_23": 1603, "25_75": 1604, "44_17": 1605, "19_12": 1606, "24_47": 1607, "55_21": 1608, "49_66": 1609, "34_29": 1610, "56_55": 1611, "20_22": 1612, "19_68": 1613, "2_51": 1614, "50_23": 1615, "47_19": 1616, "20_39": 1617, "52_15": 1618, "18_66": 1619, "63_4": 1620, "34_15": 1621, "43_44": 1622, "36_43": 1623, "67_36": 1624, "66_76": 1625, "51_14": 1626, "17_43": 1627, "49_2": 1628, "63_18": 1629, "7_14": 1630, "37_71": 1631, "4_59": 1632, "45_68": 1633, "34_23": 1634, "75_26": 1635, "56_36": 1636, "23_42": 1637, "45_9": 1638, "55_11": 1639, "9_12": 1640, "9_32": 1641, "25_19": 1642, "39_66": 1643, "14_55": 1644, "49_19": 1645, "54_74": 1646, "29_57": 1647, "52_20": 1648, "72_56": 1649, "74_47": 1650, "20_14": 1651, "26_51": 1652, "31_25": 1653, "45_55": 1654, "47_8": 1655, "11_74": 1656, "43_75": 1657, "59_64": 1658, "16_43": 1659, "64_9": 1660, "2_60": 1661, "7_73": 1662, "59_39": 1663, "10_72": 1664, "9_26": 1665, "41_68": 1666, "31_55": 1667, "29_14": 1668, "55_6": 1669, "62_42": 1670, "55_50": 1671, "28_42": 1672, "14_43": 1673, "51_24": 1674, "9_2": 1675, "66_49": 1676, "18_71": 1677, "19_52": 1678, "9_28": 1679, "51_74": 1680, "11_19": 1681, "32_18": 1682, "10_31": 1683, "28_44": 1684, "75_63": 1685, "23_58": 1686, "18_59": 1687, "74_44": 1688, "67_2": 1689, "60_15": 1690, "73_52": 1691, "10_11": 1692, "18_43": 1693, "47_2": 1694, "17_66": 1695, "2_13": 1696, "40_25": 1697, "70_28": 1698, "9_13": 1699, "22_11": 1700, "31_23": 1701, "68_67": 1702, "29_7": 1703, "12_37": 1704, "44_37": 1705, "43_38": 1706, "59_4": 1707, "13_36": 1708, "74_17": 1709, "52_50": 1710, "65_73": 1711, "48_50": 1712, "72_20": 1713, "2_36": 1714, "73_50": 1715, "28_39": 1716, "29_10": 1717, "44_15": 1718, "47_14": 1719, "18_2": 1720, "66_19": 1721, "15_50": 1722, "19_26": 1723, "34_18": 1724, "53_5": 1725, "42_37": 1726, "66_28": 1727, "47_50": 1728, "72_34": 1729, "61_63": 1730, "61_18": 1731, "44_23": 1732, "26_43": 1733, "7_53": 1734, "31_3": 1735, "69_55": 1736, "42_5": 1737, "14_26": 1738, "54_33": 1739, "74_75": 1740, "64_35": 1741, "38_14": 1742, "42_19": 1743, "50_9": 1744, "17_13": 1745, "68_44": 1746, "75_48": 1747, "67_3": 1748, "28_66": 1749, "44_42": 1750, "35_42": 1751, "10_44": 1752, "59_36": 1753, "42_73": 1754, "55_29": 1755, "67_62": 1756, "31_18": 1757, "3_43": 1758, "13_52": 1759, "10_28": 1760, "22_44": 1761, "26_22": 1762, "53_9": 1763, "19_34": 1764, "11_7": 1765, "3_49": 1766, "39_22": 1767, "32_14": 1768, "74_16": 1769, "76_11": 1770, "53_18": 1771, "10_37": 1772, "35_15": 1773, "22_74": 1774, "12_7": 1775, "68_66": 1776, "52_39": 1777, "39_64": 1778, "43_36": 1779, "17_67": 1780, "48_63": 1781, "4_56": 1782, "11_64": 1783, "39_75": 1784, "54_43": 1785, "19_45": 1786, "14_47": 1787, "72_76": 1788, "23_31": 1789, "74_55": 1790, "63_59": 1791, "38_19": 1792, "34_72": 1793, "73_27": 1794, "3_72": 1795, "63_12": 1796, "7_55": 1797, "12_63": 1798, "8_51": 1799, "56_61": 1800, "26_42": 1801, "54_47": 1802, "18_11": 1803, "56_26": 1804, "38_52": 1805, "17_19": 1806, "16_40": 1807, "4_62": 1808, "59_67": 1809, "24_2": 1810, "30_33": 1811, "70_48": 1812, "31_76": 1813, "41_75": 1814, "23_16": 1815, "34_69": 1816, "50_7": 1817, "74_63": 1818, "43_53": 1819, "56_29": 1820, "3_17": 1821, "2_3": 1822, "41_42": 1823, "64_20": 1824, "37_66": 1825, "61_70": 1826, "18_62": 1827, "45_41": 1828, "19_70": 1829, "11_9": 1830, "10_68": 1831, "63_75": 1832, "66_24": 1833, "62_3": 1834, "61_53": 1835, "68_56": 1836, "29_62": 1837, "10_24": 1838, "58_2": 1839, "26_44": 1840, "22_35": 1841, "55_14": 1842, "50_35": 1843, "2_22": 1844, "10_41": 1845, "24_59": 1846, "17_51": 1847, "25_4": 1848, "11_75": 1849, "53_39": 1850, "48_53": 1851, "47_25": 1852, "44_9": 1853, "18_34": 1854, "50_33": 1855, "73_70": 1856, "48_11": 1857, "59_22": 1858, "11_36": 1859, "69_10": 1860, "12_70": 1861, "50_68": 1862, "56_73": 1863, "63_47": 1864, "69_53": 1865, "32_47": 1866, "19_51": 1867, "64_72": 1868, "58_32": 1869, "4_55": 1870, "75_17": 1871, "20_35": 1872, "13_11": 1873, "30_53": 1874, "26_9": 1875, "33_23": 1876, "23_44": 1877, "2_7": 1878, "47_9": 1879, "68_62": 1880, "48_73": 1881, "16_36": 1882, "7_49": 1883, "70_55": 1884, "74_50": 1885, "51_27": 1886, "57_50": 1887, "18_36": 1888, "70_39": 1889, "60_59": 1890, "7_36": 1891, "65_5": 1892, "50_43": 1893, "2_63": 1894, "66_31": 1895, "45_46": 1896, "62_33": 1897, "66_52": 1898, "47_12": 1899, "12_71": 1900, "56_23": 1901, "28_11": 1902, "20_24": 1903, "53_42": 1904, "18_76": 1905, "56_45": 1906, "14_75": 1907, "53_52": 1908, "39_14": 1909, "26_15": 1910, "30_17": 1911, "44_76": 1912, "14_44": 1913, "43_3": 1914, "56_42": 1915, "4_67": 1916, "69_76": 1917, "46_68": 1918, "59_20": 1919, "36_76": 1920, "20_37": 1921, "10_51": 1922, "9_23": 1923, "19_11": 1924, "12_75": 1925, "50_18": 1926, "49_36": 1927, "50_49": 1928, "3_10": 1929, "10_20": 1930, "7_75": 1931, "75_14": 1932, "52_14": 1933, "62_20": 1934, "39_11": 1935, "64_59": 1936, "53_11": 1937, "10_66": 1938, "33_3": 1939, "36_13": 1940, "47_31": 1941, "29_3": 1942, "50_26": 1943, "42_14": 1944, "76_69": 1945, "12_50": 1946, "53_27": 1947, "11_39": 1948, "32_67": 1949, "75_19": 1950, "68_34": 1951, "62_15": 1952, "50_72": 1953, "58_25": 1954, "43_67": 1955, "64_19": 1956, "76_44": 1957, "69_64": 1958, "53_19": 1959, "45_59": 1960, "59_10": 1961, "37_2": 1962, "37_14": 1963, "20_61": 1964, "51_33": 1965, "18_55": 1966, "20_9": 1967, "34_41": 1968, "12_68": 1969, "15_55": 1970, "61_17": 1971, "13_71": 1972, "3_63": 1973, "19_47": 1974, "76_29": 1975, "47_3": 1976, "58_42": 1977, "56_74": 1978, "58_34": 1979, "48_22": 1980, "65_13": 1981, "10_25": 1982, "43_42": 1983, "12_17": 1984, "66_42": 1985, "66_13": 1986, "63_13": 1987, "39_56": 1988, "53_13": 1989, "12_20": 1990, "64_73": 1991, "37_31": 1992, "14_61": 1993, "40_73": 1994, "18_23": 1995, "70_72": 1996, "50_36": 1997, "10_9": 1998, "76_41": 1999, "58_63": 2000, "62_10": 2001, "19_64": 2002, "26_52": 2003, "25_47": 2004, "71_34": 2005, "3_11": 2006, "29_28": 2007, "66_40": 2008, "62_53": 2009, "15_4": 2010, "7_62": 2011, "76_2": 2012, "75_52": 2013, "47_66": 2014, "38_7": 2015, "56_41": 2016, "33_17": 2017, "20_56": 2018, "72_10": 2019, "69_23": 2020, "47_59": 2021, "67_72": 2022, "7_2": 2023, "74_31": 2024, "36_65": 2025, "36_31": 2026, "31_47": 2027, "17_29": 2028, "62_66": 2029, "2_45": 2030, "7_48": 2031, "12_22": 2032, "66_73": 2033, "67_35": 2034, "41_9": 2035, "76_13": 2036, "52_51": 2037, "59_17": 2038, "15_36": 2039, "14_21": 2040, "9_67": 2041, "3_7": 2042, "7_25": 2043, "67_26": 2044, "51_66": 2045, "59_37": 2046, "32_42": 2047, "37_75": 2048, "20_45": 2049, "14_52": 2050, "3_22": 2051, "41_17": 2052, "71_8": 2053, "33_44": 2054, "59_15": 2055, "29_43": 2056, "53_7": 2057, "28_50": 2058, "25_59": 2059, "19_54": 2060, "25_48": 2061, "61_55": 2062, "73_68": 2063, "12_15": 2064, "3_35": 2065, "54_25": 2066, "59_23": 2067, "29_16": 2068, "45_75": 2069, "34_43": 2070, "17_47": 2071, "29_55": 2072, "49_37": 2073, "67_68": 2074, "44_22": 2075, "71_25": 2076, "44_39": 2077, "13_38": 2078, "50_28": 2079, "47_15": 2080, "66_14": 2081, "10_33": 2082, "56_39": 2083, "61_72": 2084, "40_17": 2085, "41_61": 2086, "70_47": 2087, "34_7": 2088, "53_43": 2089, "54_36": 2090, "43_73": 2091, "72_33": 2092, "41_50": 2093, "4_19": 2094, "55_10": 2095, "4_34": 2096, "25_42": 2097, "50_22": 2098, "2_76": 2099, "55_36": 2100, "71_2": 2101, "68_9": 2102, "36_62": 2103, "76_52": 2104, "42_76": 2105, "36_74": 2106, "47_29": 2107, "12_10": 2108, "47_44": 2109, "45_64": 2110, "11_18": 2111, "72_66": 2112, "2_4": 2113, "54_52": 2114, "2_72": 2115, "38_62": 2116, "50_13": 2117, "51_60": 2118, "39_63": 2119, "3_2": 2120, "42_61": 2121, "24_29": 2122, "9_41": 2123, "75_36": 2124, "19_41": 2125, "45_53": 2126, "59_68": 2127, "10_4": 2128, "15_60": 2129, "25_17": 2130, "24_44": 2131, "3_38": 2132, "28_45": 2133, "35_26": 2134, "13_54": 2135, "56_48": 2136, "52_32": 2137, "63_36": 2138, "31_75": 2139, "72_17": 2140, "46_20": 2141, "45_12": 2142, "18_52": 2143, "62_56": 2144, "44_64": 2145, "2_59": 2146, "41_7": 2147, "38_25": 2148, "35_7": 2149, "45_28": 2150, "28_67": 2151, "11_34": 2152, "11_52": 2153, "9_51": 2154, "33_64": 2155, "15_76": 2156, "36_4": 2157, "71_43": 2158, "56_2": 2159, "39_41": 2160, "19_56": 2161, "34_25": 2162, "10_3": 2163, "55_74": 2164, "25_43": 2165, "73_4": 2166, "35_52": 2167, "7_17": 2168, "55_39": 2169, "27_59": 2170, "21_7": 2171, "9_18": 2172, "31_38": 2173, "53_34": 2174, "18_61": 2175, "29_2": 2176, "67_4": 2177, "57_22": 2178, "16_48": 2179, "29_22": 2180, "55_26": 2181, "53_22": 2182, "45_42": 2183, "34_3": 2184, "10_35": 2185, "11_76": 2186, "36_21": 2187, "2_75": 2188, "3_18": 2189, "43_15": 2190, "66_68": 2191, "11_24": 2192, "74_43": 2193, "36_20": 2194, "53_36": 2195, "66_22": 2196, "50_34": 2197, "15_74": 2198, "4_68": 2199, "59_55": 2200, "51_64": 2201, "48_34": 2202, "43_20": 2203, "67_7": 2204, "34_61": 2205, "45_36": 2206, "61_13": 2207, "56_63": 2208, "22_19": 2209, "40_52": 2210, "4_14": 2211, "42_51": 2212, "71_62": 2213, "74_39": 2214, "66_59": 2215, "35_63": 2216, "52_10": 2217, "2_18": 2218, "67_74": 2219, "35_31": 2220, "15_22": 2221, "28_62": 2222, "62_16": 2223, "37_53": 2224, "4_3": 2225, "17_55": 2226, "28_37": 2227, "55_7": 2228, "19_15": 2229, "54_2": 2230, "25_73": 2231, "53_50": 2232, "75_62": 2233, "17_3": 2234, "7_68": 2235, "64_52": 2236, "47_55": 2237, "35_55": 2238, "73_41": 2239, "9_44": 2240, "35_4": 2241, "3_25": 2242, "62_43": 2243, "55_42": 2244, "2_15": 2245, "13_61": 2246, "26_47": 2247, "72_13": 2248, "70_71": 2249, "70_31": 2250, "61_35": 2251, "12_66": 2252, "67_76": 2253, "17_22": 2254, "33_55": 2255, "25_72": 2256, "14_38": 2257, "37_10": 2258, "6_37": 2259, "47_28": 2260, "9_59": 2261, "29_34": 2262, "45_67": 2263, "67_44": 2264, "31_73": 2265, "52_17": 2266, "5_70": 2267, "26_64": 2268, "70_56": 2269, "36_11": 2270, "9_42": 2271, "68_20": 2272, "50_47": 2273, "60_19": 2274, "76_15": 2275, "35_43": 2276, "65_44": 2277, "30_15": 2278, "43_50": 2279, "12_35": 2280, "26_12": 2281, "64_66": 2282, "71_9": 2283, "74_36": 2284, "63_10": 2285, "50_42": 2286, "63_48": 2287, "67_34": 2288, "60_53": 2289, "59_12": 2290, "48_13": 2291, "58_59": 2292, "52_6": 2293, "3_67": 2294, "51_34": 2295, "76_14": 2296, "4_36": 2297, "15_10": 2298, "64_14": 2299, "13_18": 2300, "68_70": 2301, "10_13": 2302, "32_23": 2303, "71_23": 2304, "31_13": 2305, "36_25": 2306, "69_33": 2307, "47_38": 2308, "17_48": 2309, "7_20": 2310, "17_9": 2311, "67_75": 2312, "58_23": 2313, "73_45": 2314, "35_14": 2315, "35_10": 2316, "6_26": 2317, "18_47": 2318, "58_11": 2319, "26_13": 2320, "36_32": 2321, "59_31": 2322, "20_72": 2323, "42_50": 2324, "62_11": 2325, "67_22": 2326, "45_34": 2327, "50_70": 2328, "31_52": 2329, "26_53": 2330, "10_74": 2331, "12_56": 2332, "34_66": 2333, "34_26": 2334, "66_47": 2335, "34_58": 2336, "26_74": 2337, "52_56": 2338, "29_39": 2339, "13_47": 2340, "36_69": 2341, "7_47": 2342, "37_9": 2343, "74_59": 2344, "12_45": 2345, "72_51": 2346, "61_20": 2347, "72_26": 2348, "12_74": 2349, "19_67": 2350, "69_13": 2351, "54_53": 2352, "28_73": 2353, "73_15": 2354, "75_28": 2355, "18_75": 2356, "13_26": 2357, "66_36": 2358, "71_44": 2359, "59_35": 2360, "51_76": 2361, "20_59": 2362, "71_69": 2363, "15_19": 2364, "54_7": 2365, "72_75": 2366, "3_33": 2367, "55_34": 2368, "9_19": 2369, "22_75": 2370, "52_74": 2371, "64_3": 2372, "19_25": 2373, "59_72": 2374, "25_18": 2375, "31_41": 2376, "58_50": 2377, "12_2": 2378, "11_43": 2379, "43_25": 2380, "66_61": 2381, "53_67": 2382, "11_27": 2383, "3_47": 2384, "66_41": 2385, "38_11": 2386, "4_20": 2387, "56_70": 2388, "10_52": 2389, "36_56": 2390, "63_64": 2391, "39_53": 2392, "46_43": 2393, "74_25": 2394, "18_10": 2395, "44_35": 2396, "6_19": 2397, "16_51": 2398, "43_63": 2399, "4_9": 2400, "16_19": 2401, "54_13": 2402, "68_73": 2403, "45_15": 2404, "11_50": 2405, "63_74": 2406, "52_43": 2407, "56_4": 2408, "51_67": 2409, "52_2": 2410, "12_76": 2411, "44_34": 2412, "17_30": 2413, "29_67": 2414, "62_36": 2415, "38_75": 2416, "41_20": 2417, "62_67": 2418, "76_47": 2419, "37_39": 2420, "9_50": 2421, "29_31": 2422, "7_23": 2423, "64_38": 2424, "51_52": 2425, "45_26": 2426, "13_17": 2427, "39_10": 2428, "65_17": 2429, "23_7": 2430, "25_60": 2431, "59_51": 2432, "8_34": 2433, "35_68": 2434, "43_8": 2435, "73_67": 2436, "74_51": 2437, "61_14": 2438, "76_43": 2439, "13_59": 2440, "56_37": 2441, "24_9": 2442, "67_73": 2443, "37_25": 2444, "75_10": 2445, "39_32": 2446, "14_7": 2447, "41_59": 2448, "50_15": 2449, "7_51": 2450, "55_47": 2451, "52_11": 2452, "51_20": 2453, "72_45": 2454, "28_23": 2455, "33_66": 2456, "60_51": 2457, "22_68": 2458, "36_50": 2459, "31_68": 2460, "24_39": 2461, "9_15": 2462, "31_51": 2463, "44_70": 2464, "31_35": 2465, "39_51": 2466, "11_32": 2467, "67_31": 2468, "67_13": 2469, "20_44": 2470, "26_3": 2471, "19_38": 2472, "69_74": 2473, "51_41": 2474, "73_2": 2475, "46_74": 2476, "2_54": 2477, "42_34": 2478, "63_28": 2479, "3_14": 2480, "11_12": 2481, "39_17": 2482, "31_17": 2483, "43_55": 2484, "17_5": 2485, "60_14": 2486, "66_44": 2487, "23_47": 2488, "35_18": 2489, "16_5": 2490, "67_45": 2491, "70_18": 2492, "43_31": 2493, "63_58": 2494, "55_49": 2495, "73_43": 2496, "56_28": 2497, "47_76": 2498, "36_55": 2499, "71_19": 2500, "34_68": 2501, "53_48": 2502, "50_32": 2503, "51_21": 2504, "14_4": 2505, "54_64": 2506, "35_22": 2507, "29_56": 2508, "24_55": 2509, "12_25": 2510, "39_31": 2511, "64_24": 2512, "35_76": 2513, "48_31": 2514, "70_44": 2515, "26_19": 2516, "43_29": 2517, "52_64": 2518, "52_7": 2519, "14_2": 2520, "36_72": 2521, "22_49": 2522, "46_42": 2523, "24_36": 2524, "17_21": 2525, "7_21": 2526, "23_59": 2527, "4_72": 2528, "76_35": 2529, "25_13": 2530, "76_39": 2531, "70_5": 2532, "58_73": 2533, "70_26": 2534, "34_22": 2535, "44_12": 2536, "39_2": 2537, "8_72": 2538, "4_44": 2539, "16_10": 2540, "58_51": 2541, "17_41": 2542, "9_34": 2543, "41_5": 2544, "47_40": 2545, "43_68": 2546, "44_36": 2547, "42_49": 2548, "69_52": 2549, "10_45": 2550, "29_18": 2551, "40_45": 2552, "39_76": 2553, "66_35": 2554, "7_52": 2555, "33_70": 2556, "15_18": 2557, "8_42": 2558, "41_62": 2559, "3_19": 2560, "52_70": 2561, "24_63": 2562, "54_69": 2563, "58_35": 2564, "76_26": 2565, "52_36": 2566, "60_69": 2567, "68_2": 2568, "60_20": 2569, "34_12": 2570, "59_66": 2571, "34_36": 2572, "25_52": 2573, "56_75": 2574, "33_2": 2575, "22_55": 2576, "73_75": 2577, "37_47": 2578, "17_64": 2579, "63_65": 2580, "17_59": 2581, "2_49": 2582, "7_42": 2583, "28_63": 2584, "42_28": 2585, "68_7": 2586, "48_17": 2587, "61_71": 2588, "15_26": 2589, "14_36": 2590, "61_36": 2591, "33_42": 2592, "61_3": 2593, "66_4": 2594, "49_10": 2595, "18_38": 2596, "39_3": 2597, "72_64": 2598, "65_14": 2599, "12_28": 2600, "36_10": 2601, "36_44": 2602, "73_44": 2603, "22_38": 2604, "49_62": 2605, "53_45": 2606, "5_49": 2607, "12_55": 2608, "41_63": 2609, "67_20": 2610, "42_29": 2611, "3_27": 2612, "51_19": 2613, "37_76": 2614, "70_59": 2615, "31_42": 2616, "34_64": 2617, "15_73": 2618, "53_64": 2619, "51_18": 2620, "26_35": 2621, "44_69": 2622, "69_27": 2623, "49_12": 2624, "52_4": 2625, "21_51": 2626, "26_73": 2627, "35_39": 2628, "15_62": 2629, "28_31": 2630, "63_30": 2631, "44_25": 2632, "53_47": 2633, "10_63": 2634, "51_44": 2635, "68_76": 2636, "76_9": 2637, "61_56": 2638, "51_45": 2639, "41_36": 2640, "71_41": 2641, "50_19": 2642, "13_60": 2643, "4_52": 2644, "19_73": 2645, "45_7": 2646, "31_67": 2647, "68_32": 2648, "61_62": 2649, "49_24": 2650, "76_73": 2651, "42_69": 2652, "33_62": 2653, "28_56": 2654, "48_75": 2655, "6_11": 2656, "67_64": 2657, "48_42": 2658, "42_18": 2659, "5_64": 2660, "16_68": 2661, "46_22": 2662, "62_8": 2663, "68_74": 2664, "34_47": 2665, "24_22": 2666, "38_72": 2667, "25_70": 2668, "42_36": 2669, "63_56": 2670, "22_45": 2671, "60_2": 2672, "60_31": 2673, "48_4": 2674, "74_12": 2675, "36_29": 2676, "31_16": 2677, "61_9": 2678, "26_34": 2679, "64_60": 2680, "51_68": 2681, "17_44": 2682, "11_31": 2683, "14_45": 2684, "7_40": 2685, "63_52": 2686, "29_9": 2687, "76_51": 2688, "17_52": 2689, "20_36": 2690, "50_31": 2691, "15_42": 2692, "18_20": 2693, "28_76": 2694, "70_11": 2695, "11_62": 2696, "74_32": 2697, "23_4": 2698, "27_67": 2699, "9_49": 2700, "58_52": 2701, "48_71": 2702, "37_15": 2703, "68_35": 2704, "30_64": 2705, "38_35": 2706, "34_28": 2707, "55_75": 2708, "37_73": 2709, "16_17": 2710, "11_67": 2711, "11_72": 2712, "56_44": 2713, "43_70": 2714, "41_47": 2715, "15_9": 2716, "44_13": 2717, "63_41": 2718, "47_68": 2719, "35_47": 2720, "36_67": 2721, "63_2": 2722, "60_36": 2723, "64_17": 2724, "52_42": 2725, "73_69": 2726, "16_45": 2727, "36_7": 2728, "41_76": 2729, "18_49": 2730, "33_35": 2731, "4_23": 2732, "51_61": 2733, "30_71": 2734, "45_29": 2735, "3_13": 2736, "75_66": 2737, "35_29": 2738, "22_17": 2739, "18_54": 2740, "56_18": 2741, "46_8": 2742, "68_33": 2743, "38_64": 2744, "32_41": 2745, "15_53": 2746, "58_39": 2747, "12_44": 2748, "3_15": 2749, "19_48": 2750, "62_41": 2751, "41_34": 2752, "74_60": 2753, "18_32": 2754, "58_14": 2755, "6_52": 2756, "18_68": 2757, "68_15": 2758, "60_35": 2759, "4_39": 2760, "57_51": 2761, "67_43": 2762, "75_4": 2763, "33_43": 2764, "51_31": 2765, "39_74": 2766, "32_36": 2767, "66_27": 2768, "62_68": 2769, "58_43": 2770, "52_13": 2771, "20_25": 2772, "10_64": 2773, "70_23": 2774, "23_50": 2775, "20_3": 2776, "38_68": 2777, "2_21": 2778, "60_21": 2779, "34_16": 2780, "30_23": 2781, "7_15": 2782, "73_59": 2783, "16_28": 2784, "58_20": 2785, "32_26": 2786, "61_52": 2787, "28_9": 2788, "72_60": 2789, "18_44": 2790, "40_44": 2791, "72_41": 2792, "50_4": 2793, "73_28": 2794, "4_25": 2795, "23_25": 2796, "24_74": 2797, "54_42": 2798, "37_50": 2799, "71_16": 2800, "12_58": 2801, "60_74": 2802, "18_64": 2803, "46_19": 2804, "74_18": 2805, "60_73": 2806, "37_22": 2807, "7_28": 2808, "69_67": 2809, "63_38": 2810, "73_17": 2811, "25_62": 2812, "76_74": 2813, "7_11": 2814, "54_22": 2815, "43_45": 2816, "35_64": 2817, "68_17": 2818, "64_11": 2819, "36_12": 2820, "65_64": 2821, "27_63": 2822, "76_37": 2823, "60_72": 2824, "26_28": 2825, "69_12": 2826, "25_64": 2827, "44_28": 2828, "19_42": 2829, "41_74": 2830, "14_54": 2831, "41_35": 2832, "64_36": 2833, "34_52": 2834, "67_69": 2835, "29_11": 2836, "40_64": 2837, "51_70": 2838, "18_73": 2839, "16_4": 2840, "49_59": 2841, "58_28": 2842, "15_33": 2843, "66_10": 2844, "62_12": 2845, "13_19": 2846, "66_64": 2847, "12_61": 2848, "7_35": 2849, "22_7": 2850, "19_29": 2851, "58_41": 2852, "67_48": 2853, "56_21": 2854, "64_55": 2855, "64_44": 2856, "55_2": 2857, "64_23": 2858, "10_12": 2859, "32_15": 2860, "71_37": 2861, "35_5": 2862, "51_2": 2863, "64_12": 2864, "30_11": 2865, "51_69": 2866, "13_31": 2867, "69_31": 2868, "11_70": 2869, "4_38": 2870, "41_13": 2871, "53_41": 2872, "51_12": 2873, "30_18": 2874, "35_32": 2875, "41_27": 2876, "59_75": 2877, "47_52": 2878, "73_60": 2879, "38_73": 2880, "24_15": 2881, "62_70": 2882, "34_37": 2883, "23_12": 2884, "39_19": 2885, "46_13": 2886, "58_16": 2887, "45_20": 2888, "47_4": 2889, "67_66": 2890, "23_19": 2891, "52_26": 2892, "29_20": 2893, "13_15": 2894, "35_44": 2895, "19_66": 2896, "32_22": 2897, "11_51": 2898, "15_75": 2899, "23_2": 2900, "30_20": 2901, "28_10": 2902, "75_60": 2903, "3_64": 2904, "73_13": 2905, "67_53": 2906, "60_64": 2907, "13_7": 2908, "9_75": 2909, "28_68": 2910, "24_60": 2911, "2_58": 2912, "63_19": 2913, "50_53": 2914, "52_33": 2915, "5_42": 2916, "75_45": 2917, "39_9": 2918, "11_41": 2919, "18_63": 2920, "72_24": 2921, "68_48": 2922, "17_76": 2923, "28_41": 2924, "47_58": 2925, "13_5": 2926, "46_25": 2927, "53_26": 2928, "69_59": 2929, "26_18": 2930, "41_19": 2931, "29_44": 2932, "14_76": 2933, "13_35": 2934, "37_44": 2935, "19_21": 2936, "50_69": 2937, "26_68": 2938, "12_69": 2939, "46_45": 2940, "20_11": 2941, "45_61": 2942, "14_16": 2943, "35_73": 2944, "48_47": 2945, "45_17": 2946, "65_59": 2947, "51_49": 2948, "20_67": 2949, "33_11": 2950, "3_12": 2951, "52_68": 2952, "71_70": 2953, "60_42": 2954, "25_35": 2955, "35_21": 2956, "16_73": 2957, "8_56": 2958, "76_5": 2959, "55_37": 2960, "19_69": 2961, "25_9": 2962, "27_2": 2963, "4_64": 2964, "4_51": 2965, "52_29": 2966, "72_43": 2967, "60_56": 2968, "10_70": 2969, "48_26": 2970, "46_10": 2971, "56_35": 2972, "31_59": 2973, "73_22": 2974, "62_44": 2975, "26_61": 2976, "45_14": 2977, "22_51": 2978, "58_31": 2979, "34_35": 2980, "15_23": 2981, "32_17": 2982, "70_63": 2983, "71_24": 2984, "62_64": 2985, "7_58": 2986, "26_62": 2987, "20_69": 2988, "32_74": 2989, "64_33": 2990, "55_12": 2991, "54_51": 2992, "28_55": 2993, "32_53": 2994, "34_5": 2995, "50_24": 2996, "3_59": 2997, "2_32": 2998, "30_2": 2999, "13_74": 3000, "66_18": 3001, "47_22": 3002, "36_51": 3003, "60_23": 3004, "47_67": 3005, "52_45": 3006, "70_35": 3007, "24_64": 3008, "27_23": 3009, "34_67": 3010, "7_22": 3011, "11_20": 3012, "63_73": 3013, "11_26": 3014, "15_14": 3015, "6_31": 3016, "14_18": 3017, "26_36": 3018, "58_67": 3019, "33_34": 3020, "75_47": 3021, "41_2": 3022, "59_58": 3023, "51_4": 3024, "74_42": 3025, "39_45": 3026, "62_24": 3027, "63_35": 3028, "51_38": 3029, "70_75": 3030, "73_33": 3031, "15_68": 3032, "53_38": 3033, "16_15": 3034, "32_68": 3035, "18_41": 3036, "7_27": 3037, "13_65": 3038, "75_56": 3039, "32_31": 3040, "43_4": 3041, "59_38": 3042, "28_25": 3043, "10_59": 3044, "9_5": 3045, "59_74": 3046, "14_12": 3047, "57_66": 3048, "47_32": 3049, "62_35": 3050, "27_53": 3051, "9_35": 3052, "38_74": 3053, "66_70": 3054, "55_15": 3055, "44_32": 3056, "22_48": 3057, "73_40": 3058, "72_37": 3059, "28_74": 3060, "38_9": 3061, "18_29": 3062, "31_48": 3063, "72_4": 3064, "8_58": 3065, "21_36": 3066, "44_5": 3067, "62_39": 3068, "41_73": 3069, "41_72": 3070, "26_11": 3071, "64_45": 3072, "63_43": 3073, "66_5": 3074, "16_9": 3075, "43_66": 3076, "60_9": 3077, "52_3": 3078, "18_25": 3079, "30_56": 3080, "61_22": 3081, "37_4": 3082, "71_32": 3083, "60_68": 3084, "63_70": 3085, "61_59": 3086, "72_25": 3087, "47_70": 3088, "7_13": 3089, "3_41": 3090, "31_34": 3091, "7_8": 3092, "70_13": 3093, "74_15": 3094, "40_62": 3095, "41_52": 3096, "56_40": 3097, "15_39": 3098, "5_55": 3099, "64_15": 3100, "20_15": 3101, "28_34": 3102, "63_49": 3103, "62_18": 3104, "5_53": 3105, "52_41": 3106, "69_11": 3107, "40_36": 3108, "39_6": 3109, "66_37": 3110, "2_67": 3111, "33_51": 3112, "38_45": 3113, "27_72": 3114, "64_67": 3115, "39_26": 3116, "36_49": 3117, "33_9": 3118, "48_33": 3119, "54_11": 3120, "52_25": 3121, "61_64": 3122, "59_48": 3123, "53_70": 3124, "22_4": 3125, "11_69": 3126, "33_53": 3127, "35_75": 3128, "25_12": 3129, "9_76": 3130, "11_35": 3131, "23_64": 3132, "52_69": 3133, "75_9": 3134, "32_34": 3135, "72_48": 3136, "22_61": 3137, "41_15": 3138, "53_54": 3139, "5_40": 3140, "70_7": 3141, "26_49": 3142, "3_56": 3143, "28_29": 3144, "38_21": 3145, "68_12": 3146, "37_52": 3147, "22_64": 3148, "27_26": 3149, "48_38": 3150, "59_61": 3151, "24_62": 3152, "50_29": 3153, "41_64": 3154, "47_13": 3155, "18_19": 3156, "48_18": 3157, "65_51": 3158, "65_19": 3159, "70_20": 3160, "53_37": 3161, "20_29": 3162, "13_62": 3163, "25_29": 3164, "3_30": 3165, "46_2": 3166, "16_18": 3167, "38_56": 3168, "69_42": 3169, "13_46": 3170, "44_66": 3171, "28_70": 3172, "10_76": 3173, "16_39": 3174, "62_61": 3175, "18_56": 3176, "4_7": 3177, "34_45": 3178, "67_41": 3179, "50_58": 3180, "22_12": 3181, "32_2": 3182, "38_47": 3183, "68_4": 3184, "8_19": 3185, "31_12": 3186, "55_27": 3187, "16_72": 3188, "29_38": 3189, "61_31": 3190, "23_76": 3191, "60_32": 3192, "34_33": 3193, "39_28": 3194, "52_12": 3195, "13_50": 3196, "42_74": 3197, "39_67": 3198, "35_61": 3199, "70_19": 3200, "68_45": 3201, "24_37": 3202, "52_61": 3203, "30_14": 3204, "52_28": 3205, "75_16": 3206, "54_21": 3207, "22_10": 3208, "20_41": 3209, "62_45": 3210, "63_21": 3211, "49_48": 3212, "26_72": 3213, "22_9": 3214, "15_58": 3215, "15_72": 3216, "2_48": 3217, "12_21": 3218, "72_39": 3219, "32_59": 3220, "47_5": 3221, "29_75": 3222, "61_68": 3223, "41_3": 3224, "9_6": 3225, "60_55": 3226, "67_51": 3227, "25_20": 3228, "58_62": 3229, "47_43": 3230, "4_28": 3231, "59_49": 3232, "53_32": 3233, "28_17": 3234, "46_63": 3235, "68_5": 3236, "39_29": 3237, "14_40": 3238, "68_49": 3239, "56_13": 3240, "76_33": 3241, "2_33": 3242, "49_9": 3243, "18_3": 3244, "9_37": 3245, "47_27": 3246, "24_14": 3247, "75_2": 3248, "19_37": 3249, "18_39": 3250, "27_51": 3251, "3_66": 3252, "13_43": 3253, "69_71": 3254, "8_71": 3255, "35_28": 3256, "74_61": 3257, "69_50": 3258, "32_33": 3259, "44_18": 3260, "52_23": 3261, "3_36": 3262, "50_41": 3263, "55_54": 3264, "42_52": 3265, "72_29": 3266, "40_35": 3267, "15_13": 3268, "24_52": 3269, "38_42": 3270, "11_5": 3271, "10_46": 3272, "46_26": 3273, "40_55": 3274, "53_58": 3275, "23_37": 3276, "13_56": 3277, "3_76": 3278, "70_51": 3279, "58_53": 3280, "6_44": 3281, "63_67": 3282, "35_38": 3283, "44_63": 3284, "25_14": 3285, "17_42": 3286, "16_23": 3287, "50_5": 3288, "54_9": 3289, "32_39": 3290, "34_48": 3291, "60_33": 3292, "73_66": 3293, "40_4": 3294, "41_11": 3295, "23_49": 3296, "45_63": 3297, "22_41": 3298, "70_52": 3299, "6_4": 3300, "33_75": 3301, "23_18": 3302, "51_17": 3303, "26_17": 3304, "20_16": 3305, "54_5": 3306, "25_39": 3307, "74_3": 3308, "35_41": 3309, "12_36": 3310, "64_68": 3311, "60_3": 3312, "39_12": 3313, "8_22": 3314, "49_4": 3315, "33_67": 3316, "60_71": 3317, "4_22": 3318, "33_45": 3319, "61_34": 3320, "72_40": 3321, "29_17": 3322, "76_31": 3323, "42_15": 3324, "75_70": 3325, "24_50": 3326, "58_12": 3327, "31_60": 3328, "20_21": 3329, "29_47": 3330, "39_44": 3331, "4_15": 3332, "70_41": 3333, "60_7": 3334, "47_72": 3335, "51_35": 3336, "70_14": 3337, "12_13": 3338, "76_32": 3339, "25_32": 3340, "32_11": 3341, "48_9": 3342, "10_15": 3343, "13_75": 3344, "48_41": 3345, "12_41": 3346, "58_36": 3347, "45_72": 3348, "14_64": 3349, "36_15": 3350, "69_44": 3351, "18_4": 3352, "18_33": 3353, "27_11": 3354, "55_28": 3355, "73_39": 3356, "69_73": 3357, "38_51": 3358, "32_56": 3359, "31_39": 3360, "14_41": 3361, "16_62": 3362, "37_3": 3363, "9_22": 3364, "2_5": 3365, "66_62": 3366, "58_54": 3367, "60_5": 3368, "24_20": 3369, "43_52": 3370, "16_20": 3371, "33_19": 3372, "27_47": 3373, "43_5": 3374, "39_25": 3375, "63_60": 3376, "62_32": 3377, "76_49": 3378, "31_40": 3379, "25_56": 3380, "23_39": 3381, "28_4": 3382, "26_5": 3383, "71_28": 3384, "67_15": 3385, "46_64": 3386, "63_69": 3387, "39_23": 3388, "37_7": 3389, "3_69": 3390, "61_26": 3391, "61_75": 3392, "28_14": 3393, "30_26": 3394, "72_27": 3395, "5_73": 3396, "36_58": 3397, "20_12": 3398, "36_40": 3399, "26_45": 3400, "42_64": 3401, "28_72": 3402, "49_67": 3403, "23_32": 3404, "73_12": 3405, "22_33": 3406, "38_13": 3407, "62_25": 3408, "16_61": 3409, "12_34": 3410, "68_69": 3411, "73_37": 3412, "50_74": 3413, "9_29": 3414, "16_29": 3415, "51_13": 3416, "60_34": 3417, "48_45": 3418, "54_12": 3419, "75_43": 3420, "44_38": 3421, "13_40": 3422, "25_63": 3423, "42_48": 3424, "30_9": 3425, "32_73": 3426, "74_5": 3427, "2_12": 3428, "12_14": 3429, "67_42": 3430, "23_15": 3431, "51_15": 3432, "55_51": 3433, "54_45": 3434, "3_70": 3435, "25_45": 3436, "36_61": 3437, "27_71": 3438, "27_17": 3439, "33_20": 3440, "66_29": 3441, "64_76": 3442, "3_16": 3443, "66_25": 3444, "19_6": 3445, "5_13": 3446, "33_52": 3447, "11_25": 3448, "58_8": 3449, "43_24": 3450, 