{"PAD": 0, "DUMMY_START_RELATION": 1, "UNK": 2, "70_92": 3, "130_92": 4, "84_92": 5, "33_92": 6, "166_92": 7, "102_92": 8, "91_92": 9, "93_92": 10, "27_92": 11, "127_92": 12, "18_92": 13, "198_92": 14, "126_92": 15, "131_92": 16, "196_92": 17, "15_92": 18, "36_92": 19, "11_92": 20, "111_92": 21, "53_92": 22, "95_57": 23, "87_92": 24, "98_92": 25, "74_92": 26, "85_92": 27, "61_92": 28, "57_92": 29, "96_92": 30, "190_92": 31, "182_92": 32, "119_92": 33, "22_92": 34, "38_92": 35, "108_92": 36, "125_92": 37, "16_92": 38, "67_92": 39, "96_96": 40, "164_92": 41, "25_92": 42, "23_92": 43, "95_92": 44, "31_92": 45, "5_92": 46, "151_92": 47, "42_92": 48, "55_92": 49, "92_92": 50, "9_96": 51, "124_92": 52, "6_92": 53, "122_92": 54, "105_92": 55, "109_92": 56, "108_81": 57, "81_108": 58, "145_82": 59, "82_145": 60, "85_126": 61, "126_85": 62, "172_194": 63, "194_172": 64, "13_157": 65, "157_13": 66, "148_10": 67, "10_148": 68, "176_176": 69, "45_145": 70, "145_45": 71, "45_110": 72, "110_45": 73, "197_119": 74, "119_197": 75, "197_52": 76, "52_197": 77, "167_157": 78, "157_167": 79, "21_38": 80, "38_21": 81, "148_103": 82, "103_148": 83, "152_110": 84, "110_152": 85, "152_152": 86, "97_41": 87, "41_97": 88, "70_63": 89, "63_70": 90, "6_118": 91, "118_6": 92, "39_181": 93, "181_39": 94, "39_82": 95, "82_39": 96, "197_10": 97, "10_197": 98, "82_173": 99, "173_82": 100, "180_180": 101, "180_187": 102, "187_180": 103, "31_10": 104, "10_31": 105, "5_24": 106, "24_5": 107, "5_52": 108, "52_5": 109, "5_70": 110, "70_5": 111, "31_5": 112, "5_31": 113, "104_157": 114, "157_104": 115, "182_26": 116, "26_182": 117, "147_25": 118, "25_147": 119, "75_157": 120, "157_75": 121, "75_81": 122, "81_75": 123, "36_110": 124, "110_36": 125, "87_61": 126, "61_87": 127, "21_52": 128, "52_21": 129, "170_157": 130, "157_170": 131, "170_110": 132, "110_170": 133, "181_110": 134, "110_181": 135, "181_185": 136, "185_181": 137, "62_62": 138, "62_192": 139, "192_62": 140, "62_128": 141, "128_62": 142, "112_112": 143, "40_40": 144, "67_149": 145, "149_67": 146, "82_82": 147, "82_26": 148, "26_82": 149, "148_61": 150, "61_148": 151, "147_61": 152, "61_147": 153, "124_4": 154, "4_124": 155, "124_140": 156, "140_124": 157, "124_124": 158, "124_112": 159, "112_124": 160, "136_136": 161, "136_129": 162, "129_136": 163, "58_58": 164, "147_52": 165, "52_147": 166, "124_200": 167, "200_124": 168, "94_110": 169, "110_94": 170, "6_119": 171, "119_6": 172, "87_10": 173, "10_87": 174, "131_119": 175, "119_131": 176, "142_157": 177, "157_142": 178, "142_104": 179, "104_142": 180, "142_82": 181, "82_142": 182, "142_142": 183, "33_75": 184, "75_33": 185, "33_71": 186, "71_33": 187, "14_14": 188, "138_198": 189, "198_138": 190, "6_25": 191, "25_6": 192, "181_81": 193, "81_181": 194, "94_75": 195, "75_94": 196, "85_198": 197, "198_85": 198, "74_53": 199, "53_74": 200, "57_5": 201, "5_57": 202, "111_71": 203, "71_111": 204, "111_110": 205, "110_111": 206, "111_180": 207, "180_111": 208, "111_185": 209, "185_111": 210, "173_110": 211, "110_173": 212, "131_25": 213, "25_131": 214, "155_78": 215, "78_155": 216, "155_184": 217, "184_155": 218, "124_125": 219, "125_124": 220, "186_181": 221, "181_186": 222, "186_46": 223, "46_186": 224, "186_140": 225, "140_186": 226, "21_119": 227, "119_21": 228, "57_198": 229, "198_57": 230, "96_85": 231, "85_96": 232, "96_25": 233, "25_96": 234, "31_164": 235, "164_31": 236, "77_77": 237, "77_176": 238, "176_77": 239, "96_5": 240, "5_96": 241, "64_157": 242, "157_64": 243, "64_66": 244, "66_64": 245, "64_82": 246, "82_64": 247, "131_10": 248, "10_131": 249, "5_72": 250, "72_5": 251, "148_164": 252, "164_148": 253, "147_133": 254, "133_147": 255, "127_22": 256, "22_127": 257, "21_10": 258, "10_21": 259, "82_157": 260, "157_82": 261, "82_66": 262, "66_82": 263, "149_149": 264, "149_104": 265, "104_149": 266, "173_151": 267, "151_173": 268, "5_48": 269, "48_5": 270, "140_140": 271, "140_62": 272, "62_140": 273, "140_78": 274, "78_140": 275, "139_110": 276, "110_139": 277, "198_24": 278, "24_198": 279, "198_70": 280, "70_198": 281, "121_110": 282, "110_121": 283, "123_191": 284, "191_123": 285, "123_123": 286, "82_174": 287, "174_82": 288, "87_133": 289, "133_87": 290, "78_78": 291, "104_104": 292, "97_97": 293, "87_118": 294, "118_87": 295, "171_80": 296, "80_171": 297, "195_157": 298, "157_195": 299, "195_104": 300, "104_195": 301, "148_119": 302, "119_148": 303, "197_70": 304, "70_197": 305, "197_25": 306, "25_197": 307, "85_85": 308, "134_134": 309, "187_81": 310, "81_187": 311, "199_142": 312, "142_199": 313, "143_78": 314, "78_143": 315, "200_80": 316, "80_200": 317, "82_110": 318, "110_82": 319, "47_47": 320, "136_124": 321, "124_136": 322, "136_160": 323, "160_136": 324, "140_77": 325, "77_140": 326, "140_200": 327, "200_140": 328, "140_12": 329, "12_140": 330, "175_98": 331, "98_175": 332, "175_128": 333, "128_175": 334, "175_110": 335, "110_175": 336, "87_103": 337, "103_87": 338, "97_174": 339, "174_97": 340, "197_38": 341, "38_197": 342, "36_81": 343, "81_36": 344, "100_100": 345, "100_144": 346, "144_100": 347, "36_36": 348, "2_180": 349, "180_2": 350, "148_96": 351, "96_148": 352, "31_133": 353, "133_31": 354, "6_70": 355, "70_6": 356, "84_94": 357, "94_84": 358, "197_164": 359, "164_197": 360, "158_142": 361, "142_158": 362, "2_162": 363, "162_2": 364, "5_140": 365, "140_5": 366, "95_105": 367, "105_95": 368, "131_164": 369, "164_131": 370, "159_80": 371, "80_159": 372, "159_184": 373, "184_159": 374, "77_62": 375, "62_77": 376, "77_192": 377, "192_77": 378, "186_110": 379, "110_186": 380, "66_66": 381, "162_96": 382, "96_162": 383, "162_116": 384, "116_162": 385, "162_78": 386, "78_162": 387, "162_162": 388, "162_77": 389, "77_162": 390, "162_62": 391, "62_162": 392, "162_140": 393, "140_162": 394, "181_57": 395, "57_181": 396, "181_71": 397, "71_181": 398, "181_180": 399, "180_181": 400, "124_109": 401, "109_124": 402, "77_13": 403, "13_77": 404, "77_80": 405, "80_77": 406, "15_32": 407, "32_15": 408, "147_10": 409, "10_147": 410, "20_76": 411, "76_20": 412, "198_150": 413, "150_198": 414, "195_12": 415, "12_195": 416, "195_142": 417, "142_195": 418, "71_110": 419, "110_71": 420, "71_108": 421, "108_71": 422, "71_180": 423, "180_71": 424, "148_133": 425, "133_148": 426, "108_177": 427, "177_108": 428, "110_12": 429, "12_110": 430, "87_119": 431, "119_87": 432, "21_25": 433, "25_21": 434, "64_26": 435, "26_64": 436, "64_182": 437, "182_64": 438, "64_149": 439, "149_64": 440, "64_174": 441, "174_64": 442, "6_61": 443, "61_6": 444, "53_128": 445, "128_53": 446, "47_180": 447, "180_47": 448, "189_182": 449, "182_189": 450, "189_174": 451, "174_189": 452, "74_38": 453, "38_74": 454, "147_119": 455, "119_147": 456, "120_120": 457, "120_79": 458, "79_120": 459, "120_5": 460, "5_120": 461, "120_112": 462, "112_120": 463, "16_57": 464, "57_16": 465, "66_157": 466, "157_66": 467, "180_170": 468, "170_180": 469, "182_41": 470, "41_182": 471, "64_104": 472, "104_64": 473, "60_60": 474, "82_150": 475, "150_82": 476, "57_98": 477, "98_57": 478, "198_187": 479, "187_198": 480, "96_153": 481, "153_96": 482, "145_142": 483, "142_145": 484, "87_164": 485, "164_87": 486, "87_131": 487, "131_87": 488, "57_57": 489, "148_25": 490, "25_148": 491, "53_25": 492, "25_53": 493, "143_80": 494, "80_143": 495, "181_181": 496, "108_99": 497, "99_108": 498, "20_125": 499, "125_20": 500, "20_59": 501, "59_20": 502, "56_56": 503, "6_133": 504, "133_6": 505, "82_75": 506, "75_82": 507, "72_133": 508, "133_72": 509, "21_103": 510, "103_21": 511, "184_110": 512, "110_184": 513, "184_184": 514, "184_82": 515, "82_184": 516, "184_88": 517, "88_184": 518, "172_70": 519, "70_172": 520, "106_190": 521, "190_106": 522, "110_110": 523, "147_38": 524, "38_147": 525, "31_61": 526, "61_31": 527, "78_12": 528, "12_78": 529, "181_4": 530, "4_181": 531, "123_80": 532, "80_123": 533, "123_176": 534, "176_123": 535, "123_41": 536, "41_123": 537, "123_60": 538, "60_123": 539, "123_68": 540, "68_123": 541, "123_182": 542, "182_123": 543, "21_164": 544, "164_21": 545, "5_5": 546, "170_142": 547, "142_170": 548, "170_199": 549, "199_170": 550, "187_104": 551, "104_187": 552, "77_200": 553, "200_77": 554, "77_12": 555, "12_77": 556, "64_110": 557, "110_64": 558, "64_36": 559, "36_64": 560, "96_99": 561, "99_96": 562, "6_103": 563, "103_6": 564, "197_103": 565, "103_197": 566, "12_64": 567, "64_12": 568, "12_170": 569, "170_12": 570, "12_142": 571, "142_12": 572, "12_200": 573, "200_12": 574, "12_184": 575, "184_12": 576, "12_176": 577, "176_12": 578, "12_45": 579, "45_12": 580, "12_12": 581, "12_167": 582, "167_12": 583, "12_145": 584, "145_12": 585, "12_80": 586, "80_12": 587, "12_157": 588, "157_12": 589, "12_104": 590, "104_12": 591, "12_44": 592, "44_12": 593, "15_109": 594, "109_15": 595, "24_24": 596, "24_184": 597, "184_24": 598, "24_185": 599, "185_24": 600, "57_27": 601, "27_57": 602, "147_103": 603, "103_147": 604, "70_106": 605, "106_70": 606, "87_52": 607, "52_87": 608, "190_24": 609, "24_190": 610, "167_176": 611, "176_167": 612, "167_184": 613, "184_167": 614, "153_80": 615, "80_153": 616, "39_200": 617, "200_39": 618, "12_81": 619, "81_12": 620, "151_151": 621, "129_129": 622, "117_187": 623, "187_117": 624, "117_117": 625, "12_82": 626, "82_12": 627, "97_35": 628, "35_97": 629, "12_79": 630, "79_12": 631, "12_144": 632, "144_12": 633, "53_85": 634, "85_53": 635, "149_82": 636, "82_149": 637, "198_72": 638, "72_198": 639, "131_38": 640, "38_131": 641, "93_5": 642, "5_93": 643, "53_38": 644, "38_53": 645, "40_194": 646, "194_40": 647, "165_110": 648, "110_165": 649, "135_135": 650, "78_157": 651, "157_78": 652, "110_140": 653, "140_110": 654, "110_145": 655, "145_110": 656, "124_127": 657, "127_124": 658, "155_157": 659, "157_155": 660, "155_81": 661, "81_155": 662, "162_69": 663, "69_162": 664, "195_66": 665, "66_195": 666, "131_118": 667, "118_131": 668, "23_128": 669, "128_23": 670, "198_181": 671, "181_198": 672, "148_52": 673, "52_148": 674, "12_180": 675, "180_12": 676, "12_116": 677, "116_12": 678, "12_36": 679, "36_12": 680, "78_145": 681, "145_78": 682, "31_103": 683, "103_31": 684, "154_81": 685, "81_154": 686, "108_107": 687, "107_108": 688, "96_110": 689, "110_96": 690, "62_12": 691, "12_62": 692, "62_13": 693, "13_62": 694, "96_109": 695, "109_96": 696, "99_110": 697, "110_99": 698, "99_80": 699, "80_99": 700, "99_11": 701, "11_99": 702, "95_55": 703, "55_95": 704, "78_94": 705, "94_78": 706, "172_182": 707, "182_172": 708, "198_198": 709, "111_143": 710, "143_111": 711, "111_14": 712, "14_111": 713, "111_79": 714, "79_111": 715, "111_55": 716, "55_111": 717, "111_161": 718, "161_111": 719, "193_157": 720, "157_193": 721, "111_75": 722, "75_111": 723, "111_94": 724, "94_111": 725, "24_53": 726, "53_24": 727, "24_85": 728, "85_24": 729, "24_74": 730, "74_24": 731, "11_11": 732, "103_53": 733, "53_103": 734, "147_27": 735, "27_147": 736, "153_79": 737, "79_153": 738, "153_12": 739, "12_153": 740, "153_153": 741, "153_110": 742, "110_153": 743, "155_79": 744, "79_155": 745, "17_185": 746, "185_17": 747, "50_50": 748, "190_125": 749, "125_190": 750, "136_74": 751, "74_136": 752, "136_24": 753, "24_136": 754, "154_36": 755, "36_154": 756, "64_37": 757, "37_64": 758, "64_3": 759, "3_64": 760, "16_16": 761, "117_81": 762, "81_117": 763, "114_198": 764, "198_114": 765, "90_124": 766, "124_90": 767, "154_187": 768, "187_154": 769, "154_185": 770, "185_154": 771, "87_38": 772, "38_87": 773, "195_82": 774, "82_195": 775, "109_74": 776, "74_109": 777, "72_98": 778, "98_72": 779, "75_75": 780, "55_57": 781, "57_55": 782, "50_36": 783, "36_50": 784, "50_180": 785, "180_50": 786, "158_82": 787, "82_158": 788, "55_153": 789, "153_55": 790, "58_110": 791, "110_58": 792, "103_61": 793, "61_103": 794, "55_75": 795, "75_55": 796, "55_79": 797, "79_55": 798, "55_55": 799, "198_95": 800, "95_198": 801, "111_95": 802, "95_111": 803, "78_77": 804, "77_78": 805, "78_195": 806, "195_78": 807, "78_200": 808, "200_78": 809, "78_82": 810, "82_78": 811, "78_39": 812, "39_78": 813, "78_184": 814, "184_78": 815, "78_64": 816, "64_78": 817, "78_65": 818, "65_78": 819, "78_66": 820, "66_78": 821, "78_104": 822, "104_78": 823, "78_176": 824, "176_78": 825, "78_180": 826, "180_78": 827, "78_71": 828, "71_78": 829, "78_110": 830, "110_78": 831, "78_14": 832, "14_78": 833, "78_187": 834, "187_78": 835, "78_161": 836, "161_78": 837, "78_75": 838, "75_78": 839, "78_116": 840, "116_78": 841, "71_36": 842, "36_71": 843, "71_5": 844, "5_71": 845, "190_42": 846, "42_190": 847, "31_25": 848, "25_31": 849, "91_198": 850, "198_91": 851, "91_196": 852, "196_91": 853, "129_81": 854, "81_129": 855, "55_110": 856, "110_55": 857, "55_78": 858, "78_55": 859, "55_12": 860, "12_55": 861, "55_185": 862, "185_55": 863, "130_53": 864, "53_130": 865, "143_149": 866, "149_143": 867, "49_40": 868, "40_49": 869, "49_49": 870, "186_185": 871, "185_186": 872, "148_118": 873, "118_148": 874, "182_70": 875, "70_182": 876, "182_67": 877, "67_182": 878, "182_74": 879, "74_182": 880, "21_133": 881, "133_21": 882, "99_99": 883, "99_177": 884, "177_99": 885, "67_183": 886, "183_67": 887, "184_142": 888, "142_184": 889, "184_170": 890, "170_184": 891, "85_42": 892, "42_85": 893, "85_57": 894, "57_85": 895, "5_103": 896, "103_5": 897, "121_81": 898, "81_121": 899, "121_121": 900, "180_110": 901, "110_180": 902, "180_198": 903, "198_180": 904, "140_127": 905, "127_140": 906, "179_41": 907, "41_179": 908, "110_185": 909, "185_110": 910, "110_134": 911, "134_110": 912, "197_118": 913, "118_197": 914, "94_180": 915, "180_94": 916, "147_164": 917, "164_147": 918, "31_52": 919, "52_31": 920, "79_79": 921, "187_48": 922, "48_187": 923, "187_187": 924, "171_192": 925, "192_171": 926, "69_84": 927, "84_69": 928, "124_70": 929, "70_124": 930, "131_61": 931, "61_131": 932, "48_81": 933, "81_48": 934, "6_52": 935, "52_6": 936, "53_170": 937, "170_53": 938, "155_176": 939, "176_155": 940, "193_99": 941, "99_193": 942, "121_180": 943, "180_121": 944, "24_180": 945, "180_24": 946, "147_118": 947, "118_147": 948, "27_85": 949, "85_27": 950, "182_81": 951, "81_182": 952, "182_196": 953, "196_182": 954, "182_179": 955, "179_182": 956, "171_12": 957, "12_171": 958, "114_112": 959, "112_114": 960, "114_105": 961, "105_114": 962, "114_24": 963, "24_114": 964, "85_113": 965, "113_85": 966, "140_176": 967, "176_140": 968, "140_80": 969, "80_140": 970, "88_146": 971, "146_88": 972, "169_110": 973, "110_169": 974, "75_180": 975, "180_75": 976, "77_180": 977, "180_77": 978, "142_200": 979, "200_142": 980, "176_80": 981, "80_176": 982, "176_180": 983, "180_176": 984, "55_125": 985, "125_55": 986, "55_53": 987, "53_55": 988, "131_32": 989, "32_131": 990, "95_180": 991, "180_95": 992, "78_13": 993, "13_78": 994, "78_24": 995, "24_78": 996, "158_66": 997, "66_158": 998, "108_11": 999, "11_108": 1000, "108_166": 1001, "166_108": 1002, "41_12": 1003, "12_41": 1004, "106_133": 1005, "133_106": 1006, "181_12": 1007, "12_181": 1008, "184_176": 1009, "176_184": 1010, "184_80": 1011, "80_184": 1012, "111_111": 1013, "134_52": 1014, "52_134": 1015, "145_157": 1016, "157_145": 1017, "67_26": 1018, "26_67": 1019, "111_81": 1020, "81_111": 1021, "70_85": 1022, "85_70": 1023, "105_157": 1024, "157_105": 1025, "131_133": 1026, "133_131": 1027, "171_157": 1028, "157_171": 1029, "64_145": 1030, "145_64": 1031, "95_94": 1032, "94_95": 1033, "95_95": 1034, "155_104": 1035, "104_155": 1036, "44_80": 1037, "80_44": 1038, "49_194": 1039, "194_49": 1040, "49_12": 1041, "12_49": 1042, "65_65": 1043, "67_67": 1044, "67_174": 1045, "174_67": 1046, "31_118": 1047, "118_31": 1048, "77_104": 1049, "104_77": 1050, "77_82": 1051, "82_77": 1052, "6_38": 1053, "38_6": 1054, "87_25": 1055, "25_87": 1056, "106_106": 1057, "194_194": 1058, "65_140": 1059, "140_65": 1060, "78_111": 1061, "111_78": 1062, "78_142": 1063, "142_78": 1064, "185_185": 1065, "145_145": 1066, "12_66": 1067, "66_12": 1068, "170_194": 1069, "194_170": 1070, "31_128": 1071, "128_31": 1072, "67_24": 1073, "24_67": 1074, "167_150": 1075, "150_167": 1076, "109_157": 1077, "157_109": 1078, "74_13": 1079, "13_74": 1080, "186_81": 1081, "81_186": 1082, "199_82": 1083, "82_199": 1084, "136_13": 1085, "13_136": 1086, "145_134": 1087, "134_145": 1088, "145_140": 1089, "140_145": 1090, "78_183": 1091, "183_78": 1092, "78_171": 1093, "171_78": 1094, "124_25": 1095, "25_124": 1096, "125_127": 1097, "127_125": 1098, "6_164": 1099, "164_6": 1100, "166_99": 1101, "99_166": 1102, "166_11": 1103, "11_166": 1104, "154_146": 1105, "146_154": 1106, "39_157": 1107, "157_39": 1108, "161_81": 1109, "81_161": 1110, "77_39": 1111, "39_77": 1112, "77_123": 1113, "123_77": 1114, "77_110": 1115, "110_77": 1116, "171_82": 1117, "82_171": 1118, "30_198": 1119, "198_30": 1120, "24_70": 1121, "70_24": 1122, "197_133": 1123, "133_197": 1124, "140_180": 1125, "180_140": 1126, "24_13": 1127, "13_24": 1128, "82_104": 1129, "104_82": 1130, "82_180": 1131, "180_82": 1132, "95_84": 1133, "84_95": 1134, "45_104": 1135, "104_45": 1136, "112_79": 1137, "79_112": 1138, "156_37": 1139, "37_156": 1140, "184_157": 1141, "157_184": 1142, "184_66": 1143, "66_184": 1144, "181_145": 1145, "145_181": 1146, "95_184": 1147, "184_95": 1148, "60_189": 1149, "189_60": 1150, "167_104": 1151, "104_167": 1152, "167_5": 1153, "5_167": 1154, "174_41": 1155, "41_174": 1156, "18_18": 1157, "100_81": 1158, "81_100": 1159, "109_5": 1160, "5_109": 1161, "180_79": 1162, "79_180": 1163, "142_150": 1164, "150_142": 1165, "154_29": 1166, "29_154": 1167, "131_52": 1168, "52_131": 1169, "53_4": 1170, "4_53": 1171, "47_66": 1172, "66_47": 1173, "196_174": 1174, "174_196": 1175, "196_41": 1176, "41_196": 1177, "196_3": 1178, "3_196": 1179, "196_190": 1180, "190_196": 1181, "36_185": 1182, "185_36": 1183, "145_184": 1184, "184_145": 1185, "143_151": 1186, "151_143": 1187, "5_108": 1188, "108_5": 1189, "15_81": 1190, "81_15": 1191, "82_152": 1192, "152_82": 1193, "176_96": 1194, "96_176": 1195, "176_5": 1196, "5_176": 1197, "176_181": 1198, "181_176": 1199, "176_94": 1200, "94_176": 1201, "53_157": 1202, "157_53": 1203, "94_185": 1204, "185_94": 1205, "190_154": 1206, "154_190": 1207, "48_121": 1208, "121_48": 1209, "23_23": 1210, "116_116": 1211, "116_176": 1212, "176_116": 1213, "148_30": 1214, "30_148": 1215, "121_71": 1216, "71_121": 1217, "197_61": 1218, "61_197": 1219, "39_110": 1220, "110_39": 1221, "39_36": 1222, "36_39": 1223, "75_110": 1224, "110_75": 1225, "108_180": 1226, "180_108": 1227, "142_3": 1228, "3_142": 1229, "85_93": 1230, "93_85": 1231, "57_95": 1232, "85_5": 1233, "5_85": 1234, "147_198": 1235, "198_147": 1236, "149_173": 1237, "173_149": 1238, "85_133": 1239, "133_85": 1240, "198_104": 1241, "104_198": 1242, "124_84": 1243, "84_124": 1244, "45_78": 1245, "78_45": 1246, "198_106": 1247, "106_198": 1248, "85_180": 1249, "180_85": 1250, "200_82": 1251, "82_200": 1252, "200_200": 1253, "60_68": 1254, "68_60": 1255, "76_38": 1256, "38_76": 1257, "85_33": 1258, "33_85": 1259, "161_161": 1260, "195_26": 1261, "26_195": 1262, "50_110": 1263, "110_50": 1264, "61_110": 1265, "110_61": 1266, "36_11": 1267, "11_36": 1268, "36_80": 1269, "80_36": 1270, "161_110": 1271, "110_161": 1272, "161_180": 1273, "180_161": 1274, "62_97": 1275, "97_62": 1276, "77_64": 1277, "64_77": 1278, "94_14": 1279, "14_94": 1280, "39_5": 1281, "5_39": 1282, "184_104": 1283, "104_184": 1284, "184_36": 1285, "36_184": 1286, "47_81": 1287, "81_47": 1288, "53_57": 1289, "57_53": 1290, "139_79": 1291, "79_139": 1292, "169_12": 1293, "12_169": 1294, "24_2": 1295, "2_24": 1296, "24_151": 1297, "151_24": 1298, "180_145": 1299, "145_180": 1300, "180_81": 1301, "81_180": 1302, "12_162": 1303, "162_12": 1304, "12_13": 1305, "13_12": 1306, "24_42": 1307, "42_24": 1308, "64_142": 1309, "142_64": 1310, "198_81": 1311, "81_198": 1312, "74_70": 1313, "70_74": 1314, "18_38": 1315, "38_18": 1316, "24_108": 1317, "108_24": 1318, "181_82": 1319, "82_181": 1320, "173_173": 1321, "173_81": 1322, "81_173": 1323, "96_13": 1324, "13_96": 1325, "44_44": 1326, "44_157": 1327, "157_44": 1328, "60_182": 1329, "182_60": 1330, "60_174": 1331, "174_60": 1332, "60_43": 1333, "43_60": 1334, "27_79": 1335, "79_27": 1336, "48_48": 1337, "89_198": 1338, "198_89": 1339, "111_183": 1340, "183_111": 1341, "111_70": 1342, "70_111": 1343, "14_180": 1344, "180_14": 1345, "144_79": 1346, "79_144": 1347, "81_110": 1348, "110_81": 1349, "154_162": 1350, "162_154": 1351, "19_180": 1352, "180_19": 1353, "136_180": 1354, "180_136": 1355, "136_187": 1356, "187_136": 1357, "67_70": 1358, "70_67": 1359, "181_58": 1360, "58_181": 1361, "21_135": 1362, "135_21": 1363, "180_46": 1364, "46_180": 1365, "154_84": 1366, "84_154": 1367, "144_81": 1368, "81_144": 1369, "2_63": 1370, "63_2": 1371, "36_58": 1372, "58_36": 1373, "21_118": 1374, "118_21": 1375, "57_41": 1376, "41_57": 1377, "183_109": 1378, "109_183": 1379, "136_78": 1380, "78_136": 1381, "21_61": 1382, "61_21": 1383, "102_102": 1384, "95_25": 1385, "25_95": 1386, "25_150": 1387, "150_25": 1388, "20_51": 1389, "51_20": 1390, "70_70": 1391, "87_5": 1392, "5_87": 1393, "51_151": 1394, "151_51": 1395, "94_91": 1396, "91_94": 1397, "2_5": 1398, "5_2": 1399, "13_104": 1400, "104_13": 1401, "76_184": 1402, "184_76": 1403, "76_39": 1404, "39_76": 1405, "70_126": 1406, "126_70": 1407, "51_38": 1408, "38_51": 1409, "106_135": 1410, "135_106": 1411, "68_97": 1412, "97_68": 1413, "68_68": 1414, "68_191": 1415, "191_68": 1416, "18_114": 1417, "114_18": 1418, "195_62": 1419, "62_195": 1420, "195_13": 1421, "13_195": 1422, "121_82": 1423, "82_121": 1424, "155_44": 1425, "44_155": 1426, "140_157": 1427, "157_140": 1428, "77_116": 1429, "116_77": 1430, "140_136": 1431, "136_140": 1432, "140_44": 1433, "44_140": 1434, "140_58": 1435, "58_140": 1436, "128_82": 1437, "82_128": 1438, "116_180": 1439, "180_116": 1440, "124_126": 1441, "126_124": 1442, "145_194": 1443, "194_145": 1444, "145_150": 1445, "150_145": 1446, "91_5": 1447, "5_91": 1448, "171_162": 1449, "162_171": 1450, "140_192": 1451, "192_140": 1452, "121_36": 1453, "36_121": 1454, "121_181": 1455, "181_121": 1456, "121_29": 1457, "29_121": 1458, "24_95": 1459, "95_24": 1460, "131_131": 1461, "94_143": 1462, "143_94": 1463, "143_143": 1464, "95_164": 1465, "164_95": 1466, "21_125": 1467, "125_21": 1468, "30_13": 1469, "13_30": 1470, "170_82": 1471, "82_170": 1472, "170_150": 1473, "150_170": 1474, "170_170": 1475, "78_144": 1476, "144_78": 1477, "184_195": 1478, "195_184": 1479, "21_198": 1480, "198_21": 1481, "111_99": 1482, "99_111": 1483, "55_105": 1484, "105_55": 1485, "18_198": 1486, "198_18": 1487, "18_171": 1488, "171_18": 1489, "91_81": 1490, "81_91": 1491, "183_5": 1492, "5_183": 1493, "147_122": 1494, "122_147": 1495, "31_119": 1496, "119_31": 1497, "173_180": 1498, "180_173": 1499, "140_184": 1500, "184_140": 1501, "140_155": 1502, "155_140": 1503, "82_81": 1504, "81_82": 1505, "101_18": 1506, "18_101": 1507, "67_3": 1508, "3_67": 1509, "67_12": 1510, "12_67": 1511, "24_72": 1512, "72_24": 1513, "94_94": 1514, "57_70": 1515, "70_57": 1516, "126_127": 1517, "127_126": 1518, "15_99": 1519, "99_15": 1520, "72_72": 1521, "77_128": 1522, "128_77": 1523, "139_153": 1524, "153_139": 1525, "13_139": 1526, "139_13": 1527, "162_48": 1528, "48_162": 1529, "162_187": 1530, "187_162": 1531, "131_103": 1532, "103_131": 1533, "111_42": 1534, "42_111": 1535, "36_24": 1536, "24_36": 1537, "150_150": 1538, "98_81": 1539, "81_98": 1540, "89_5": 1541, "5_89": 1542, "85_109": 1543, "109_85": 1544, "74_25": 1545, "25_74": 1546, "71_71": 1547, "71_47": 1548, "47_71": 1549, "71_163": 1550, "163_71": 1551, "71_92": 1552, "92_71": 1553, "60_176": 1554, "176_60": 1555, "33_46": 1556, "46_33": 1557, "33_177": 1558, "177_33": 1559, "33_11": 1560, "11_33": 1561, "33_110": 1562, "110_33": 1563, "67_43": 1564, "43_67": 1565, "24_63": 1566, "63_24": 1567, "104_152": 1568, "152_104": 1569, "104_72": 1570, "72_104": 1571, "74_198": 1572, "198_74": 1573, "29_110": 1574, "110_29": 1575, "104_75": 1576, "75_104": 1577, "140_96": 1578, "96_140": 1579, "140_104": 1580, "104_140": 1581, "45_142": 1582, "142_45": 1583, "156_104": 1584, "104_156": 1585, "156_3": 1586, "3_156": 1587, "156_82": 1588, "82_156": 1589, "70_144": 1590, "144_70": 1591, "81_157": 1592, "157_81": 1593, "81_81": 1594, "198_110": 1595, "110_198": 1596, "12_150": 1597, "150_12": 1598, "6_85": 1599, "85_6": 1600, "45_67": 1601, "67_45": 1602, "180_29": 1603, "29_180": 1604, "69_184": 1605, "184_69": 1606, "167_38": 1607, "38_167": 1608, "74_174": 1609, "174_74": 1610, "18_107": 1611, "107_18": 1612, "198_13": 1613, "13_198": 1614, "71_12": 1615, "12_71": 1616, "24_144": 1617, "144_24": 1618, "173_64": 1619, "64_173": 1620, "56_106": 1621, "106_56": 1622, "62_98": 1623, "98_62": 1624, "11_114": 1625, "114_11": 1626, "82_155": 1627, "155_82": 1628, "82_176": 1629, "176_82": 1630, "87_87": 1631, "200_149": 1632, "149_200": 1633, "60_191": 1634, "191_60": 1635, "198_136": 1636, "136_198": 1637, "140_114": 1638, "114_140": 1639, "180_184": 1640, "184_180": 1641, "180_146": 1642, "146_180": 1643, "180_45": 1644, "45_180": 1645, "180_58": 1646, "58_180": 1647, "180_153": 1648, "153_180": 1649, "180_186": 1650, "186_180": 1651, "180_195": 1652, "195_180": 1653, "180_171": 1654, "171_180": 1655, "180_155": 1656, "155_180": 1657, "180_185": 1658, "185_180": 1659, "180_17": 1660, "17_180": 1661, "180_44": 1662, "44_180": 1663, "180_134": 1664, "134_180": 1665, "180_36": 1666, "36_180": 1667, "77_157": 1668, "157_77": 1669, "12_113": 1670, "113_12": 1671, "12_86": 1672, "86_12": 1673, "11_133": 1674, "133_11": 1675, "21_16": 1676, "16_21": 1677, "27_53": 1678, "53_27": 1679, "124_67": 1680, "67_124": 1681, "124_128": 1682, "128_124": 1683, "70_4": 1684, "4_70": 1685, "66_5": 1686, "5_66": 1687, "66_94": 1688, "94_66": 1689, "173_134": 1690, "134_173": 1691, "200_157": 1692, "157_200": 1693, "200_104": 1694, "104_200": 1695, "39_176": 1696, "176_39": 1697, "82_167": 1698, "167_82": 1699, "48_120": 1700, "120_48": 1701, "67_74": 1702, "74_67": 1703, "182_114": 1704, "114_182": 1705, "127_2": 1706, "2_127": 1707, "57_97": 1708, "97_57": 1709, "44_110": 1710, "110_44": 1711, "44_185": 1712, "185_44": 1713, "96_18": 1714, "18_96": 1715, "53_12": 1716, "12_53": 1717, "16_109": 1718, "109_16": 1719, "107_111": 1720, "111_107": 1721, "107_180": 1722, "180_107": 1723, "155_200": 1724, "200_155": 1725, "155_110": 1726, "110_155": 1727, "188_81": 1728, "81_188": 1729, "134_5": 1730, "5_134": 1731, "64_62": 1732, "62_64": 1733, "64_13": 1734, "13_64": 1735, "64_64": 1736, "182_153": 1737, "153_182": 1738, "5_187": 1739, "187_5": 1740, "74_72": 1741, "72_74": 1742, "74_74": 1743, "190_198": 1744, "198_190": 1745, "190_38": 1746, "38_190": 1747, "2_120": 1748, "120_2": 1749, "74_127": 1750, "127_74": 1751, "136_162": 1752, "162_136": 1753, "136_144": 1754, "144_136": 1755, "136_116": 1756, "116_136": 1757, "172_149": 1758, "149_172": 1759, "198_153": 1760, "153_198": 1761, "45_157": 1762, "157_45": 1763, "165_152": 1764, "152_165": 1765, "140_142": 1766, "142_140": 1767, "111_12": 1768, "12_111": 1769, "53_143": 1770, "143_53": 1771, "27_143": 1772, "143_27": 1773, "110_147": 1774, "147_110": 1775, "75_185": 1776, "185_75": 1777, "75_145": 1778, "145_75": 1779, "75_134": 1780, "134_75": 1781, "137_167": 1782, "167_137": 1783, "176_191": 1784, "191_176": 1785, "36_75": 1786, "75_36": 1787, "45_149": 1788, "149_45": 1789, "183_125": 1790, "125_183": 1791, "145_80": 1792, "80_145": 1793, "67_133": 1794, "133_67": 1795, "85_162": 1796, "162_85": 1797, "12_57": 1798, "57_12": 1799, "181_2": 1800, "2_181": 1801, "75_12": 1802, "12_75": 1803, "85_63": 1804, "63_85": 1805, "108_111": 1806, "111_108": 1807, "27_150": 1808, "150_27": 1809, "67_94": 1810, "94_67": 1811, "19_198": 1812, "198_19": 1813, "85_84": 1814, "84_85": 1815, "155_80": 1816, "80_155": 1817, "179_81": 1818, "81_179": 1819, "51_12": 1820, "12_51": 1821, "25_125": 1822, "125_25": 1823, "149_96": 1824, "96_149": 1825, "45_62": 1826, "62_45": 1827, "129_5": 1828, "5_129": 1829, "196_196": 1830, "173_181": 1831, "181_173": 1832, "36_2": 1833, "2_36": 1834, "12_108": 1835, "108_12": 1836, "116_44": 1837, "44_116": 1838, "24_48": 1839, "48_24": 1840, "24_162": 1841, "162_24": 1842, "170_54": 1843, "54_170": 1844, "139_29": 1845, "29_139": 1846, "12_58": 1847, "58_12": 1848, "139_146": 1849, "146_139": 1850, "30_67": 1851, "67_30": 1852, "30_111": 1853, "111_30": 1854, "181_47": 1855, "47_181": 1856, "150_157": 1857, "157_150": 1858, "150_104": 1859, "104_150": 1860, "116_62": 1861, "62_116": 1862, "104_66": 1863, "66_104": 1864, "146_29": 1865, "29_146": 1866, "125_72": 1867, "72_125": 1868, "20_82": 1869, "82_20": 1870, "170_145": 1871, "145_170": 1872, "181_184": 1873, "184_181": 1874, "142_176": 1875, "176_142": 1876, "142_155": 1877, "155_142": 1878, "142_180": 1879, "180_142": 1880, "192_110": 1881, "110_192": 1882, "135_12": 1883, "12_135": 1884, "53_133": 1885, "133_53": 1886, "47_110": 1887, "110_47": 1888, "88_81": 1889, "81_88": 1890, "127_25": 1891, "25_127": 1892, "74_5": 1893, "5_74": 1894, "55_109": 1895, "109_55": 1896, "55_13": 1897, "13_55": 1898, "87_55": 1899, "55_87": 1900, "136_104": 1901, "104_136": 1902, "15_198": 1903, "198_15": 1904, "70_149": 1905, "149_70": 1906, "99_82": 1907, "82_99": 1908, "55_80": 1909, "80_55": 1910, "85_190": 1911, "190_85": 1912, "5_116": 1913, "116_5": 1914, "129_180": 1915, "180_129": 1916, "55_81": 1917, "81_55": 1918, "5_81": 1919, "81_5": 1920, "5_75": 1921, "75_5": 1922, "183_4": 1923, "4_183": 1924, "85_110": 1925, "110_85": 1926, "64_184": 1927, "184_64": 1928, "166_166": 1929, "166_70": 1930, "70_166": 1931, "166_125": 1932, "125_166": 1933, "81_80": 1934, "80_81": 1935, "81_104": 1936, "104_81": 1937, "81_78": 1938, "78_81": 1939, "81_140": 1940, "140_81": 1941, "170_78": 1942, "78_170": 1943, "45_152": 1944, "152_45": 1945, "19_162": 1946, "162_19": 1947, "170_200": 1948, "200_170": 1949, "170_140": 1950, "140_170": 1951, "77_146": 1952, "146_77": 1953, "148_70": 1954, "70_148": 1955, "24_98": 1956, "98_24": 1957, "104_18": 1958, "18_104": 1959, "14_108": 1960, "108_14": 1961, "53_53": 1962, "13_110": 1963, "110_13": 1964, "189_189": 1965, "189_35": 1966, "35_189": 1967, "39_145": 1968, "145_39": 1969, "140_128": 1970, "128_140": 1971, "140_13": 1972, "13_140": 1973, "140_75": 1974, "75_140": 1975, "74_106": 1976, "106_74": 1977, "108_134": 1978, "134_108": 1979, "108_149": 1980, "149_108": 1981, "116_104": 1982, "104_116": 1983, "2_140": 1984, "140_2": 1985, "67_39": 1986, "39_67": 1987, "158_184": 1988, "184_158": 1989, "158_26": 1990, "26_158": 1991, "136_48": 1992, "48_136": 1993, "154_129": 1994, "129_154": 1995, "154_98": 1996, "98_154": 1997, "154_48": 1998, "48_154": 1999, "45_151": 2000, "151_45": 2001, "57_125": 2002, "125_57": 2003, "176_193": 2004, "193_176": 2005, "111_105": 2006, "105_111": 2007, "175_79": 2008, "79_175": 2009, "130_70": 2010, "70_130": 2011, "154_149": 2012, "149_154": 2013, "13_181": 2014, "181_13": 2015, "74_108": 2016, "108_74": 2017, "148_38": 2018, "38_148": 2019, "72_46": 2020, "46_72": 2021, "13_95": 2022, "95_13": 2023, "70_95": 2024, "95_70": 2025, "181_151": 2026, "151_181": 2027, "182_150": 2028, "150_182": 2029, "184_120": 2030, "120_184": 2031, "70_40": 2032, "40_70": 2033, "97_191": 2034, "191_97": 2035, "129_2": 2036, "2_129": 2037, "139_12": 2038, "12_139": 2039, "117_144": 2040, "144_117": 2041, "124_114": 2042, "114_124": 2043, "198_48": 2044, "48_198": 2045, "198_162": 2046, "162_198": 2047, "64_176": 2048, "176_64": 2049, "154_24": 2050, "24_154": 2051, "156_157": 2052, "157_156": 2053, "200_125": 2054, "125_200": 2055, "176_108": 2056, "108_176": 2057, "176_177": 2058, "177_176": 2059, "195_110": 2060, "110_195": 2061, "195_140": 2062, "140_195": 2063, "94_109": 2064, "109_94": 2065, "150_85": 2066, "85_150": 2067, "150_41": 2068, "41_150": 2069, "128_24": 2070, "24_128": 2071, "140_82": 2072, "82_140": 2073, "142_149": 2074, "149_142": 2075, "124_118": 2076, "118_124": 2077, "140_109": 2078, "109_140": 2079, "140_125": 2080, "125_140": 2081, "53_197": 2082, "197_53": 2083, "149_39": 2084, "39_149": 2085, "149_140": 2086, "140_149": 2087, "39_12": 2088, "12_39": 2089, "58_82": 2090, "82_58": 2091, "134_82": 2092, "82_134": 2093, "104_110": 2094, "110_104": 2095, "176_75": 2096, "75_176": 2097, "27_2": 2098, "2_27": 2099, "110_200": 2100, "200_110": 2101, "27_164": 2102, "164_27": 2103, "12_192": 2104, "192_12": 2105, "12_128": 2106, "128_12": 2107, "97_198": 2108, "198_97": 2109, "57_164": 2110, "164_57": 2111, "67_85": 2112, "85_67": 2113, "184_47": 2114, "47_184": 2115, "153_82": 2116, "82_153": 2117, "137_41": 2118, "41_137": 2119, "115_57": 2120, "57_115": 2121, "115_115": 2122, "70_96": 2123, "96_70": 2124, "174_15": 2125, "15_174": 2126, "94_85": 2127, "85_94": 2128, "58_151": 2129, "151_58": 2130, "134_118": 2131, "118_134": 2132, "18_10": 2133, "10_18": 2134, "136_182": 2135, "182_136": 2136, "85_25": 2137, "25_85": 2138, "96_79": 2139, "79_96": 2140, "81_58": 2141, "58_81": 2142, "81_71": 2143, "71_81": 2144, "124_121": 2145, "121_124": 2146, "2_53": 2147, "53_2": 2148, "2_39": 2149, "39_2": 2150, "2_110": 2151, "110_2": 2152, "77_20": 2153, "20_77": 2154, "122_157": 2155, "157_122": 2156, "5_184": 2157, "184_5": 2158, "78_36": 2159, "36_78": 2160, "36_155": 2161, "155_36": 2162, "74_110": 2163, "110_74": 2164, "162_65": 2165, "65_162": 2166, "199_150": 2167, "150_199": 2168, "155_62": 2169, "62_155": 2170, "123_110": 2171, "110_123": 2172, "123_97": 2173, "97_123": 2174, "60_12": 2175, "12_60": 2176, "60_77": 2177, "77_60": 2178, "60_177": 2179, "177_60": 2180, "60_41": 2181, "41_60": 2182, "60_97": 2183, "97_60": 2184, "64_200": 2185, "200_64": 2186, "192_24": 2187, "24_192": 2188, "98_74": 2189, "74_98": 2190, "145_47": 2191, "47_145": 2192, "145_81": 2193, "81_145": 2194, "49_10": 2195, "10_49": 2196, "187_36": 2197, "36_187": 2198, "187_144": 2199, "144_187": 2200, "62_85": 2201, "85_62": 2202, "180_162": 2203, "162_180": 2204, "136_81": 2205, "81_136": 2206, "49_66": 2207, "66_49": 2208, "27_126": 2209, "126_27": 2210, "24_140": 2211, "140_24": 2212, "62_80": 2213, "80_62": 2214, "62_176": 2215, "176_62": 2216, "180_62": 2217, "62_180": 2218, "180_5": 2219, "5_180": 2220, "181_134": 2221, "134_181": 2222, "62_200": 2223, "200_62": 2224, "81_46": 2225, "46_81": 2226, "81_11": 2227, "11_81": 2228, "106_57": 2229, "57_106": 2230, "78_80": 2231, "80_78": 2232, "139_118": 2233, "118_139": 2234, "181_171": 2235, "171_181": 2236, "154_18": 2237, "18_154": 2238, "82_45": 2239, "45_82": 2240, "82_185": 2241, "185_82": 2242, "67_126": 2243, "126_67": 2244, "188_12": 2245, "12_188": 2246, "108_173": 2247, "173_108": 2248, "136_36": 2249, "36_136": 2250, "171_11": 2251, "11_171": 2252, "77_170": 2253, "170_77": 2254, "137_149": 2255, "149_137": 2256, "146_121": 2257, "121_146": 2258, "195_167": 2259, "167_195": 2260, "82_139": 2261, "139_82": 2262, "82_67": 2263, "67_82": 2264, "82_74": 2265, "74_82": 2266, "82_3": 2267, "3_82": 2268, "140_116": 2269, "116_140": 2270, "195_153": 2271, "153_195": 2272, "124_75": 2273, "75_124": 2274, "15_25": 2275, "25_15": 2276, "91_61": 2277, "61_91": 2278, "67_190": 2279, "190_67": 2280, "70_79": 2281, "79_70": 2282, "110_51": 2283, "51_110": 2284, "85_69": 2285, "69_85": 2286, "154_195": 2287, "195_154": 2288, "199_12": 2289, "12_199": 2290, "55_180": 2291, "180_55": 2292, "64_194": 2293, "194_64": 2294, "48_144": 2295, "144_48": 2296, "48_180": 2297, "180_48": 2298, "48_150": 2299, "150_48": 2300, "94_27": 2301, "27_94": 2302, "167_72": 2303, "72_167": 2304, "5_155": 2305, "155_5": 2306, "172_146": 2307, "146_172": 2308, "48_13": 2309, "13_48": 2310, "5_201": 2311, "201_5": 2312, "70_171": 2313, "171_70": 2314, "70_177": 2315, "177_70": 2316, "187_12": 2317, "12_187": 2318, "42_18": 2319, "18_42": 2320, "24_111": 2321, "111_24": 2322, "88_41": 2323, "41_88": 2324, "70_84": 2325, "84_70": 2326, "184_37": 2327, "37_184": 2328, "19_187": 2329, "187_19": 2330, "19_136": 2331, "136_19": 2332, "124_15": 2333, "15_124": 2334, "155_12": 2335, "12_155": 2336, "162_17": 2337, "17_162": 2338, "79_110": 2339, "110_79": 2340, "94_81": 2341, "81_94": 2342, "180_80": 2343, "80_180": 2344, "180_157": 2345, "157_180": 2346, "105_79": 2347, "79_105": 2348, "44_184": 2349, "184_44": 2350, "44_36": 2351, "36_44": 2352, "177_36": 2353, "36_177": 2354, "177_177": 2355, "177_181": 2356, "181_177": 2357, "177_11": 2358, "11_177": 2359, "177_15": 2360, "15_177": 2361, "176_200": 2362, "200_176": 2363, "96_157": 2364, "157_96": 2365, "3_149": 2366, "149_3": 2367, "84_174": 2368, "174_84": 2369, "147_72": 2370, "72_147": 2371, "149_110": 2372, "110_149": 2373, "115_106": 2374, "106_115": 2375, "21_36": 2376, "36_21": 2377, "119_103": 2378, "103_119": 2379, "85_163": 2380, "163_85": 2381, "161_74": 2382, "74_161": 2383, "173_157": 2384, "157_173": 2385, "70_151": 2386, "151_70": 2387, "40_142": 2388, "142_40": 2389, "63_63": 2390, "184_26": 2391, "26_184": 2392, "24_200": 2393, "200_24": 2394, "4_82": 2395, "82_4": 2396, "74_164": 2397, "164_74": 2398, "198_5": 2399, "5_198": 2400, "140_64": 2401, "64_140": 2402, "57_61": 2403, "61_57": 2404, "188_75": 2405, "75_188": 2406, "201_155": 2407, "155_201": 2408, "201_201": 2409, "201_12": 2410, "12_201": 2411, "201_82": 2412, "82_201": 2413, "201_158": 2414, "158_201": 2415, "201_57": 2416, "57_201": 2417, "201_195": 2418, "195_201": 2419, "201_13": 2420, "13_201": 2421, "201_53": 2422, "53_201": 2423, "201_149": 2424, "149_201": 2425, "5_133": 2426, "133_5": 2427, "190_53": 2428, "53_190": 2429, "9_79": 2430, "79_9": 2431, "173_195": 2432, "195_173": 2433, "85_118": 2434, "118_85": 2435, "60_99": 2436, "99_60": 2437, "24_147": 2438, "147_24": 2439, "27_125": 2440, "125_27": 2441, "11_110": 2442, "110_11": 2443, "11_80": 2444, "80_11": 2445, "39_41": 2446, "41_39": 2447, "174_147": 2448, "147_174": 2449, "3_198": 2450, "198_3": 2451, "12_24": 2452, "24_12": 2453, "57_122": 2454, "122_57": 2455, "181_190": 2456, "190_181": 2457, "181_133": 2458, "133_181": 2459, "65_82": 2460, "82_65": 2461, "182_84": 2462, "84_182": 2463, "170_40": 2464, "40_170": 2465, "170_72": 2466, "72_170": 2467, "170_49": 2468, "49_170": 2469, "170_149": 2470, "149_170": 2471, "170_84": 2472, "84_170": 2473, "170_174": 2474, "174_170": 2475, "170_172": 2476, "172_170": 2477, "170_169": 2478, "169_170": 2479, "170_24": 2480, "24_170": 2481, "111_200": 2482, "200_111": 2483, "70_125": 2484, "125_70": 2485, "24_113": 2486, "113_24": 2487, "20_45": 2488, "45_20": 2489, "110_167": 2490, "167_110": 2491, "12_65": 2492, "65_12": 2493, "173_185": 2494, "185_173": 2495, "136_82": 2496, "82_136": 2497, "154_63": 2498, "63_154": 2499, "95_15": 2500, "15_95": 2501, "45_26": 2502, "26_45": 2503, "39_142": 2504, "142_39": 2505, "36_82": 2506, "82_36": 2507, "126_24": 2508, "24_126": 2509, "126_180": 2510, "180_126": 2511, "39_194": 2512, "194_39": 2513, "111_181": 2514, "181_111": 2515, "55_143": 2516, "143_55": 2517, "180_150": 2518, "150_180": 2519, "48_103": 2520, "103_48": 2521, "158_38": 2522, "38_158": 2523, "24_96": 2524, "96_24": 2525, "91_120": 2526, "120_91": 2527, "108_102": 2528, "102_108": 2529, "162_60": 2530, "60_162": 2531, "64_150": 2532, "150_64": 2533, "64_167": 2534, "167_64": 2535, "183_44": 2536, "44_183": 2537, "145_176": 2538, "176_145": 2539, "168_168": 2540, "50_181": 2541, "181_50": 2542, "128_149": 2543, "149_128": 2544, "183_110": 2545, "110_183": 2546, "129_29": 2547, "29_129": 2548, "128_170": 2549, "170_128": 2550, "187_110": 2551, "110_187": 2552, "48_124": 2553, "124_48": 2554, "48_29": 2555, "29_48": 2556, "74_119": 2557, "119_74": 2558, "61_155": 2559, "155_61": 2560, "136_151": 2561, "151_136": 2562, "136_2": 2563, "2_136": 2564, "134_151": 2565, "151_134": 2566, "94_198": 2567, "198_94": 2568, "148_56": 2569, "56_148": 2570, "33_33": 2571, "33_27": 2572, "27_33": 2573, "88_104": 2574, "104_88": 2575, "171_77": 2576, "77_171": 2577, "171_176": 2578, "176_171": 2579, "39_80": 2580, "80_39": 2581, "179_91": 2582, "91_179": 2583, "5_23": 2584, "23_5": 2585, "174_167": 2586, "167_174": 2587, "90_130": 2588, "130_90": 2589, "90_57": 2590, "57_90": 2591, "53_3": 2592, "3_53": 2593, "154_12": 2594, "12_154": 2595, "124_97": 2596, "97_124": 2597, "124_98": 2598, "98_124": 2599, "118_118": 2600, "16_200": 2601, "200_16": 2602, "173_36": 2603, "36_173": 2604, "31_70": 2605, "70_31": 2606, "31_71": 2607, "71_31": 2608, "88_113": 2609, "113_88": 2610, "150_59": 2611, "59_150": 2612, "124_39": 2613, "39_124": 2614, "36_190": 2615, "190_36": 2616, "36_181": 2617, "181_36": 2618, "36_117": 2619, "117_36": 2620, "36_100": 2621, "100_36": 2622, "36_149": 2623, "149_36": 2624, "176_157": 2625, "157_176": 2626, "174_13": 2627, "13_174": 2628, "174_42": 2629, "42_174": 2630, "36_140": 2631, "140_36": 2632, "124_105": 2633, "105_124": 2634, "104_26": 2635, "26_104": 2636, "85_129": 2637, "129_85": 2638, "85_16": 2639, "16_85": 2640, "85_114": 2641, "114_85": 2642, "81_185": 2643, "185_81": 2644, "81_74": 2645, "74_81": 2646, "147_111": 2647, "111_147": 2648, "16_153": 2649, "153_16": 2650, "176_97": 2651, "97_176": 2652, "147_120": 2653, "120_147": 2654, "124_57": 2655, "57_124": 2656, "124_152": 2657, "152_124": 2658, "108_110": 2659, "110_108": 2660, "151_74": 2661, "74_151": 2662, "158_180": 2663, "180_158": 2664, "98_56": 2665, "56_98": 2666, "2_121": 2667, "121_2": 2668, "125_38": 2669, "38_125": 2670, "112_81": 2671, "81_112": 2672, "112_161": 2673, "161_112": 2674, "112_5": 2675, "5_112": 2676, "67_139": 2677, "139_67": 2678, "174_32": 2679, "32_174": 2680, "196_67": 2681, "67_196": 2682, "129_48": 2683, "48_129": 2684, "18_12": 2685, "12_18": 2686, "70_72": 2687, "72_70": 2688, "100_187": 2689, "187_100": 2690, "182_53": 2691, "53_182": 2692, "62_110": 2693, "110_62": 2694, "27_70": 2695, "70_27": 2696, "128_70": 2697, "70_128": 2698, "158_59": 2699, "59_158": 2700, "112_98": 2701, "98_112": 2702, "69_47": 2703, "47_69": 2704, "69_110": 2705, "110_69": 2706, "162_146": 2707, "146_162": 2708, "57_74": 2709, "74_57": 2710, "80_80": 2711, "114_79": 2712, "79_114": 2713, "111_5": 2714, "5_111": 2715, "131_110": 2716, "110_131": 2717, "124_104": 2718, "104_124": 2719, "143_109": 2720, "109_143": 2721, "143_81": 2722, "81_143": 2723, "195_195": 2724, "21_70": 2725, "70_21": 2726, "24_110": 2727, "110_24": 2728, "104_79": 2729, "79_104": 2730, "81_13": 2731, "13_81": 2732, "39_79": 2733, "79_39": 2734, "27_24": 2735, "24_27": 2736, "89_108": 2737, "108_89": 2738, "124_190": 2739, "190_124": 2740, "107_53": 2741, "53_107": 2742, "82_183": 2743, "183_82": 2744, "18_4": 2745, "4_18": 2746, "180_149": 2747, "149_180": 2748, "190_146": 2749, "146_190": 2750, "27_44": 2751, "44_27": 2752, "129_125": 2753, "125_129": 2754, "129_96": 2755, "96_129": 2756, "70_3": 2757, "3_70": 2758, "72_53": 2759, "53_72": 2760, "72_56": 2761, "56_72": 2762, "190_81": 2763, "81_190": 2764, "99_171": 2765, "171_99": 2766, "180_74": 2767, "74_180": 2768, "31_57": 2769, "57_31": 2770, "71_127": 2771, "127_71": 2772, "136_53": 2773, "53_136": 2774, "158_150": 2775, "150_158": 2776, "158_194": 2777, "194_158": 2778, "91_25": 2779, "25_91": 2780, "129_164": 2781, "164_129": 2782, "74_63": 2783, "63_74": 2784, "144_96": 2785, "96_144": 2786, "135_70": 2787, "70_135": 2788, "72_181": 2789, "181_72": 2790, "73_142": 2791, "142_73": 2792, "74_124": 2793, "124_74": 2794, "123_43": 2795, "43_123": 2796, "13_124": 2797, "124_13": 2798, "143_99": 2799, "99_143": 2800, "29_81": 2801, "81_29": 2802, "181_29": 2803, "29_181": 2804, "79_10": 2805, "10_79": 2806, "97_5": 2807, "5_97": 2808, "78_159": 2809, "159_78": 2810, "78_44": 2811, "44_78": 2812, "78_99": 2813, "99_78": 2814, "78_185": 2815, "185_78": 2816, "199_194": 2817, "194_199": 2818, "152_58": 2819, "58_152": 2820, "53_146": 2821, "146_53": 2822, "114_104": 2823, "104_114": 2824, "161_82": 2825, "82_161": 2826, "167_143": 2827, "143_167": 2828, "167_71": 2829, "71_167": 2830, "167_180": 2831, "180_167": 2832, "124_198": 2833, "198_124": 2834, "104_5": 2835, "5_104": 2836, "104_154": 2837, "154_104": 2838, "105_102": 2839, "102_105": 2840, "154_144": 2841, "144_154": 2842, "145_66": 2843, "66_145": 2844, "145_79": 2845, "79_145": 2846, "170_66": 2847, "66_170": 2848, "5_136": 2849, "136_5": 2850, "154_13": 2851, "13_154": 2852, "198_26": 2853, "26_198": 2854, "39_61": 2855, "61_39": 2856, "124_36": 2857, "36_124": 2858, "53_97": 2859, "97_53": 2860, "5_127": 2861, "127_5": 2862, "124_66": 2863, "66_124": 2864, "181_108": 2865, "108_181": 2866, "110_157": 2867, "157_110": 2868, "111_57": 2869, "57_111": 2870, "5_94": 2871, "94_5": 2872, "140_79": 2873, "79_140": 2874, "75_79": 2875, "79_75": 2876, "75_45": 2877, "45_75": 2878, "75_187": 2879, "187_75": 2880, "75_173": 2881, "173_75": 2882, "75_153": 2883, "153_75": 2884, "75_142": 2885, "142_75": 2886, "75_170": 2887, "170_75": 2888, "75_64": 2889, "64_75": 2890, "75_47": 2891, "47_75": 2892, "75_77": 2893, "77_75": 2894, "75_46": 2895, "46_75": 2896, "75_200": 2897, "200_75": 2898, "75_162": 2899, "162_75": 2900, "75_184": 2901, "184_75": 2902, "75_195": 2903, "195_75": 2904, "75_155": 2905, "155_75": 2906, "75_116": 2907, "116_75": 2908, "75_76": 2909, "76_75": 2910, "75_150": 2911, "150_75": 2912, "75_44": 2913, "44_75": 2914, "16_3": 2915, "3_16": 2916, "30_83": 2917, "83_30": 2918, "22_146": 2919, "146_22": 2920, "53_171": 2921, "171_53": 2922, "85_30": 2923, "30_85": 2924, "53_30": 2925, "30_53": 2926, "67_194": 2927, "194_67": 2928, "75_80": 2929, "80_75": 2930, "113_79": 2931, "79_113": 2932, "185_79": 2933, "79_185": 2934, "185_45": 2935, "45_185": 2936, "185_12": 2937, "12_185": 2938, "124_95": 2939, "95_124": 2940, "70_121": 2941, "121_70": 2942, "124_149": 2943, "149_124": 2944, "131_56": 2945, "56_131": 2946, "198_69": 2947, "69_198": 2948, "201_116": 2949, "116_201": 2950, "160_160": 2951, "160_15": 2952, "15_160": 2953, "85_74": 2954, "74_85": 2955, "103_85": 2956, "85_103": 2957, "84_102": 2958, "102_84": 2959, "171_71": 2960, "71_171": 2961, "198_52": 2962, "52_198": 2963, "31_31": 2964, "171_125": 2965, "125_171": 2966, "171_128": 2967, "128_171": 2968, "2_198": 2969, "198_2": 2970, "131_36": 2971, "36_131": 2972, "143_184": 2973, "184_143": 2974, "96_112": 2975, "112_96": 2976, "24_18": 2977, "18_24": 2978, "122_53": 2979, "53_122": 2980, "124_135": 2981, "135_124": 2982, "181_64": 2983, "64_181": 2984, "181_140": 2985, "140_181": 2986, "57_23": 2987, "23_57": 2988, "126_13": 2989, "13_126": 2990, "51_198": 2991, "198_51": 2992, "173_47": 2993, "47_173": 2994, "173_29": 2995, "29_173": 2996, "143_48": 2997, "48_143": 2998, "97_179": 2999, "179_97": 3000, "97_137": 3001, "137_97": 3002, "97_70": 3003, "70_97": 3004, "97_190": 3005, "190_97": 3006, "145_185": 3007, "185_145": 3008, "176_56": 3009, "56_176": 3010, "144_144": 3011, "77_195": 3012, "195_77": 3013, "200_145": 3014, "145_200": 3015, "108_79": 3016, "79_108": 3017, "27_74": 3018, "74_27": 3019, "95_93": 3020, "93_95": 3021, "55_94": 3022, "94_55": 3023, "15_15": 3024, "78_139": 3025, "139_78": 3026, "78_153": 3027, "153_78": 3028, "78_79": 3029, "79_78": 3030, "78_175": 3031, "175_78": 3032, "78_146": 3033, "146_78": 3034, "78_87": 3035, "87_78": 3036, "78_201": 3037, "201_78": 3038, "145_177": 3039, "177_145": 3040, "3_174": 3041, "174_3": 3042, "171_110": 3043, "110_171": 3044, "124_146": 3045, "146_124": 3046, "124_130": 3047, "130_124": 3048, "125_133": 3049, "133_125": 3050, "24_171": 3051, "171_24": 3052, "124_195": 3053, "195_124": 3054, "85_79": 3055, "79_85": 3056, "24_146": 3057, "146_24": 3058, "62_104": 3059, "104_62": 3060, "62_82": 3061, "82_62": 3062, "42_12": 3063, "12_42": 3064, "199_182": 3065, "182_199": 3066, "199_40": 3067, "40_199": 3068, "77_36": 3069, "36_77": 3070, "126_52": 3071, "52_126": 3072, "85_15": 3073, "15_85": 3074, "18_74": 3075, "74_18": 3076, "24_121": 3077, "121_24": 3078, "167_55": 3079, "55_167": 3080, "86_86": 3081, "86_175": 3082, "175_86": 3083, "86_110": 3084, "110_86": 3085, "151_85": 3086, "85_151": 3087, "98_42": 3088, "42_98": 3089, "175_114": 3090, "114_175": 3091, "175_175": 3092, "195_149": 3093, "149_195": 3094, "51_157": 3095, "157_51": 3096, "53_124": 3097, "124_53": 3098, "44_55": 3099, "55_44": 3100, "96_12": 3101, "12_96": 3102, "96_63": 3103, "63_96": 3104, "152_157": 3105, "157_152": 3106, "146_70": 3107, "70_146": 3108, "146_57": 3109, "57_146": 3110, "146_127": 3111, "127_146": 3112, "146_52": 3113, "52_146": 3114, "183_143": 3115, "143_183": 3116, "48_155": 3117, "155_48": 3118, "57_22": 3119, "22_57": 3120, "88_29": 3121, "29_88": 3122, "110_80": 3123, "80_110": 3124, "110_176": 3125, "176_110": 3126, "53_94": 3127, "94_53": 3128, "57_135": 3129, "135_57": 3130, "55_4": 3131, "4_55": 3132, "55_187": 3133, "187_55": 3134, "55_8": 3135, "8_55": 3136, "111_6": 3137, "6_111": 3138, "198_143": 3139, "143_198": 3140, "167_139": 3141, "139_167": 3142, "198_105": 3143, "105_198": 3144, "56_38": 3145, "38_56": 3146, "182_174": 3147, "174_182": 3148, "124_17": 3149, "17_124": 3150, "200_136": 3151, "136_200": 3152, "170_104": 3153, "104_170": 3154, "70_113": 3155, "113_70": 3156, "136_85": 3157, "85_136": 3158, "64_121": 3159, "121_64": 3160, "64_198": 3161, "198_64": 3162, "95_143": 3163, "143_95": 3164, "179_149": 3165, "149_179": 3166, "142_194": 3167, "194_142": 3168, "142_196": 3169, "196_142": 3170, "24_187": 3171, "187_24": 3172, "24_17": 3173, "17_24": 3174, "27_128": 3175, "128_27": 3176, "121_5": 3177, "5_121": 3178, "62_109": 3179, "109_62": 3180, "142_192": 3181, "192_142": 3182, "58_64": 3183, "64_58": 3184, "24_81": 3185, "81_24": 3186, "128_104": 3187, "104_128": 3188, "145_104": 3189, "104_145": 3190, "131_57": 3191, "57_131": 3192, "44_159": 3193, "159_44": 3194, "44_69": 3195, "69_44": 3196, "44_82": 3197, "82_44": 3198, "87_139": 3199, "139_87": 3200, "74_157": 3201, "157_74": 3202, "197_129": 3203, "129_197": 3204, "180_190": 3205, 